package com.softcraft.calendar.History;

import androidx.core.view.InputDeviceCompat;

import java.util.ArrayList;
import java.util.List;

public class CommonCalendarData {
    public static final int[] getThagavalCategory = new int[]{1, 1, 5, 5, 2, 3, 5, 6, 8, 5, 6, 7, 1, 3, 2, 7, 1, 8, 1, 4, 1, 1, 7, 7, 6, 4, 4, 4, 7, 1, 7, 1, 1, 7, 1, 1, 7, 7, 1, 1, 4, 7, 7, 7, 4, 4, 4, 4, 7, 7, 1, 1, 1, 1, 1, 7, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 8, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 4, 8, 2, 2, 8, 2, 2, 2, 2, 2, 7, 2, 2, 2, 2, 1, 2, 2, 4, 2, 2, 2, 2, 2, 8, 2, 2, 2, 2, 2, 2, 2, 7, 1, 7, 7, 2, 7, 7, 7, 7, 1, 1, 1, 2, 7, 7, 2, 7, 2, 7, 2, 2, 2, 7, 3, 8, 7, 7, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 8, 4, 1, 2, 2, 2, 2, 2, 5, 1, 1, 4, 4, 4, 1, 1, 7, 2, 7, 2, 2, 2, 2, 2, 8, 8, 2, 2, 2, 2, 2, 2, 2, 2, 2, 8, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 4, 8, 8, 2, 8, 8, 2, 8, 1, 7, 7, 7, 7, 1, 7, 7, 7, 3, 1, 2, 1, 8, 8, 8, 8, 9, 9, 8, 8, 8, 8, 8, 8, 2, 2, 2, 8, 3, 8, 2, 2, 2, 8, 3, 5, 8, 8, 8, 6, 4, 8, 7, 8, 9, 8, 8, 7, 10, 3, 10, 8, 10, 8, 8, 8, 10, 8, 2, 10, 2, 3, 10, 2, 7, 8, 2, 2, 2, 8, 8, 8, 3, 10, 8, 8, 3, 8, 8, 8, 8, 3, 8, 10, 3, 3, 3, 8, 3, 3, 4, 2, 3, 10, 10, 3, 3, 3, 3, 3, 7, 3, 3, 10, 2, 2, 2, 2, 3, 7, 2, 3, 10, 7, 2, 2, 10, 9, 4, 1, 8, 10, 3, 2, 2, 10};
    public static String[] proverbs = new String[]{"விடாமுயற்சி வெற்றியைத் தேடித் தரும்", "இறைவனை மனதார வணங்க இயலாததும் நடக்கும்.", "அதிகமாக வளைபவன் ஆபத்தானவன்", "இருளை திட்டுவதற்கு பதிலாக விளக்கின் மூலம் ஒளியை கொண்டு வா.", "கீழே விழுந்துவிட்டேன் என்று நினைக்காதே. நீ விழுந்தது மரமாய் எழுவதற்கு.", "உழைக்கும் சமயத்தில் ஏற்படும் கஷ்டம். பலனை அனுபவிக்கும் போது முடிந்து விடும்.", "நாளையை நினைத்து கவலை கொள்ளாதே. நாளை இறைவன் கையில் உள்ளது.", "அரைத்தாலும் சந்தனம் தன் மணம் குன்றாது", "ஆள் பாதி, ஆடை பாதி", "அக்கரைக்கு இக்கரை பச்சை", "அக்காள் இருக்கிற வரைக்கும் தான் மச்சான் உறவு", "நீங்கள் செய்கின்ற வேலைதான் உங்கள் வாழ்க்கையின் பெரும்பகுதியை நிரப்பப் போகின்றது.", "தைரியமே சிறந்த செல்வம்.", "செய்கின்ற வேலையை மனதார செய்யுங்கள்.", "உங்களுக்கான நேரம் குறைவானது, அதில் வேறொருவரின் வாழ்க்கையை வாழாதீர்கள்.", "உங்கள் வாழ்க்கை உங்கள் கையில்", "தேவைப்படுவதை பெறுவதற்கு தொடர்ந்து செயல்பட்டுக்கொண்டே இருங்கள். .", "ஆன்றோர் சொல்லை தட்டாதே", "சந்தோஷமாக கழித்த தினங்களே நீங்கள் வாழ்ந்த தினங்கள்.", "மிகச் சிறந்தவை கடின உழைப்பால் தான் வரும்.", "வெற்றியைப் பெற தயாராவதுதான் வெற்றியைப் பெறுவதற்கான முதல் படி.", "குறை சொல்வதை காட்டிலும் தீர்வை சொல்லுங்கள்.", "பிரச்சனையைப் பற்றி சிந்திப்பதை விட தீர்வை தேடுங்கள்.", "உங்கள் பிரச்சனைகளுக்கான பதில் உங்களிடம் தான் உள்ளது.", "மனித மனம் எதை நம்பி திட்டமிடுகிறதோ, அதை அடைந்தே தீரும்.", "பெரிய விஷயங்களை செய்வதைக் காட்டிலும் சிறிய விஷயங்களை சிறந்த வழியில் செய்யுங்கள்.", "வாயுள்ள பிள்ளை தான் பிழைக்கும்", "வல்லவனாக இருந்தால் புல்லும் கூட ஆயுதம் தான்.", "ஆபத்துக்கு பாவம் இல்லை", "உங்கள் வெற்றி உங்களிடம் தான் உள்ளது.", "எதற்காகவும் காத்திருக்க வேண்டாம், இந்த நிமிடமே சரியான நேரம்.", "நமது செயல்பாடே, அறிவுத்திறனுக்கான உண்மையான அளவுகோலாகும்.", "அறிவை நோக்கி தொடர்ந்து செல்லும் பாதையே, வெற்றிக்கான வழி.", "விருப்பமே, அனைத்து வெற்றிகளுக்குமான முதல் படியாகும்.", "உங்களுக்கான மிகப்பெரிய வாய்ப்பானது, நீங்கள் இப்பொழுது எங்கிருக்கீறீர்களோ அங்கேயேகூட இருக்கலாம்.", "போராட்டம் இல்லை என்றால் வெற்றி இல்லை.", "போராட்ட குணத்தைக் கைவிட மறுப்பவர்களுக்கு, வெற்றி எப்பொழுதும் சாத்தியமே.", "துயரங்கள் பகைவர்களைக் கூட ஒன்று படுத்தும்.", "அரசன் அதிகாரம் அவன் நாட்டுடன்", "ஆசைக்கு அளவில்லை", "முடியாது என்ற வார்த்தை முட்டாள்களின் அகராதியில் காணக்கூடிய ஒன்று.", "உங்கள் எதிரி தவறு செய்யும் போது, ஒருபோதும் அதில் குறுக்கீடு செய்யாதீர்கள்.", "உங்கள் அனுபவமே உங்களது சிறந்த ஆசான்.", "உலகம் பலவிதம், அதில் நீயும் ஒரு விதம்", "உலகத்தோடு ஒத்து வாழுதல் வேண்டும்", "உருவு கண்டு எள்ளாமை வேண்டும்", "சோர்விலும் பொறுமையாக இருப்பதே ஒரு வீரனுக்கான தகுதி.", "உடைகளை தூக்கி எறிவது போல கவலைகளையும் தூக்கி எறியுங்கள்.", "தைரியம் துன்பத்தை விரட்ட வல்லது.", "எப்போதும் பிறரை நம்பாமல் நீங்களே செய்யும் காரியம். சரியாக இருக்கும்.", "நமது உடலுக்கு தேவைப்படும் சிறந்த சிகிச்சை, அமைதியான மனமே.", "வெற்றி கிடைக்குமோ என்ற அச்சம், கண்டிப்பாக தோல்வியை நோக்கி நகர்த்திடும்", "தேவையுடன், திறனையும் கணக்கில் எடுத்துக் கொள்ள அதுவே வெற்றிக்கு வழி வகை செய்கிறது.", "மனத் தூய்மை இறை நிலை அடைய உதவுகிறது.", "கல்வி பல தல முறை தாண்டிச் செல்லும்.", "உப்பு இட்டவரை உள்ளளவும் நினை", "எப்பொழுதும் விவேகத்துடன் சிந்தனை செய்.", "உண்மையாய் வாழ்பவர்கள் சரியான செயலை தான் செய்கிறார்கள்.", "உங்கள் வாழ்க்கை பலவற்றைக் கற்றுத் தரும் ஒரு பல்கலைக் கழகம்.", "சுய விழிப்புணர்வு பிரச்சனைகளை தவிர்க்கும்.", "துன்பத்தின் பயன் இன்பம் ஆகும்.", "எப்போதெல்லாம் உங்களால் முடியுமோ அப்போதெல்லாம் சிரியுங்கள். சிரிப்பு ஒரு மலிவான மருந்து.", "சத்தியத்திற்கான முதல் பாதையாக சகிப்புத்தன்மை இருக்கிறது.", "உண்மை எப்போதும் வித்தியாசமானது.", "நல்ல அறிவுரை விலை மதிப்பு அற்றது.", "எதிர்காலத்தின் மிகச்சிறந்த தீர்க்கதரிசி கடந்தகாலம்.", "ஒரு துளி மை ஒரு மில்லியன் சிந்தனைகளை உருவாக்கலாம்.", "மிகச்சிறந்த காரியத்தில் மரணித்தவர்கள் ஒருபோதும் தோற்பதில்லை.", "மகிழ்ச்சியைப் பெறவேண்டுமானால், அதைக் கண்டிப்பாக பகிர்ந்து கொள்ள வேண்டும்.", "மனிதர்களுக்கு காதுகள் இருந்தால், எல்லாவற்றிலும் இசை இருக்கிறது.", "உங்கள் மனதிலேயே சக்தி இருக்கிறது, வெளிப்புற நிகழ்வுகளில் இல்லை.", "இருக்கிறவனுக்கு ஒரு வீடு, இல்லாதவனுக்குப் பல வீடு", "அரசன் எவ்வழியோ அவ்வழியே மக்கள்", "இராஜாவே ஆனாலும் தாயாருக்குப் பிள்ளை தானே!", "உத்தியோகம் புருஷ லட்சணம்", "மனதின் ஆற்றலை சரியாக உணர்ந்து கொள்ளுங்கள், நீங்கள் வலிமை பெறுவீர்கள்.", "ஆத்மாவானது அதன் சிந்தனைகளின் வண்ணத்தால் ஆனது.", "விவேகம் எச்சரிக்கும் அவிவேகம் செயல்படும்.", "அதிர்ஷ்டவான் மண்ணைத் தொட்டாலும் பொன் ஆகும்", "உன் பிரச்சனைக்கு வக்கீலாகும் நீ. ஏன் அடுத்தவர்  பிரச்சனைக்கு நீதிபதி ஆகிறாய்.", "அந்தி ஈசல் அடை மழைக்கு அறிகுறி", "உங்கள் காயத்தின் உணர்வினை நிராகரியுங்கள், காயம் தானாக மறைந்துவிடும்.", "உங்கள் எண்ணங்களை பொறுத்து உங்கள் வாழ்க்கை தரம் உயரும்.", "ஒவ்வொரு நாளும் அதன் சொந்த பரிசுகளை வழங்குகிறது.", "ஒரு மனிதனின் மதிப்பு அவனது குறிக்கோள்களை விட பெரியது அல்ல.", "இளமையில் பாடுபடு, முதுமையில் செலவிடு", "நீங்கள் கடினமாகக் கருதும் விஷயங்களை பலர் சாதித்துக் கொண்டு இருக்கிறார்கள்.", "நம்பிக்கையுடன் இருக்கும்போது, ஒரு விஷயத்தை தொடங்கும் முன்னரே நீங்கள் வெற்றிபெறுகிறீர்கள்.", "அறிவுரை நல்லது என்றால் யார் சொன்னாலும் கேள்.", "உள்ளத்திலே தெம்பு இருந்தால் உலகம் ஒரு துரும்பு", "மன அடிமைத்தனத்திலிருந்து உங்களை விடுவித்துக்கொள்ளுங்கள்.", "அரசன் எவ்வழி குடிமக்கள் அவ்வழி", "ஊக்கமுடன் இருப்பவர்கள், தாங்கள் சந்திக்கும் விளைவுகளைக் கண்டு பயப்படுவதில்லை.", "முன்னேற்றமே மனிதகுலத்தை இயக்குகின்ற ஈர்ப்பு சக்தியாகும்.", "வெற்றியைப் போன்றதொரு வலிமை வேறு எதுவுமில்லை.", "கற்றவர் இருப்பிடத்தில் வசிப்பதே பாக்கியம்", "மற்றவர் குறைகளை பேசுவதற்கு முன்னாள் நம்மை நாம் சரிபார்ப்பது நல்லது.", "ஒவ்வொருவருக்குள்ளும் ஒரு புத்தன் இருக்கிறான்.", "ஊக்கமது கைவிடேல்", "மற்றவர்களுக்காக வாழும் வாழ்க்கையே, ஒரு பயனுள்ள வாழ்க்கை", "உங்கள் தவறுகளே உங்களுக்கு கற்றுத் தருகிறது..", "அடி மேல் அடி அடித்தால் அம்மியும் நகரும்", "எழுத்தாளர் என்பவர் மனித ஆன்மாவின் பொறியாளர்.", "எண்ணங்கள் துப்பாக்கிகளை விட அதிக சக்தி வாய்ந்தவை.", "நல்ல கவிஞர்கள் உருவாக்கப்படுவதில்லை. அவர்கள் பிறக்கின்றனர்.", "உங்கள் சந்தோஷத்தின் சாவி உங்களிடம் தான் உள்ளது.", "ஓர் இலக்கை அடைவது என்பது மற்றொரு இலக்கிற்கான தொடக்கப்புள்ளி ஆகும்.", "முதுமை எண்ணுகிறது இளமை துணிகிறது", "அருமைச் சிநேகிதனை ஆபத்தில் அறியலாம்", "அறிவியல் முன்னேற்றம் என்பது கற்பனையில் இருந்து தான் பிறக்கிறது.", "பல் இல்லாத கிழவனும் சிறு குழந்தை தான்", "அடக்கம் ஆயிரம் பொன் தரும்", "ஏழையின் சிரிப்பில் கூட இறைவனைக் காணலாம்.", "என்னைப் பொறுத்தவரை நம்பிக்கை என்பது கவலைப்படாமல் இருப்பது.", "நன்றாக வரையறுக்கப்பட்ட ஒரு பிரச்சினை பாதி முடிக்கப்பட்டதற்கு சமம்.", "தனிநபர்கள் தங்கள் கல்வியை தொடர உதவுவதே கல்வியின் இலக்கு.", "ஆச்சரியமே அனைத்து விஞ்ஞானங்களுக்கும் தாய்.", "மற்றவர்களின் எதிர்மறையிலிருந்து உங்களது உற்சாகத்தை பாதுகாத்துக் கொள்ளுங்கள்.", "நாளைய பொழுதிற்கான சிறந்த தயாரிப்பானது உங்களது சிறந்த செயலை இன்று செய்வதே.", "அன்பான பழைய நண்பர்கள் மிக அதிக மதிப்புமிக்கவர்கள்.", "யானை இருந்தாலும் ஆயிரம் பொன், இறந்தாலும் ஆயிரம் பொன்", "ஆன்றோர் வாக்கு பொய்க்காது", "ஊருடன் கூடி வாழ்", "சிரிக்காத நாட்கள் நீங்கள் வாழாத நாட்கள்.", "பதவிக்கான தகுதியை வளர்த்துக் கொண்டாலே பதவி தேடி வந்து விடும்.", "நமக்கான எல்லா வாய்ப்புகளும் நம்மைச் சுற்றியே உள்ளன.", "முதுமை பக்குவத்தின் அடையாளம்", "எண் சாண் உடம்புக்கு சிரசே பிரதானம்", "எண்ணித் துணிக கருமம்", "ஞானி தாமரை போல உள்ளான். உலகத்துடன் ஒட்டுவதில்லை.", "உங்களை நீங்கள் மதியுங்கள். அப்போது தான் பிறர் உங்களை மதிப்பர்.", "வெற்றியாளர்கள் கடின உழைப்பை வெற்றியாக மாற்றக்கூடியவர்கள்.", "நட்பு எப்போதும் ஒரு இனிமையான பொறுப்பே தவிர அது ஒருபோதும் வாய்ப்பு அல்ல.", "உலகத்தில் உன்னதமானது நல்ல நட்பு.", "எதையும் பெரிது படுத்தாமல் பழகி விட்டால் வாழ்க்கை இனிமை தரும்.", "சூழ்நிலைகளை அனுசரித்து செல்பவன் சிறந்த மனிதன்.", "சிங்கத்தின் வாலை விட எலியின் தலையே மேல்", "இரு எஜமானிகள் உள்ள வீடு பெருக்கப்படாமலே உள்ளது", "புத்திசாலி ஒரே ஒரு முறைதான் ஏமாற்றப்படுகிறான்.", "தோல்வியே வெற்றியின் முதல் படி.", "சிறிதளவு உள்ளவன் ஏழையல்ல.ஆசை அதிகம் உள்ளவனே ஏழை.", "ஏழைக்கு கொடுப்பவன் கடவுளுக்கு கடனாக கொடுக்கிறான்", "மனம் திறந்து ஒத்துக்கொள்வது ஆன்மாவுக்கு சிறந்தது", "ஒவ்வொரு நாளும் ஆண்டின் சிறந்த நாளென்று உங்கள் இதயத்தில் எழுதிக் கொள்ளுங்கள்.", "வேகமாக ஓடும் குதிரை விரைவாக களைத்துப் போகிறது", "நனையச் செய்த கடவுளே காயவும் வைப்பார்", "நீ கடவுளுக்கு அஞ்சினால் மனிதனை மதிக்க ஆரம்பிப்பாய்", "கடவுள் ஒரு கதவை மூடுகிறார் என்றால் 100 கதவுகளை திறப்பார்.", "ஒரு நண்பனைப் பெறுவதற்கான ஒரே வழி, ஒருவருக்கு நண்பராக மாறுவதே!", "நல்ல மனசாட்சி தான் கடவுளின் கண்", "ஒருவரது மேகத்தில் வானவில்லாக இருக்க முயற்சி செய்யுங்கள்.", "உங்களுக்கு எதையும் இலவசமாகக் கொடுப்பவர் இறைவன் ஒருவரே.", "எல்லாம் தெரியும் என்று நினைப்பவன் சுத்த முட்டாள்.", "நல்ல எண்ணங்கள் தான் உங்களை உயர்த்த வல்லது.", "ஏழைக்கு இரங்கி வேளைக்கு உதவு", "முயற்சி செய்தால் முடியாதது எதுவும் இல்லை.", "திட்டங்களில் எதுவும் இல்லை; திட்டமிடல் என்பதிலேயே எல்லாம் உள்ளது.", "அமைதி மற்றும் நேர்மை ஆகியவை ஒரு நாணயத்தின் இரண்டு பக்கங்கள்.", "வெற்றி பெறுவதற்கான சிறந்த வழி, மற்றுமொரு முறை முயற்சிப்பதே.", "1 சதவீதம் உத்வேகமும் 99 சதவீதம் வியர்வையும் சேர்ந்ததே மதிநுட்பம்.", "ஒரு செயலைச் சிறப்பாக செய்வதற்கு சிறந்த வழி, அதனை தேடிக்கண்டறிவதே.", "இறைவனுக்கு செய்வதை ஏழைகளுக்கு செய்யுங்கள். இறைவன் மகிழ்வார்.", "முட்டாள்கள் வாய்ப்புகளை தேடுகிறார்கள். புத்திசாலிகள் வாய்ப்புகளை உருவாக்குகிறார்கள்.", "நாம் நீதியை பராமரிக்கவில்லை என்றால், நீதி நம்மை பராமரிக்காது.", "உண்மையில் நான் என் பெருமையை உணராததே என்னுடைய ஒரே தவறு.", "துன்பங்களை எதிர்கொள்வதில் தான் வாழ்க்கையின் வெற்றி உள்ளது.", "பொறுமையை விட மேலான தவம் இல்லை.", "திருப்தியை விட மேலான இன்பம் இல்லை.", "கல்வியின் வேர்கள் மிகவும் கடினமானது, அதன் பழமோ இனிமையாது.", "எழுத்தறிவித்தவன் இறைவன் ஆகுறான்", "பைத்தியக்காரத்தனத்தின் கலவை இல்லாத சிறந்த மேதை எவருமில்லை", "மகிழ்ச்சியானது நம்மைப் பொருத்தே அமைகின்றது.", "ஒரு செயலின் நல்ல தொடக்கம் அதனை பாதியளவு முடித்துவிட்டதற்கு சமம்.", "மனதின் ஆற்றலே வாழ்க்கையின் சாராம்சம்.", "இரக்கத்தை விட உயர்ந்த அறம் இல்லை.", "ஒரு புத்திசாலி வாய்ப்பை அதிர்ஷ்டமாக மாற்றுகிறான்.", "கனிவான முகத்துடன் கொடுக்கப்படும் பரிசு என்பது இரட்டிப்பு அன்பளிப்பாகும்.", "உயர்ந்த நம்பிக்கைகள் சிறந்த மனிதர்களை உருவாக்குகின்றன.", "நல்ல அணுகுமுறை பெரிய மாற்றத்தை உண்டாக்கும்.", "மன்னிப்பதை விட சிறந்த ஆயுதம் இல்லை.", "அன்பு இல்லாதவன் வாழ்வில் புன்னகை இருக்காது.", "கோபம் வந்தால் 10 வரை எண்ணு. அதிக கோபம் என்றால் 100 வரை எண்ணு.", "காற்றுக்கு எதிராகவே பட்டங்கள் எழுகின்றன, காற்றுடன் சேர்ந்து எழுவதில்லை.", "நீ மன அமைதி பெற பிறரை குறை கூறாதே.", "மெதுவாகப் பேசிப் பழகு. அது உன் ரகசியங்களை பாதுகாக்கும்.", "அறிவைவிட ஆர்வமே அதிக செயல்களைச் செய்ய வல்லது.", "கடவுள் நோய் வரும் முன்னரே மருந்து அனுப்பி விடுவார்", "முயற்சி இல்லாமல் ஒருபோதும் மகிழ்ச்சி கிடைப்பதில்லை.", "தோல்வி கண்டு அழுபவனுக்கு வெற்றி சொந்தமில்லை.", "கடலுக்கு அணை போட முடியுமா?", "இலக்கு இல்லாத மனிதன், சுக்கான் இல்லாத கப்பலைப் போன்றவன்.", "சிறந்த சொல்லைவிட சிறந்த செயலே மேன்மையானது.", "சேமித்த ஒரு பைசா என்பது சம்பாதித்த ஒரு பைசாவாகிறது.", "விடாமுயற்சி என்பது அதிர்ஷ்டத்தின் தாயைப் போன்றது.", "கடல் திடலாகும்; திடலும் ஒரு நாள் கடலாகும்", "கொடுங்கள் அப்போது உங்களுக்கு இறைவன் கொடுப்பார்.", "நமக்கு எது வசதி என்பதில் எது சரி என்பதை மறந்து விடுகிறோம்.", "குழந்தையும், தெய்வமும் கொண்டாடும் இடத்தில்.", "அனுபவம், அறிவு மற்றும் ஆர்வம் ஆகிய ஒன்றுபட்ட சக்திகளின் செயல்பாடே திறமை.", "எவ்வளவு பணக்காரன் ஆனாலும் தனது கடந்த காலத்தை வாங்க இயலாது.", "மனதை அடக்கியவன் உலகை அடக்கியவன்.", "உங்கள் இதயத்தில் அன்பை வைத்துக்கொள்ளுங்கள். அன்பே சிவம்!", "கசக்கும் மருந்து தான் கடும் நோயை தீர்க்கிறது", "செய்த தவறுகளின் மூலம் பிறந்த குழந்தை தான் அனுபவம்.", "இறைவன் அன்பே வடிவானவன்.", "நல்ல சொல் பெரிய செயல்களை செய்து விடும்.", "கருணையே கடவுள்.", "கடவுளை சமூக சேவையின் மூலம் தேடுபவனே சிறந்த ஆத்திகன்.", "எதையும் தாங்கும் இதயமே சிறந்தது.", "வயது, ஒரு மனம் சார்ந்த பிரச்சனை. அதனால் அது பற்றிக் கவலை கொள்ளாதீர்கள்.", "உண்மையை உள்ளபடி அறிந்தவன் நரகத்தையும் சொர்க்கமாக்குகிறான்.", "உலகத்தை மாற்றுவதற்கு பதிலாக நீ மாறிவிடு.", "இறை தொண்டு மனித குலத்தின் சேவையில் உள்ளது.", "ஒரு விநாடி கூட, நாம் நம்மை சந்தேகிக்க அனுமதிக்க கூடாது.", "கல்விக்கு அழகு கசடற மொழிதல்", "கூலி இல்லாத வேலை கடும் தண்டனை.", "கல்லாமல் குல வித்தை பாதி வரும்", "கரைப்பார் கரைத்தால் கல் கூடக் கரைந்து விடும்", "கருவாடு விற்ற காசு நாறுமா?", "பயனற்றதை பேசாதே!", "நல்ல காரியங்களைச் செய்ய ஒருபோதும் பயப்படாதீர்கள்!", "கரி விற்ற காசு கரியாய்ப் போகாது. காசுக்கு பேதம் இல்லை", "கலங்காத உள்ளம் படைத்தவர்களே இறுதி வெற்றிக்கு உரியவர்கள்!", "தீர்வுகளில் கவனம் செலுத்துவதே முக்கியம்; பிரச்சினைகளில் அல்ல.", "நடப்பது அனைத்தும் நன்மைக்குத் தான்.", "நம்பிக்கை என்பது மனித வாழ்வின் உயிர் மூச்சாகும்.", "அன்பு அனைத்தையும் பொறுத்துக் கொள்ளும்.", "நமது வாழ்க்கையில் உள்ள அனைத்தும் அதிர்ஷ்டமானதே.", "ஜன்னலை அடைத்தால் நிச்சயம் கதவையே திறந்து விடுவார் இறைவன்", "அன்பு, எப்பொழுதும் தெய்வீகமானது தான்.", "மனிதன் எதை உறுதியாக நினைக்கிறானோ அதுவாகவே அவன் மாறிவிடுவான்.", "உங்கள் உடலை கவனமாகப் பார்த்துக்கொள்ளுங்கள், அதுவே உங்கள் வாழ்வாதாரம்.", "ஒழுக்கம் உயிரை விட மேலானது.", "கல்வி வாழ கற்றுக்கொடுக்கும்; உலகறிவே உங்களை வளமையாக்கும்", "உனக்கு நிழல் தரும் மரத்திற்கு மரியாதை கொடு.", "அழகு பொருள்களில் இல்லை அது காண்பவரின் கண்களில் உள்ளது.", "உங்கள் கௌரவம் உங்கள் நாக்கின் நுனியில் தான் உள்ளது.", "தீமை செய்து கிடைக்கும் வெற்றி நிரந்தரம் இல்லை.", "எந்த ஒரு விஷயத்தையும் யாருக்கும் கட்டாயப்படுத்த முடியாது.", "நம்பிக்கை கடவுளையும் அசைக்கும்; பயம் எதிரியையும் செயல்பட வைக்கும்.", "காதல் போரைப் போன்றது. எளிதாக ஆரம்பித்துவிடலாம்… நிறுத்துவது மிக கடினம்.", "தீமையில் இருந்து விலகி இருங்கள். நிம்மதி தானே வரும்.", "கிழிப்பது எளிது, தைப்பது தான் கடினம்", "கிணற்றுத் தண்ணீரை வெள்ளமா கொண்டு போகும்?", "கிணற்று ஆழமும் கயிறு நீளமும் பார்க்க வேண்டும்", "அடுத்தவர்களை நீங்கள் உற்சாகப்படுத்தும்போது உங்களுக்குள்ளும் உற்சாகம் ஊற்றெடுக்கின்றது.", "உற்சாகமே மனிதர்களின் நடுவே வித்தியாசத்தைக் காட்டுகின்றது.", "தோல்வியில் இருந்துகூட கற்றுக் கொள்பவன் மீண்டும் தோற்பது இல்லை.", "நிஜத்தை நிஜமாக சந்தியுங்கள்.", "மாறவேண்டிய கட்டாயம் வருவதற்கு முன்னாலேயே மாறிவிடுங்கள்", "உங்கள் நம்பிக்கையை வைத்து முழுமையாக வாழுங்கள். உலகத்தையே உங்களால் புரட்டிப்போட முடியும்.", "யோசிக்காமல் செய்யும் வேலை பெரிய செலவை கொடுத்துவிடும்", "காவடிப் பாரம் அதனை சுமக்கிறவனுக்குத் தான் தெரியும்", "ஆசையில்லாத முயற்சியால் பயனில்லை. முயற்சியில்லாத ஆசையால் பயனில்லை.", "அதிகம் பேசாதவனை உலகம் அதிகம் விரும்புகிறது.", "அதிக விஷயங்களில் ஆர்வமுடன் அன்பு செலுத்துபவர்களுக்கு வாழ்க்கை ஒரு சொர்க்கம்.", "மற்றவர்களிடம் அன்பு செலுத்துவதற்கு, நீங்கள் முதலில் உங்களை நேசிக்க வேண்டும்.", "காலத்தால் செய்த உதவி ஞாலத்தினும் பெரிது", "கால்வாயைத் தாண்டாதவன் கடலைத் தாண்டுவானா?", "முன்நோக்கி செல்லும் போது கனிவாயிரு.", "ஒருவரையும் நம்பாமல் இருப்பது இன்னும் அபாயகரமானது.", "கற்றோருக்குச் சென்ற இடமெல்லாம் சிறப்பு", "கற்றலின் ஆயினும் கேட்க", "கற்றாரைக் கற்றாரே காமுறுவர்", "கற்றது கை மண் அளவு, கல்லாதது உலகளவு", "கூடி வாழ்ந்தால் கோடி நன்மை", "கற்றலிற் கேட்டலே நன்று", "நாம் அனைவரும் ஒருவருக்கொருவர் தேவைப்படுபவர்களாக இருக்கிறோம்.", "அன்பு எப்போதும் உருவாக்குகிறது, அது ஒருபோதும் அழிப்பதில்லை.", "அன்பே வாழ்க்கை.", "நீங்கள் அன்பை தவறவிட்டால், வாழ்க்கையை தவறவிடுகிறீர்கள்.", "மகிழ்ச்சியாய் நீ வீணாக்கிய தருணங்களெல்லாம் வீணானவையல்ல.", "குல தெய்வமே ஆனாலும் அது கொடுமைக்குத் துணை போகாது", "வெறுப்பது யாராக இருந்தாலும் நேசிப்பது நீங்களாக இருங்கள்.", "உங்கள் மகள்களை கௌரவப்படுத்துங்கள். அவர்கள் மதிப்பிற்குரியவர்கள்.", "மனிதர்கள் கடமைகளை மறக்கின்றனர். உரிமைகளை நினைவில் வைத்துக் கொள்கின்றனர்.", "நீங்கள் கீழ்நோக்கி பார்த்துக் கொண்டிருந்தால் உங்களால் ஒருபோதும் வானவில்லை காணமுடியாது.", "ஆர்வம் உடையவர்கள் தான் ஆர்வத்தை தூண்ட முடியும்.", "உங்களுக்கு உங்களைத் தவிர யாரும் உதவ இயலாது.", "இந்த பொல்லாத உலகில் எதுவும் நிரந்தரம் இல்லை.", "நாம் மிக அதிகமாக யோசிக்கிறோம்; மிக குறைவாகவே உணர்கிறோம்.", "வாழ்க்கை அற்புதமானதாக இருக்க முடியும், நீங்கள் அதைப்பற்றி பயப்படவில்லை என்றால்.", "சிரிப்பு இல்லாத நாள், வீணடிக்கப்பட்ட நாள்.", "அடங்கத் தெரியாதவர்களுக்கு ஆளத் தெரியாது.", "எளிமை என்பது ஒரு சாதாரணமான விஷயம் அல்ல.", "குடி குடியைக் கெடுக்கும்", "குடிகாரன் பேச்சு பொழுது விடிந்தால் போச்சு", "புத்திசாலித்தனத்தை விட அதிகமாக நமக்கு கருணை வேண்டும்.", "தீய நண்பர்கள் அழிவின் தூதர்கள்.", "நல்ல நட்பு எப்போதுமே சமாதானத்தை தரும்.", "கொடுங்கோல் அரசு நெடுங்காலம் நில்லாது", "தோல்வி ஒருபோதும் மோசமானது அல்ல. எந்த நிலையாயினும் தைரியமே அவசியம்.", "கேட்டவற்றை எல்லாம் நம்பாதே. நம்பியதை எல்லாம் சொல்லாதே", "நீங்கள் உங்களுக்கு உண்மையாக இருந்தால், உங்களால் எல்லோருக்கும் உண்மையாக இருக்க முடியும்.", "நீங்கள் தவறுகளே செய்யவில்லை என்றால், நீங்கள் எதுவுமே செய்யவில்லை.", "கெடுப்பாரை தெய்வம் நின்று கெடுக்கும்", "பாவமே துயரத்தின் மூலம்.", "குடும்பம் மற்றும் அன்பு ஆகியவையே இந்த உலகில் மிக முக்கியமான விஷயங்கள்.", "நேற்று என்பது முடிந்துபோன ஒன்று. இன்றே நிலையானது.", "கூலியைக் குறைக்காதே வேலையை கெடுக்காதே", "சமர்த்துள்ள சேவகனுக்குப் புல்லும் கூட ஆயுதமாம்", "நீங்கள் யாருக்கும் உதவ முடியாது. சேவை தான் செய்ய முடியும்.", "சத்தியமே இறுதியில் வெல்லும்", "நீங்கள் என்ன செய்கிறீர்கள் என்பது முக்கியமல்ல, எப்படி செய்கிறீர்கள் என்பதே முக்கியம்.", "மற்றவர்களுக்கு கொடுத்து உதவுவதும் ஒருவித முதலீடே.", "சங்கு சுட்டாலும் வெண்மை தரும்", "சகுனம் நல்லதென்று விடியும் வரை திருடினானாம் திருடன்", "பெரும் செல்வம் படைத்தவர்கள் எப்போதும் மகிழ்ச்சியாக இருக்கிறார்கள் என்று கருதுவது தவறு.", "கோள் சொல்வது குடியைக் கெடுக்கும்", "கோழி கூவா விட்டால் பொழுது விடியாதா?", "கோயில் இல்லா ஊரில் குடியிருக்க வேண்டாம்", "கோபுரத்தை பொம்மையா தாங்குகிறது?", "கோபம் உள்ள இடத்தில் தான் குணம் இருக்கும்", "கொன்றால் பாவம் தின்றால் போச்சு", "தொழிலுக்காக ஒருவர் ஒருபோதும் அவரது குடும்பத்தை புறக்கணிக்கக் கூடாது.", "பிராத்தணைகளை விட மிக உயர்ந்தது பொறுமை.", "சுய புத்தி அல்லது சொல் புத்தி எது இருந்தாலும் பிழைத்துக் கொள்ளலாம்.", "கவனமுடன் செயலாற்றினால் துன்பம் இல்லை.", "சுடச் சுட பொன் சுத்தமாகும்", "சுட்ட சட்டி அறியுமா அப்பத்தின் சுவையை?", "சேமித்த பணம் சம்பாதித்த பணத்திற்கு சமம்", "வேண்டாததை வாங்காதே! பிறகு வேண்டியதை இழப்பாய்.", "உபதேசத்தை விட உதவுவது மேல்.", "சினத்தைப் பேணின் தவத்திற்கு அழகு", "சிநேகம் செய்த பின் சோதி, அது தெளிந்த பின்பு நம்பு", "சிறு துளி பெரு வெள்ளம்", "சிறு பிள்ளை வேளாண்மை ஒரு நாளும் வீடு வந்து சேராது", "சிறு தீ பெரிய நெருப்பை உண்டாக்கிவிடும். கோபமும் அப்படியே.", "சிறு துரும்பும் பல் குத்த உதவும்", "சிறுகச் சிறுகத் தின்றால் மலையையும் தின்னலாம்", "சிக்கனமே சீரான வாழ்வு", "சாது மிரண்டால் காடு கொள்ளாது", "நமது குழந்தைகளின் மனமே நம்முடைய மிகப்பெரிய தேசிய வளமாகும்.", "விட்டுக் கொடுத்தால் கெட்டுப் போவதில்லை.", "இன்றைய சாதனைகள் அனைத்தும் சாத்திய மற்றவைகளாக இருந்தவையே.", "நாளை என்பது உங்கள் கையில் தான் உள்ளது.", "மோசமான மனநிலையில் இருக்கும்போது முக்கியமான முடிவுகளை எடுக்காதே", "பொறுமையாய் காத்திருங்கள். புயல் கடக்கும், வசந்தம் வீசும்.", "தீயவர் பக்கம் சாயாதே!", "தயை இறைவனின் அருளை பெற்றுத் தரும்.", "தம்பி உடையான் படைக்கு அஞ்சான்", "பிரச்னையை தீர்க்க முடியவில்லை என்றால் அதை சமாளிக்க கற்றுக் கொள்ளுங்கள்.", "நேர்மைக்கு விதிகள் தேவையில்லை.", "தந்தை சொல் மிக்க மந்திரம் இல்லை", "தூக்கம் என்பது மிகச்சிறந்த தியானம் ஆகும்.", "தாயின் பாதத்தில் தான் சொர்க்கம் உள்ளது.", "தூக்கம் என்பது மிகச்சிறந்த தியானம் ஆகும்.", "சேர்ந்து வாழ்வதே சிறந்த வலிமை", "மகிழ்ச்சி என்பது நமக்குள் இருப்பது தான்.", "செய்வன திருந்தச் செய்", "செத்த பிணம் அருகே சாகும் பிணம் அழுகிறது", "சூதும் வாதும் வேதனை தரும்", "ஞானிக்கு இல்லை ஞாயிறும், திங்களும்", "சொல்வது எளிது, செய்வது அரிது", "சொல்லாமல் அறிபவனே அறிஞன்", "நமது வாழ்க்கையின் நோக்கம் மகிழ்ச்சியாய் இருக்க வேண்டும் என்பதே.", "பொற்காலம் என்பது நமக்கு முன்னாள் உள்ளதே தவிர பின்னால் இல்லை.", "எண்ணம் தான் நம் எதிர்காலத்தை நிர்ணயிக்கிறது.", "அன்பு அனைத்தையும் சாதிக்கும்.", "ஞானிக்கு இல்லை இன்பமும் துன்பமும்", "ஒரு தவறான சண்டையில் உண்மையான வீரம் இருக்க முடியாது.", "எது செய்து முடிக்கப்பட்டதோ, அதை ஒருபோதும் மாற்ற முடியாது.", "தாமதம் பல இழப்புகளை ஏற்படுத்த வல்லது.", "உங்கள் செயல் பாட்டை நிறுத்தி விட்டால் தோல்வியும் நிச்சயம்.", "கடவுளின் சட்டம் ஒருவருக்கும் தீங்கு புரியாது", "சங்கு சுட்டாலும் வெண்மை தரும்"};

    public static String getThagavalTitleString(int i) {
        switch (i) {
            case 1:
                return "இந்தியாவின் மேக்னடிக் ஹில் வியக்க வைக்கும் தகவல்";
            case 2:
                return "சென்னை நகரம் 1815 இல் பனிக்கட்டி போல மாறிய கதை தெரியுமா?";
            case 3:
                return "வாட்ஸ் அப் அறிந்தும், அறியாத வியக்க வைக்கும் தகவல்கள்";
            case 4:
                return "ஸ்மார்ட்போன் பேட்டரியை மிச்சப் படுத்தும் அறிய யோசனைகள்";
            case 5:
                return "கருங்கல்லில் தெய்வ சிலைகளை வடிப்பது ஏன்? ஒரு விளக்கம்";
            case 6:
                return "கிரீன் டீ யாருக்கு ஏற்றது? ஒரு விளக்கம்";
            case 7:
                return "பேஸ்புக் வரமா? அல்லது சாபமா? ஒரு அலசல் ரிபோர்ட்";
            case 8:
                return "அலெக்சாண்டர் கிரகாம்பெல் அறிந்தும் அறியாததும்";
            case 9:
                return "ஜேம்ஸ் வாட் வியக்கவைக்கும் சிந்தனைகள்";
            case 10:
                return "மெமரிகார்ட் நீங்கள் அறிந்தும் அறியாத அறிய தகவல்கள்";
            case 11:
                return "போக்குவரத்து விளக்குகள் வந்த சுவாரஸ்ய கதை தெரியுமா?";
            case 12:
                return "ஒரு சர்வாதிகாரியின் வியக்க வைக்கும் மறு பக்கம்";
            case 13:
                return "ரயில் இஞ்சினில் உள்ள எழுத்துக்கள் சொல்வது என்ன? அறிய தகவல்";
            case 14:
                return "வெறும் வயிற்றில் தவிர்க்க வேண்டிய உணவுப் பொருட்கள்";
            case 15:
                return "உலகம் காணாத அதிசயங்களைக் கொண்ட தமிழக கோயில்கள்";
            case 16:
                return "சாவிலும் ஒற்றுமை கண்ட அந்த இரு ஜனாதிபதிகள்";
            case 17:
                return "படிக்கும் பட்டங்களை கூட விலைக்கு தந்த நாடு - சுவையான தகவல்";
            case 18:
                return "ஜே. அரிகோ – பிரேசில் நாட்டின் படிக்காத மேதை - சுவையான தகவல்";
            case 19:
                return "ரகசியமாய் தன் ரகசியத்தை 72 ஆண்டுகள் காத்த ரகசியப் பெண்";
            case 20:
                return "வைரம் பற்றி நீங்கள் அறிந்தும் அறியாததும்";
            case 21:
                return "கோகினூர் வைரம் அதிர்ஷ்டம் இல்லாத வைரமா? அறிய தகவல்";
            case 22:
                return "ஆர்தர் ஃபெர்குசன் – உலக அயோக்கியர்களின் தாத்தா - சுவையான தகவல்";
            case 23:
                return "ஆடம்பர மாளிகையும் பேராசை அரசனும் - சுவாரஸ்ய உண்மைகள்";
            case 24:
                return "மூடநம்பிக்கை வைத்த பரிட்சை - வரலாற்றில் இப்படியும் ஒரு சம்பவமா?";
            case 25:
                return "பெட்ரோல் பிறந்த சுவாரஸ்ய கதை தெரியுமா?";
            case 26:
                return "ஆழ்கடலில் ஒளியை உமிழும் அதிசய மீன்கள்- அறிய தகவல்கள்";
            case 27:
                return "ஐந்தறிவு ஜீவன்கள் பயன்படுத்தும் கருவிகள் ஒரு அறிவியல் உண்மை";
            case 28:
                return "டால்பின் என்னும் கடல் குழந்தையின் வினோதங்கள் - ஆச்சர்ய தகவல்";
            case 29:
                return "பொழுது போக்கிற்கு 30 கோடி ரூபாயா? வரலாற்றில் இப்படியும் ஒரு மூதாட்டி";
            case 30:
                return "“கார்மரான்ட்” என்னும் சுய நலம் அறியாத பறவை. வினோத கட்டுரை";
            case 31:
                return "சதாம் உசைனின் வியக்க வைக்கும் இறுதி நிமிடங்கள்";
            case 32:
                return "சின்னச் சின்ன உயிரினம் திகட்டாத செய்திகள்";
            case 33:
                return "7 என்ற எண்ணின் சிறப்புகள் சிலிர்க்க வைக்கும் உண்மைகள்";
            case 34:
                return "ஏழ்மையால் வரலாற்றில் மறைந்த உண்மை";
            case 35:
                return "அறிந்தும் அறியாத தகவல்களை கொண்ட அறிய தொகுப்புகள்";
            case 36:
                return "தகவல் துணுக்குகள்";
            case 37:
                return "விஞ்ஞானம் கண்டு பிடித்த தற்கால நரகம். உறைய வைக்கும் திகில் மர்மம்";
            case 38:
                return "பெண் ஆசையால் வீழ்த்தப்பட்ட விஜயநகரம் - ஒரு மண் பேசும் வரலாறு";
            case 39:
                return "நாஸ்டர்டாமஸ் சொன்னதெல்லாம் நடக்கிறதா? வியக்க வைக்கும் உண்மைகள்";
            case 40:
                return "அறிந்துகொள்வோம். அறியாததை";
            case 41:
                return "ஆழ் கடலில் சாத்தானின் முக்கோணம் உறைய வைக்கும் தகவல்கள்";
            case 42:
                return "குரு தேக்பகதூர் ஒரு வரலாற்றுப் பதிவு";
            case 43:
                return "பழந்தமிழ் விஞ்ஞானிகள் கண்டறிந்த சூரிய ஒளிக் கடிகாரம். ஆச்சர்ய தகவல்கள்";
            case 44:
                return "தமிழக சரித்திரத்தில் ஒரு வீர மங்கை";
            case 45:
                return "கழுகு ஒரு பார்வை - கழுகுப் பார்வை ஆச்சர்ய தகவல்";
            case 46:
                return "விலங்குகளில் நீர் அருந்தாத விலங்கு ஒரு விந்தை செய்தி";
            case 47:
                return "பாலைவனக் கப்பல்கள் - அறிய தகவல்கள்";
            case 48:
                return "பூனை பற்றிய அறிவியல் விந்தைகள்";
            case 49:
                return "தமிழகம் இழந்த திருப்பதி - வரலாற்றுத் தகவல்";
            case 50:
                return "மேயர் பதவி உருவான முதல் நாடு";
            case 51:
                return "உயிரினங்கள் வாழத் தகுதி இல்லாத கடல் - விந்தை செய்திகள்";
            case 52:
                return "உடல் அசௌக்கியத்தை போக்கும் பச்சை தங்கம் ஒரு அறிய தகவல்";
            case 53:
                return "பிரம்மபுத்திரா நதி! நீங்கள் அறிந்தும் அறியாததும்";
            case 54:
                return "வியக்க வைக்கும் அறிய தகவல்கள் 45";
            case 55:
                return "சிக்கல் இல்லாத சிலந்தி வாழ்க்கை ஒரு சுவாரஸ்ய தகவல்";
            case 56:
                return "சொந்த மகனையே பழி வாங்கிய கொடூர ராணி - ஒரு வரலாற்றுப் பதிவு";
            case 57:
                return "நாத்திகனுக்கு ராமகிருஷ்ண பரமஹம்சர் சொல்லிய பதில் - ஒரு ஆன்மீக சிந்தனை";
            case 58:
                return "இராமேஸ்வரம் ஒரு சிறப்புக் கட்டுரை";
            case 59:
                return "விக்கிரக ஆராதனையில் அடங்கி உள்ள மிகப் பெரும் தத்துவம்";
            case 60:
                return "திருமால் பற்றிய அறிய தகவல்கள்";
            case 61:
                return "கலியுகம் பற்றி புராணங்களில் சொல்லப்பட்ட வியக்க வைக்கும் தகவல்கள்";
            case 62:
                return "சிவம் சொல்லும் தத்துவம் அறிய தகவல்கள்";
            case 63:
                return "உலக இயக்கமும் நடராஜர் தத்துவமும் அறிய தகவல்கள்";
            case 64:
                return "தமிழும் முருகப் பெருமானும் சம்மந்தத்தை விளக்கும் ஒரு ஒப்பாய்வுக் கட்டுரை";
            case 65:
                return "திருமால் கூறிய அற்புதத் தீர்ப்பு. புராணங்களின் பக்கங்களில் இருந்து அறிய தகவல்";
            case 66:
                return "அபிஷேகமும் அறிய பலன்களும் ஒரு அற்புதத் தொகுப்பு";
            case 67:
                return "பூணூல் கூறும் அறிய தத்துவ விளக்கங்கள் ஒரு அற்புதப் பார்வை";
            case 68:
                return "தருப்பை என்னும் திருப்புல் பற்றிய ஆச்சர்யத் தகவல்கள்";
            case 69:
                return "சுகங்கள் என்பது ஒரு மாயையா? சத்தியத்தை விளக்கும் தத்துவக் கட்டுரை";
            case 70:
                return "சாஸ்திரப் படி பெண்கள் செய்யக் கூடாதவைகள்";
            case 71:
                return "சூரியனும் தமிழ் மாதங்களும் ஒரு ஒப்பாய்வுக் கட்டுரை";
            case 72:
                return "நதியில் கிடைக்கும் தெய்வ அடையாளங்கள் - ஒரு சிறப்புக் கட்டுரை";
            case 73:
                return "சபரி மலை யாத்திரையின் தத்துவம் – நீங்கள் அறிந்தும் அறியாததும்";
            case 74:
                return "இந்து மதத்தில் விளையாட்டால் வந்த புராணங்களும், இதிகாசங்களும் ஒரு ஆன்மீகப் பார்வை";
            case 75:
                return "தர்ம நூல்களின் அடிப்படையில் ஏழு  தினங்களில் செய்யத்தக்கவை";
            case 76:
                return "இந்து மதம் கூறும்  பஞ்ச கவ்யத்தின்சிறப்பு";
            case 77:
                return "இந்து மதத்தில் தீபங்கள் - ஒரு ஆன்மீகக் கட்டுரை";
            case 78:
                return "இந்து மதம் கூறும் வலம்புரிச்  சங்கின் பெருமை";
            case 79:
                return "இந்து மதத்தில் தெய்வங்களுக்கு உகந்தவைகள்";
            case 80:
                return "ருத்ராட்சம் வந்த கதை தெரியுமா? - ஒரு ஆன்மீக உண்மை";
            case 81:
                return "ருத்ராட்சம் தரும் மனக் கட்டுப்பாடுச் சக்தி..! - ஒரு ஆன்மீக உண்மை";
            case 82:
                return "இந்து மதம் கூறும் வஸ்திர தானத்தின் சிறப்புக்கள்";
            case 83:
                return "இந்து மதம் சொல்லும் பூஜைகளின் வழி முறைகள்";
            case 84:
                return "சாஸ்திரம் கூறுகிறது இப்படிப்பட்ட செல்வங்களைத் திருடர்கள் அபகரிப்பார்கள்";
            case 85:
                return "இந்து மதத்தில் தீபங்களும், பலன்களும் ஒரு சிறப்புப் பார்வை";
            case 86:
                return "இந்து மதத்தில் தீபங்களும் அதன் தத்துவார்த்த உண்மைகளும்";
            case 87:
                return "புத்தர் செய்த விநாயக பூஜை ஓரு அறிய தகவல்";
            case 88:
                return "மும்மூர்த்திகளின் அருள் பெற உதவும் அற்புதத் தலம் - ஒரு ஆன்மீக சிந்தனை";
            case 89:
                return "கோயில் திருக்குளங்கள் பலவிதம் அதில் ஒருவிதம்";
            case 90:
                return "திருநீற்றின் அருமை பெருமைகள் ஒரு சிறப்புப் பார்வை";
            case 91:
                return "திருநீறு எனப்படும் மறைமுக மந்திர மருந்து";
            case 92:
                return "ஆஞ்சநேயருக்கு வெண்ணெய் சாற்றுவதன் காரணம் ஏன்? - ஒரு ஆன்மீக சிந்தனை";
            case 93:
                return "ஆஞ்சநேயருக்கு செந்தூரம் சாற்றுவதன் காரணம் ஏன்? - ஒரு ஆன்மீக சிந்தனை";
            case 94:
                return "சிவபெருமான் சீதா தேவிக்கு அளித்த விலைமதிப்பற்ற  உயர்ந்த பரிசு! ஆச்சர்யத் தகவல்";
            case 95:
                return "கூனியின் சூழ்ச்சிக்கு என்ன காரணம்?";
            case 96:
                return "ஸ்ரீ இராமனின் பெருமையை உணர்த்த ஒரு அற்புத வரலாறு - ஒரு ஆன்மீக சிந்தனை";
            case 97:
                return "ஸ்ரீ ராமரின் ஒழுக்கத்திற்கு ஒரு சான்று - ஒரு ஆன்மீக சிந்தனை";
            case 98:
                return "வெளிநாட்டு வாழ் மக்கள் மதிக்கும் இராமாயணம் - ஒரு ஆச்சர்ய தகவல்";
            case 99:
                return "இராமபிரானிடம் வசிஷ்டர்  கூறிய அறிவுரைகள்";
            case 100:
                return "இராமாயணம் சொல்கிறது தேனும், மீனும் அன்பின் அடையாளங்கள். அது எப்படி? படியுங்கள்";
            case 101:
                return "மகாபாரதத்தில் சூடான கேள்விகளும் சுவை மிகுந்த பதில்களும்";
            case 102:
                return "மஹாபாரத கதை சுருக்கமாக...";
            case 103:
                return "கர்ணன் ஏன் இடது கையால் தானம் தந்தான் !!!";
            case 104:
                return "கர்ணன் தான வீரன் என்று பெயர் பெறக் காரணம்";
            case 105:
                return "மஹாபாரத கிளைக் கதை..!- ஒரு ஆச்சர்ய தகவல்";
            case 106:
                return "பாரம்பர்ய மொழிகளுள் தமிழ் மொழி - ஒரு விளக்கக் கட்டுரை";
            case 107:
                return "வண்டுகளில் ஒரு வித்யாசமான உயிரினம் - ஒரு ஆச்சர்ய தகவல்";
            case 108:
                return "இப்படியும் ஒரு இறை நம்பிக்கை";
            case 109:
                return "புராணங்கள் கூறும் பிள்ளையாரின் பெருமை";
            case 110:
                return "விநாயகரும் வியாச பாரதமும் - ஒரு ஆன்மீக சிந்தனை";
            case 111:
                return "விவேகானந்தரின் எண்ணத்தை மாற்றிய சூர்தாஸின் கவிதை";
            case 112:
                return "பிள்ளையார் சுழியை ஏன் முதலில் போடுகிறோம்? - ஒரு ஆன்மீக சிந்தனை";
            case 113:
                return "ஆதிசங்கரருக்கு ஞானம் புகட்டிய ஈசன்";
            case 114:
                return "மகாபாரதத்தில் கிருஷ்ணன் ஏன் அப்படிச் செய்யவில்லை..?! - ஒரு ஆன்மீக சிந்தனை";
            case 115:
                return "இந்து மதத்தில் ஜபம் ஒரு பார்வை  - ஒரு ஆன்மீக சிந்தனை";
            case 116:
                return "தஞ்சை பெரிய கோவிலும் சோழ மண்டலமும் - ஒரு ஆச்சர்ய தகவல்";
            case 117:
                return "உலகின் பெரிய கோயில் நம் திருச்சி ஸ்ரீ ரங்கம்! - ஒரு வரலாற்று உண்மை";
            case 118:
                return "பொருள் செறிந்த ஈமச் சடங்குகள்";
            case 119:
                return "இந்து மதத்தில் காகத்திற்கு உணவிடுவது ஏன்? - ஒரு ஆன்மீக சிந்தனை";
            case 120:
                return "இந்து மதத்தில் ஆன்மிகமும் அறிவியலும்.... - ஒரு ஆன்மீக சிந்தனை";
            case 121:
                return "கோயில்கள் மலைகளில் அமைக்கப்படுவது ஏன்? - சுவாரஸ்ய தகவல்கள்";
            case 122:
                return "72 வருடங்கள் தூங்காத ஜேக்ஸ் – இப்படியும் ஒரு மனிதரா?";
            case 123:
                return "சாப்பிடும் முன்பு இலையை சுற்றிலும் தண்ணீர் தெளிப்பது ஏன்..? - ஒரு ஆன்மீக சிந்தனை";
            case 124:
                return "நெற்றியில் குங்குமம் வைப்பது ஏன்?";
            case 125:
                return "நாய்கள் பற்றிய விந்தை செய்திகள் - சிலிர்க்க வைக்கும் தகவல்கள்";
            case 126:
                return "நெருப்பு வடிவான ஈசன் நீரில் நனையும் சுவாரசியம் – திகட்டாத ஒரு செய்தித் துணுக்கு";
            case 127:
                return "திருமணத் தடையை விலக்கும் அற்புதத் திருத்தலம் - ஒரு ஆன்மீகக் கட்டுரை";
            case 128:
                return "கதை கதையாம் காரணமாம் - ஆன்மிகம் கூறும் சிந்தனை கதை";
            case 129:
                return "பஞ்ச பூதக் கோயில்கள்- தமிழகத்தின் சிறப்புக்களுள் ஒன்று";
            case 130:
                return "கை கூப்பி வணங்க காரணம் என்ன? - சுவாரஸ்ய தகவல்";
            case 131:
                return "அனுபவத்திற்கு புலன்கள் தேவை இல்லை – விளக்கும் கதை. இது ஒரு விளக்கக் கதை";
            case 132:
                return "கோயில்களும் சிறப்புக்களும் ஒரு அற்புதத் தொகுப்பு";
            case 133:
                return "பிரம்மிக்க வைக்கும் திருப்பதி அதிசியங்கள்! ஒரு பார்வை";
            case 134:
                return "கோயிலுக்கு ஏன் போகணும்?";
            case 135:
                return "மதுரையும், மீனாட்சி அம்மன் கோயிலும் காலத்தை வென்ற வரலாற்று சிறப்புகள்";
            case 136:
                return "நவபாஷாணம் விளக்கமும் தத்துவமும்  - ஒரு ஆன்மீகக் கட்டுரை";
            case 137:
                return "புத்துக்கு பால் ஊற்றுவதில் ஆதித் தமிழன் கண்ட அறிவியல் உண்மை. மெய்சிலிர்க்கும் செய்தி";
            case 138:
                return "திருவிளக்கு பூஜை செய்யும் விதம் ஒரு பார்வை";
            case 139:
                return "திருப்பத்தில் நம் கலாம் ஒரு பார்வை தொகுப்பு - அன்று நடந்த சுவாரஸ்ய நிகழ்ச்சி";
            case 140:
                return "அமேசான் அதிரவைக்கும் செய்திகள் - சுவாரஸ்ய தகவல்";
            case 141:
                return "அப்துல் கலாம் பற்றி 50 தகவல்கள்";
            case 142:
                return "இந்து மதத்தைப் பெருமை படுத்திய கலாம் - சுவாரஸ்ய தகவல்";
            case 143:
                return "ஸ்ரீ கர்ப்பரட்சாம்பிகை கோவில் சுவாரஸ்ய தகவல்கள்";
            case 144:
                return "கலாம் ஏன் திருமணம் செய்து கொள்ளவில்லை? - சுவாரஸ்ய தகவல்";
            case 145:
                return "கலாம் - அவமானங்களை வெகுமானங்களாக மாற்றி அமைத்த ஒப்பற்ற மனிதர் - சுவாரஸ்ய தகவல்";
            case 146:
                return "தமிழனின் சாதனை பட்டியல்கள் சில - சுவாரஸ்ய தகவல்";
            case 147:
                return "அப்துல் கலாமின் ஒரே வருத்தம்";
            case 148:
                return "பாம்பு –அறிந்தும் அறியாததும்";
            case 149:
                return "இல்லாமையால் சிறப்புற்ற நாடுகள் ஒரு ஆச்சர்ய தகவல்";
            case 150:
                return "மரணத்தை வென்ற ஆங்கில மார்க்கண்டேயன்";
            case 151:
                return "அண்டமும், பிண்டமும் அனைத்தும் ஒன்று தான் – ஒரு விளக்கக் கட்டுரை";
            case 152:
                return "உலக வரலாற்றிலேயே முதல் தற்கொலைப் படை வீராங்கனை! - தமிழகம் கண்ட தவப் புதல்வி";
            case 153:
                return "புரோட்டா வந்த கதை தெரியுமா?";
            case 154:
                return "சித்தர்களின் சமாதி நிலை என்றால் என்ன?";
            case 155:
                return "இந்தியா 1498 -1947 சில குறிப்புகள்";
            case 156:
                return "நவக்கிரகங்கள் அருளாசி புரியும் தலங்கள்";
            case 157:
                return "தேவர் சுதந்திர தினத்தை கொண்டாட மறுத்தது ஏன்? – ஒரு விளக்கக் கட்டுரை";
            case 158:
                return "திருப்புல்லாணியின் சிறப்பு - ஒரு ஆன்மீகக் கட்டுரை";
            case 159:
                return "திருச்செந்தூரில் வழிபாடு செய்யும் முறை - ஒரு ஆன்மீகக் கட்டுரை";
            case 160:
                return "ஒன்பதின் சிறப்பு தெரியுமா? – ஒரு விளக்கக் கட்டுரை";
            case 161:
                return "காமராஜர் – கர்ம வீரர் என்று போற்றப்பட காரணம் தெரியுமா? - ஒரு சுவாரஸ்ய தகவல்";
            case 162:
                return "சவ் சவ்வின் மருத்துவ குணங்கள் - ஒரு சிறப்புக் கட்டுரை";
            case 163:
                return "சின்ன விஷயங்கள்! சிறந்த வாழ்க்கை!!";
            case 164:
                return "நேதாஜி புகழ் பாடிய முசோலினி -  ஒரு ஆச்சர்ய தகவல்";
            case 165:
                return "தமிழனின் சாதனை பட்டியல்கள்";
            case 166:
                return "அறிந்தும், அறியாத  தமிழ்ப் பெயர்கள் சில";
            case 167:
                return "சுடுகாட்டில் சிவன் ஏன்..!";
            case 168:
                return "சிவம் சிவம் சிவம்";
            case 169:
                return "அப்பர் பெருமானின் பக்தி";
            case 170:
                return "அரிச்சந்திர உண்மை";
            case 171:
                return "வாழ்ந்து காட்டுவோம்";
            case 172:
                return "அஞ்சனை மகாதேவர்  அதிசய தகவல்";
            case 173:
                return "சிவனின் அட்ட வீரத் தலங்கள்";
            case 174:
                return "மங்கையின் மானம் காத்த இறைவன்";
            case 175:
                return "சிவனுக்கு அபிஷேகம் செய்வதால் ஏற்படும் பலன்கள்";
            case 176:
                return "மனிதப்பிறவி ஓர் அரிய பிறவி";
            case 177:
                return "கடவுளை நம்பினோர் கைவிடப்படார் !";
            case 178:
                return "மஞ்சள்";
            case 179:
                return "கணவன், மனைவிக்காக ஒரு குட்டிக் கதை";
            case 180:
                return "மூளை வேலை செய்யாமல் இருக்க காரணங்கள்";
            case 181:
                return "உங்க பிறந்தநாள் என்னன்னு சொல்லுங்க, உங்கள பத்தி நாங்க சொல்றோம்!! –";
            case 182:
                return "சித்தர் ஜீவ சமாதியும் பிரச்சனை தீர வழிபிறப்பும்";
            case 183:
                return "இருபத்தி ஏழு நட்சத்திரங்களும் அதற்குரிய சித்தர்களும்";
            case 184:
                return "நட்சத்திரங்களுக்கு உண்டான சித்தர் மூல மந்திரங்கள் :";
            case 185:
                return "தேவி மகாலட்சுமியின் அருளைப் பெற எளிய வழிகள்";
            case 186:
                return "கந்தர் சஷ்டி கவசம் படித்தால் கிடைக்கும் நன்மை என்ன?";
            case 187:
                return "ஏடிஎம்ல் பணம் எடுக்கும்போது, கள்ள நோட்டு வந்துவிட்டால் என்ன செய்வது?";
            case 188:
                return "ஜப்பான் ஒரு பீலிக்ஸ் பறவை";
            case 189:
                return "இந்திய ரூபாய் நோட்டுக்களின் பின் பக்கத்தில் உள்ள படங்களின் அர்த்தம் தெரியுமா உங்களுக்கு?";
            case 190:
                return "வேதியியல் உங்களுக்காக";
            case 191:
                return "மின்சாரம் எப்படி உருவாகிறது – ஒரு அறிவியல் தகவல்";
            case 192:
                return "எரிமலைகள் – வியக்க வைக்கும் தகவல்கள்";
            case 193:
                return "ஊரும் பெயரும்";
            case 194:
                return "உங்களைப் பற்றிச் சொல்லும் உங்கள் கையெழுத்து";
            case 195:
                return "மண் பேசும் மருது பாண்டியர் சரித்திரம்";
            case 196:
                return "முருகப்பெருமானை பற்றிய ருசிகர தகவல்கள்";
            case 197:
                return "கொண்டாடப் படாத விழாக்கள்";
            case 198:
                return "புராணங்கள் சொல்லும் விஷயங்கள்!";
            case 199:
                return "பஞ்ச பூதமும் ஈசனின் திருத்தலங்களும் – ஒரு பார்வை";
            case 200:
                return "துன்பம் போக்கும் சனி பகவானின் வரலாறு";
//            case HttpStatus.SC_CREATED /*201*/:
//                return "பக்தியின் பரிணாமங்கள்";
//            case HttpStatus.SC_ACCEPTED /*202*/:
//                return "விஷ்ணுவின் அவதாரங்களும் – பரிணாம வளர்ச்சியும்";
//            case HttpStatus.SC_NON_AUTHORITATIVE_INFORMATION /*203*/:
//                return "அவரவர் கோணங்கள் (ஒரு சுவாரஸ்ய கதை)";
//            case HttpStatus.SC_NO_CONTENT /*204*/:
//                return "முனிவர் வேண்டாத வரம் (ஒரு ஆன்மீகக் கதை)";
//            case HttpStatus.SC_RESET_CONTENT /*205*/:
//                return "இந்துக்கள் அறிய வேண்டிய விஷயங்கள்";
//            case HttpStatus.SC_PARTIAL_CONTENT /*206*/:
//                return "ஸ்ரீ சரபேஸ்வரர் -  ஈசனின் அதி சக்தி வாய்ந்த அவதாரம்";
//            case HttpStatus.SC_MULTI_STATUS /*207*/:
//                return "முக்தி தரும் பிரதோஷ காலம் – ஒரு பார்வை";
            case 208:
                return "வீட்டில் பூஜை செய்யும் போது தெரிந்து கொள்ள வேண்டியவைகள் -";
            case 209:
                return "கார்த்திகை மாத சிறப்புகள்";
            case 210:
                return "தமிழ் மாதம் பன்னிரண்டிலும் செய்ய வேண்டிய தானங்கள்";
            case 211:
                return "கீதையும் 18 அத்தியாயங்களும்:";
            case 212:
                return "சாம்பிராணி அல்லது தூபம் தரும் பலன்கள்";
            case 213:
                return "இந்து மத ஆகமங்கள் ஒரு பார்வை";
            case 214:
                return "இந்தியாவின் தலை எழுத்தை மாற்றிய அந்த வருடங்கள்";
            case 215:
                return "காயத்திரி மந்திரத்தின் மகிமை";
            case 216:
                return "ஜப்பானில் அடுத்த ஒலிம்பிக் போட்டி நடக்குமா?";
            case 217:
                return "அகத்தியரும், தேரையரும் ஒரு பார்வை";
            case 218:
                return "இந்து தர்மத்தில் அறிய வேண்டியவை";
            case 219:
                return "பிரம்ம முகூர்த்தத்தின் மகத்துவம்";
            case 220:
                return "கும்பாபிஷேகம் பற்றிய அரிய செய்திகள்";
            case 221:
                return "காப்பி குடிப்பதை தவிர்ப்பது நல்லது ஏன்?";
            case 222:
                return "ஒரு இந்து அறிந்தும் அறியாததும்";
            case 223:
                return "இருபத்தி ஏழு நட்சத்திரங்களுக்கும் உரிய காயத்திரி மந்திரங்கள்";
            case 224:
                return "சப்த கன்னியர் - காயத்ரி மந்திரங்கள் , தியான சுலோகங்கள்";
            case 225:
                return "பஞ்ச அங்கங்கள் தரும் நன்மைகள்";
            case 226:
                return "கோவில் அதிசயங்கள்!";
            case 227:
                return "பழநி மலை முருகன் அதிசய தகவல்கள்";
            case 228:
                return "கோவிலில் செய்யக் கூடாதவை";
            case 229:
                return "நலங்கள் பல தரும் துளசி விரத வழிபாடு";
            case 230:
                return "தெய்வங்களுக்கு வாழைப்பழம் படைப்பது ஏன்?";
            case 231:
                return "பால் கொடுக்கும் கரப்பான் பூச்சிகள் – கதை அல்ல உண்மை";
            case 232:
                return "நமக்காகத் தம்மை தியாகம் செய்தவர்கள் …!";
            case 233:
                return "இப்படித் தான் வாழ்கின்றீர்களா? – ஒரு டெஸ்ட்";
            case 234:
                return "விநாயகர் சதுர்த்தி வரலாறு!";
            case 235:
                return "உணவு ஒரு நாட்டின் சொத்து – அதனை வீண் அடிக்காதீர்கள்";
            case 236:
                return "கண்ணதாசன் ஒரு அறிமுகம்";
            case 237:
                return "நவராத்திரி கொலு படிகள் கூறும் தத்துவம்";
            case 238:
                return "சுற்றுச்சூழலை நாசமாக்கும் நரகாசுரர்கள்";
            case 239:
                return "மனித எக்ஸ்ரே – இப்படியும் ஒரு சக்தியா?";
            case 240:
                return "அழிந்து போன ஒரு ஏரியின் அழுகை";
            case 241:
                return "அடால்ப் ஹிட்லர் பற்றிய சில சுவாரஸ்ய தகவல்கள்";
            case 242:
                return "தேவரைப் பார்த்து பயந்த ஆங்கிலேயர்கள்";
            case 243:
                return "முகலாய சாம்ராஜ்யத்தின் கடைசி அரசர் - ஒரு பார்வை";
            case 244:
                return "அறிந்தும் அறியாத அற்புதத் தகவல்கள்";
            case 245:
                return "இந்தியா கேட்' நினைவுச் சின்னம் - ஒரு அறிய தகவல்";
            case 246:
                return "இந்திரா காந்தி ஒரு பார்வை";
            case 247:
                return "கலாமிடம் ஒரு மாணவி கேட்ட கேள்வி!";
            case 248:
                return "ரத்த குழாய் அடைப்பு நீங்க..";
            case 249:
                return "இந்தியாவின் இராணுவ பலம் - தெரியுமா உங்களுக்கு...!";
//            case Callback.DEFAULT_SWIPE_ANIMATION_DURATION /*250*/:
//                return "வெள்ளியங்கிரி மலை – ஒரு உன்னத பார்வை";
            case 251:
                return "இஸ்ரேல் உலகத்திற்கு ஒரு முன் உதாரணம்";
            case 252:
                return "இன்றைய சிந்தனை";
            case 253:
                return "வாழ்வியல் சிந்தனை";
            case 254:
                return "இது வரை சொல்லாத கதை!";
            case 255:
                return "குடி குடியைக் கெடுக்கும்";
            case 256:
                return "சிரிக்க ரசிக்க...";
            case InputDeviceCompat.SOURCE_KEYBOARD /*257*/:
                return "சூப்பர் நகைச்சுவை மேடை – கொஞ்சம் சிரித்து டென்ஷன் மரங்க பாஸ்";
            case 258:
                return "எது நிஜமான வெற்றி?";
            case 259:
                return "சுரண்டல் (ஒரு சிறு கதை)";
            case 260:
                return "இயற்கையும் விவசாயியும்";
            case 261:
                return "படித்ததில் பிடித்தது...";
            case 262:
                return "உறவுகள் மேம்பட A to Z";
            case 263:
                return "சாமர்த்தியம்";
            case 264:
                return "நதியின் நடுவில் சகஸ்ர லிங்கங்கள்!";
            case 265:
                return "சிவம்!";
            case 266:
                return "ரமணாஸ்ரமத்தை நோக்கி ஒரு பயணம்";
            case 267:
                return "உலகம் சில நல்ல மனிதர்களை கொண்டுள்ளது. உங்களுக்கு ஒரு குட்டிகதை.";
            case 268:
                return "தெரிந்ததும்... தெரியாததும்...";
            case 269:
                return "முயற்சியுடையார் இகழ்ச்சியடையார்";
            case 270:
                return "மூச்சும், பேச்சும்";
            case 271:
                return "பகவத் கீதை – யார் எல்லை அற்ற மகிழ்ச்சி அடைகிறான்?";
            case 272:
                return "இந்துக்களின் சம்பிரதாயங்களும், காரணங்களும்";
            case 273:
                return "வேகமும் விவேகமும் – ஒரு குட்டிக் கதை";
            case 274:
                return "வாழைப் பழத் தோல் கூடப் பயன்படும் - ஒரு சிறு குறிப்பு";
            case 275:
                return "மின் கட்டணம் கணக்கிடும் முறை நாம் தெரிந்து கொள்ளவேண்டிய ஓன்று!!";
            case 276:
                return "டென்ஷனை தவிர்ப்போம். இதுவே நம் சிந்தனையாக இருக்கட்டும்";
            case 277:
                return "மனைவி அமைவதெல்லாம்";
            case 278:
                return "தேவை அற்ற போட்டிகள் உங்களை திசை திருப்பிவிடும்!";
            case 279:
                return "ஏகே 47 ஐ நான் ஏன் கண்டுபிடித்தேன்?";
            case 280:
                return "பூகம்பம் – ஒரு ஆய்வுக் கட்டுரை";
            case 281:
                return "வாழ்க்கையை வாழ்ந்து காட்டுவோம்!";
            case 282:
                return "லட்சுமி சாகல் – மறக்கமுடியுமா வீரப் பெண்மணியின் வரலாறு!";
            case 283:
                return "பலவீனமே பலம்";
            case 284:
                return "இன்றைய சிரிப்பு விருந்து";
            case 285:
                return "முயற்சி திருவினை ஆக்கும் – ஒரு உழைப்பாளியின் அற்புதக் கதை";
            case 286:
                return "நீங்கள் வாழப் பிறந்தவர்கள்";
            case 287:
                return "உலகில் மகிழ்ச்சி தரக்கூடியது எது?";
            case 288:
                return "இப்படியும் உங்களுக்கு ஒரு ஆபத்து காத்திருக்கிறது – ஒரு எச்சரிக்கை பதிவு";
            case 289:
                return "ஐஸ் தண்ணீர் குடிப்பதால் உடலில் ஏற்படும் பாதிப்புகள்";
            case 290:
                return "மூட்டைப்பூச்சியை வெளியேற்றுவது எப்படி?";
            case 291:
                return "நீங்கள் கோடீஸ்வரராகும் ஏழு வழிகள்!";
            case 292:
                return "சமையலை சார்ந்த சில தகவல்கள்";
            case 293:
                return "எதுவும் நடக்கும் - படித்ததில் சுவைத்த சிந்தனைக் கதை";
            case 294:
                return "கடவுள் நல்லதையே செய்வார்!";
            case 295:
                return "மகிழ்ச்சியாக இருப்போம் (இன்றைய தினத்தில் இருந்தாவது)";
            case 296:
                return "கார் Head Rest ன் அவசியம்";
            case 297:
                return "இப்படியும் சில முதலாளிகள்!";
            case 298:
                return "வெற்றிக்கு வழி! - ஒரு மகாபாரதக் கதை";
            case 299:
                return "வர்மம் - இன்றைய தமிழர்கள் தொலைத்த பொக்கிஷங்களுள் ஒன்று !!";
//            case HttpStatus.SC_MULTIPLE_CHOICES /*300*/:
//                return "ராமாயணம் படித்த பலன் கிடைக்கும் ஸ்லோகம்";
//            case HttpStatus.SC_MOVED_PERMANENTLY /*301*/:
//                return "சங்கடங்களை போக்க சம்மணமிடுங்கள்…";
//            case HttpStatus.SC_MOVED_TEMPORARILY /*302*/:
//                return "நோபல் பரிசை வென்ற முதல் தமிழர்";
//            case HttpStatus.SC_SEE_OTHER /*303*/:
//                return "திருதராஷ்டிரர் ஏன் தனது பிள்ளைகளை இழந்தார் – கண்ணன் தந்த விளக்கம்";
//            case HttpStatus.SC_NOT_MODIFIED /*304*/:
//                return "அடால்ஃப் ஹிட்லர் (1889-1945) - வரலாறு";
//            case HttpStatus.SC_USE_PROXY /*305*/:
//                return "அழகான இளம்பெண்ணுக்கு முகேஷ்_அம்பானி சொன்ன பதில்!";
//            case 306:
//                return "இருபத்தி ஏழு நட்சத்திரக்காரர்கள் வழிபட வேண்டிய சிவரூபங்கள்!";
//            case HttpStatus.SC_TEMPORARY_REDIRECT /*307*/:
//                return "அறிந்தும் அறியாத ஆன்மீகச் சிந்தனைகள் சில";
            case 308:
                return "சிவன்மலை – ஒரு ஆன்மீகத் தகவல்";
            case 309:
                return "தேவையற்ற சடங்குகள் தேவைதானா?";
            case 310:
                return "தவறாகப்புரிந்துகொள்ளுதல் ஒரு விளக்கம்… படித்ததில் பிடித்தது…";
            case 311:
                return "நீங்களும் மகிழ்ச்சியாக இருக்கலாம்";
            case 312:
                return "மழைக்காலத்தில் நோய்களிடமிருந்து தப்பிக்க சில வழிமுறைகள்";
            case 313:
                return "காரில் ஏறியதும் AC போடாதீர்கள் ஏன்?";
            case 314:
                return "அமைதி";
            case 315:
                return "தேவரின் ஆன்மீகச் சிந்தனை – உங்களுக்காக ஒரு பார்வை";
            case 316:
                return "நம்மைக் கொல்லாமல் கொல்லும் உயர் ரத்த அழுத்தம் - ஒரு சிறப்புப் பார்வை";
            case 317:
                return "எதுவுமே வீண் இல்லை!";
            case 318:
                return "உங்கள் குழந்தைகளை வடிவமைக்கும் சிற்பிகள்";
            case 319:
                return "காதலும், திருமணமும் – ஒரு வித்யாசம்";
            case 320:
                return "கண்ணாடி சொல்லும் மூன்று பாடங்கள்!";
            case 321:
                return "மாரடைப்பு வரும் முன் காக்க சில யோசனைகள்";
            case 322:
                return "உங்களுக்குக் கோபம் அதிகமா வருமா? முதல்ல இத படிங்க";
            case 323:
                return "மன அழுத்தத்தைப் போக்கும் வழிகள்";
            case 324:
                return "உங்கள் உணவில் காளானும் இடம்பெறட்டும்!";
            case 325:
                return "கை கழுவக் கத்துக்கோங்க!";
            case 326:
                return "அடிக்கடி தண்ணீர் குடிக்கலாமா? அப்படிக் குடித்தால்....?";
            case 327:
                return "தன் வினை தன்னைச் சுடும் – ஒரு குட்டிக் கதை";
            case 328:
                return "எதிர்கால மருத்துவத்தில் - இப்படியும் நடக்கலாம் (ஒரு அதிர்ச்சித் தகவல்)";
            case 329:
                return "சிகரெட், மது ஆகியவற்றை விட மிகவும் ஆபத்தானது சர்க்கரை (சீனி)!";
            case 330:
                return "தெரிந்துகொள்வோம் – உள்ளது உள்ளபடி";
            case 331:
                return "ஸ்ரீஅன்னையின் சிந்தனைத் துளிகள்";
            case 332:
                return "ஆரோக்கியமான குழந்தை வேண்டுமா?";
            case 333:
                return "வாழை இலையின் பயன்கள்!";
            case 334:
                return "அறுவகைச் சுவை என்ன என்ன?";
            case 335:
                return "சிறுநீர் கற்களைக் கரைக்கும் வெங்காயம்!";
            case 336:
                return "தலையை முடி கொட்டாமல் இருக்க";
            case 337:
                return "வெற்றிலையும், ரகசியங்களும்";
            case 338:
                return "தானியமாம், தானியம் – சில மருத்துவக் குறிப்புகள்";
            case 339:
                return "தழும்பை மறையவைக்கும் இயற்கை மருத்துவம்";
            case 340:
                return "எம் ஜி ஆர் அவர்களின் மன்னிக்கும் குணம்";
            case 341:
                return "இஞ்சி – ஒரு காய கல்பம்";
            case 342:
                return "மஞ்சள் மகிமை";
            case 343:
                return "மிக்ஸி உங்களுக்காக சில டிப்ஸ்!";
            case 344:
                return "ஆன்மிகத்தில் நுழைய முதல் தகுதி என்ன?";
            case 345:
                return "கர்ணனின் பூர்வ ஜென்ம இரகசியம் உங்களுக்கு தெரியுமா ?";
            case 346:
                return "யோகாசனம் ஒரு விளக்கம்";
            case 347:
                return "தீப ஆரத்தி எடுப்பது எதற்காக?";
            case 348:
                return "சிறுநீரக பிரச்சனை உள்ளவர்கள் எடுத்துக் கொள்ள வேண்டிய உணவு";
            case 349:
                return "மகாவீரர் – சில குறிப்புகள்";
            case 350:
                return "சாபங்கள் பலவிதம் – ஒவ்வொன்றும் ஒரு விதம்";
            case 351:
                return "ஆரோக்கியமாக வாழ சில வழிகாட்டுதல்கள்";
            case 352:
                return "இந்தியனாக இருக்க ஏன் பெருமை கொள்ள வேண்டும்?";
            case 353:
                return "அன்றைய கலிங்கமும் இன்றைய ஓடிசாவும் ஒரு பார்வை";
            case 354:
                return "கட்டிடக்கலையின் அதிசயம்! சிதம்பர ரகசியம்!!";
            case 355:
                return "பெருமாளின் திருவருள்";
            case 356:
                return "மின்சாரம் – கவனத்தில் கொள்ள வேண்டிய பாதுகாப்பு விஷயங்கள்";
            case 357:
                return "நீங்கள் எந்த மூடில் இருந்தாலும் உங்களை சிரிக்க வைக்கும் கதை!";
            case 358:
                return "வீட்டுக்கு 16 துளசிச் செடியை வளர்ப்போம் – ஏன்?";
            case 359:
                return "பண்டைய  தமிழர்களின் ஞானம்";
            case 360:
                return "யாரையும் குறைவாக எண்ணாதீர்கள்!!!";
            case 361:
                return "இந்தியப் பொருளாதாரம் – எங்கே முடியும்?";
            case 362:
                return "காய்கறிகள் மற்றும் பழங்களின் மருத்துவ குணங்கள்";
            case 363:
                return "எந்த நோய் தீர எந்தெந்தக் கடவுளை வணங்க வேண்டும் – ஒரு சிறு குறிப்பு";
            case 364:
                return "இந்து மதத்தின் பெருமை";
            case 365:
                return "இரண்டாயிரம் ரூபாய் நோட்டில் ஏன் மங்கல்யான்?";
            default:
                return null;
        }
    }

    /* JADX WARNING: Missing block: B:21:?, code:
            return 27;
     */
    /* JADX WARNING: Missing block: B:22:?, code:
            return 4;
     */
    /* JADX WARNING: Missing block: B:23:?, code:
            return 23;
     */
    /* JADX WARNING: Missing block: B:24:?, code:
            return 6;
     */
    /* Code decompiled incorrectly, please refer to instructions dump. */
    public static int getVasthuDay(int i, int i2) {
        if (i2 == 2018) {
            switch (i) {
                case 0:
                    return 25;
                case 2:
                    break;
                case 3:
                    break;
                case 5:
                    break;
                case 6:
                    break;
                case 7:
                    return 22;
                case 9:
                    break;
                case 10:
                    return 24;
            }
        }
        if (i2 == 2019) {
            switch (i) {
                case 0:
                    return 26;
                case 2:
                    break;
                case 3:
                case 7:
                    break;
                case 5:
                    break;
                case 6:
                    break;
                case 9:
                    break;
                case 10:
                    return 24;
            }
        }
        return 1;
//        return 28;
    }

    public static String getVasthuDayTimings(int i, int i2) {
        if (i2 == 2018) {
            switch (i) {
                case 0:
                    return "10.46.A.M முதல் 11.22.A.M வரை";
                case 2:
                    return "10.32.A.M முதல் 11.08.A.M வரை";
                case 3:
                    return "8.50.A.M முதல் 9.26.A.M வரை";
                case 5:
                    return "9.51.A.M முதல் 10.27.A.M வரை";
                case 6:
                    return "7.39.A.M முதல் 8.15.A.M வரை";
                case 7:
                    return "3.19.A.M முதல் 3.55.A.M வரை";
                case 9:
                    return "7.47.A.M முதல் 8.23.A.M வரை";
                case 10:
                    return "11.09.A.M முதல் 11.45.A.M வரை";
                default:
                    return null;
            }
        } else if (i2 != 2019) {
            return null;
        } else {
            switch (i) {
                case 0:
                    return "10.41.A.M முதல் 11.17.A.M வரை";
                case 2:
                    return "10.32.A.M முதல் 11.08.A.M வரை";
                case 3:
                    return "8.54.A.M முதல் 9.30.A.M வரை";
                case 5:
                    return "9.58.A.M முதல் 10.34.A.M வரை";
                case 6:
                    return "7.44.A.M முதல் 8.20.A.M வரை";
                case 7:
                    return "7.23.A.M முதல் 7.59.A.M வரை";
                case 9:
                    return "7.44.A.M முதல் 8.20.A.M வரை";
                case 10:
                    return "11.29.A.M முதல் 12.05.P.M வரை";
                default:
                    return null;
            }
        }
    }

    public static List<String> getDayHistoryDetails(int i, int i2) {
        List<String> arrayList = new ArrayList();
        switch (i) {
            case 0:
                switch (i2) {
                    case 1:
                        arrayList.add("கிமு 45 - யூலியன் நாட்காட்டி முதற்தடவையாக நடைமுறைப்படுத்தப்பட்டது. - ");
                        arrayList.add("630 - முகமது நபி தனது படைகளுடன் மெக்கா நோக்கிப் பயணமானார். - ");
                        arrayList.add("1906 - பிரித்தானிய இந்தியாவில் இந்திய சீர்தர நேரம் அதிகாரபூர்வமாக ஏற்றுக்கொள்ளப்பட்டது. - ");
                        arrayList.add("1999 - யூரோ நாணயம் அறிமுகம். - ");
                        arrayList.add("2008 - கொழும்பில் ஐதேக நாடாளுமன்ற உறுப்பினர் [[இலங்கை நாடாளுமன்ற உறுப்பினர் தியாகராஜா மகேஸ்வரன் சுட்டுக் கொலை செய்யப்பட்டார். - ");
                        break;
                    case 2:
                        arrayList.add("366 - அலமானி எனப்படும் ஜேர்மனிய ஆதிகுடிகள் ரைன் ஆற்றைக் கடந்து ரோமை முற்றுகையிட்டனர்.");
                        arrayList.add("1492 - ஸ்பெயினில் முஸ்லிம்களின் ஆளுகைக்குட்பட்ட கடைசி நகரமான கிரனாடா சரணடைந்தது.");
                        arrayList.add("1921 - ஸ்பெயினின் சாண்டா இசபெல் கப்பல் மூழ்கியதில் 244 பேர் கொல்லப்பட்டனர்.");
                        arrayList.add("1993 - யாழ்ப்பாணக் கடல் நீரேரிப் படுகொலை: கிளாலி நீரேரியில் 35-100 பயணிகள் இலங்கைப் படையினரால் படுகொலை செய்யப்பட்டனர்.");
                        arrayList.add("1999 - விஸ்கொன்சின் மாநிலத்தில் இடம்பெற்ற பலத்த பனிப்புயலில் சிக்கி 68 பேர் கொல்லப்பட்டனர்.");
                        break;
                    case 3:
                        arrayList.add("1431 - பிரெஞ்சு வீராங்கனை 19 வயது ஜோன் ஒஃப் ஆர்க் கைது செய்யப்பட்டு பியேர் கவுச்சோன் ஆயரிடம் ஒப்படைக்கப்பட்டார். - ");
                        arrayList.add("1496 - லியொனார்டோ டா வின்சி தனது பறக்கும் இயந்திரம் ஒன்றை சோதனையிட்டது வெற்றியளிக்கவில்லை. - ");
                        arrayList.add("1888 - 91 சமீ முறிவுத் தொலைநோக்கி முதன்முறையாக கலிபோர்னியாவில் உபயோகிக்கப்பட்டது. இதுவே அந்நேரத்தில் உலகின் மிகப் பெரும் தொலைநோக்கி ஆகும். - ");
                        arrayList.add("1961 - அமெரிக்க அரசு கியூபாவுடனான ராஜதந்திர உறவுகளை முறித்துக்கொண்டது. - ");
                        arrayList.add("1961 - இடாகோவில் அணுக்கரு உலை ஒன்றில் ஏற்பட்ட கசிவின் காரணமாக மூன்று தொழிலாளர்கள் கொல்லப்பட்டனர். - ");
                        break;
                    case 4:
                        arrayList.add("கிமு 46 - டைட்டஸ் லபீனஸ் ருஸ்பீனா என்ற நகரில் இடம்பெற்ற சமரில் ஜூலியஸ் சீசரைத் தோற்கடித்தார். - ");
                        arrayList.add("1493 - கொலம்பஸ் தான் கண்டுபிடித்த புதிய உலகை விட்டுப் புறப்பட்டார். - ");
                        arrayList.add("1884 - ஃபாபியன் அமைப்பு லண்டனில் ஆரம்பிக்கப்பட்டது.");
                        arrayList.add("1998 - அல்ஜீரியாவில் மூன்று வெவ்வேறு நிகழ்வுகளில் 170 பொதுமக்கள் படுகொலை செய்யப்பட்டனர்.");
                        arrayList.add("2004 - ஸ்பிரிட் என்ற நாசாவின் தரையுளவி செவ்வாயில் தரையிறங்கியது.");
                        break;
                    case 5:
                        arrayList.add("1477 - பேர்கண்டி இளவரசன் சார்ல்ஸ் கொல்லப்பட்டான். பேர்கண்டி பிரான்சின் பகுதியானது.");
                        arrayList.add("1554 - நெதர்லாந்தில் ஐன்ட்ஹோவென் என்ற இடத்தில் பரவிய தீயினால் 75 விழுக்காடு வீடுகள் சேதமாயின.");
                        arrayList.add("1945 - போலந்தின் புதிய சோவியத் சார்பு அரசை சோவியத் ஒன்றியம் அங்கீகரித்தது.");
                        arrayList.add("2005 - ஐக்கிய அமெரிக்காவின் கலிபோர்னியாவைச் சேர்ந்த மைக்கல் பிரவுண் தலைமையிலான வானியல் ஆராய்ச்சிக் குழுவினர் சூரியக் குடும்பத்தில் ஏரிஸ் என்ற புதிய குறுங்");
                        arrayList.add("2007 - கொழும்பிலிருந்து 36 கிமீ தொலைவில் நித்தம்புவ என்ற இடத்தில் இடம்பெற்ற பேருந்துக் குண்டுவடிப்பில் 6 பொதுமக்கள் கொல்லப்பட்டு 50 பேர் வரை காயமும் அடைந்தனர்.");
                        break;
                    case 6:
                        arrayList.add("1066 - இங்கிலாந்தின் மன்னனாக ஹாரல்ட் கோட்வின்சன் முடிசூடிக் கொண்டான்.");
                        arrayList.add("1412 - பிரெஞ்சு வீராங்கனை ஜோன்  ஆப்  ஆர்க்  பிறந்த தினம்");
                        arrayList.add("1928 - தேம்ஸ் ஆறு லண்டனில் பெருக்கெடுத்ததில் 14 பேர் கொல்லப்பட்டனர்.");
                        arrayList.add("2007 - இந்தியாவில் அஸ்ஸாம் மாநிலத்தில் பிற மாநிலத்தவரைக் குறிவைத்து உல்ஃபா தீவிரவாதிகள் நடத்திய தாக்குதலில் 55 பேர் கொல்லப்பட்டனர்.");
                        arrayList.add("2007 - இலங்கை, காலி மாவட்டம் மீட்டியகொட சீனிகம பகுதியில் இடம்பெற்ற பேருந்துக் குண்டுவெடிப்பில் 15 பொதுமக்கள் வரையில் கொல்லப்பட்டும் 40 பேர் வரை படுகாயமும் அடைந்தனர்.");
                        break;
                    case 7:
                        arrayList.add("325 - போர்த்துக்கல் மன்னனாக நான்காம் அல்ஃபொன்சோ முடிசூடினான்.");
                        arrayList.add("1536 - எட்டாம் ஹென்றி மன்னரின் முதல் மனைவி இறந்த தினம் இன்று");
                        arrayList.add("1789 - ஐக்கிய அமெரிக்காவில் முதற்தடவையாக அரசுத் தலைவர் தேர்தல் இடம்பெற்றது.");
                        arrayList.add("1941 - சுதந்திரப் போராட்ட காலத்தில் ஆங்கிலேயர்களால்  சிறையில் அடைக்கப்பட்ட சுபாஷ் சந்திர போஸ் மாறுவேடத்தில் தப்பிச் சென்ற தினம் இன்று");
                        arrayList.add("1989 - ஜிம்மு டென்னோவின் பரம்பரையைச் சேர்ந்த அகி ஹிட்டோ , 125 ஆவது அரசராக ஜப்பானில் பதவி ஏற்ற தினம் இன்று.");
                        break;
                    case 8:
                        arrayList.add("1297 - மொனாக்கோ விடுதலை பெற்றது.");
                        arrayList.add("1782 - திருகோணமலை கோட்டையை பிரித்தானியர் கைப்பற்றினர்.");
                        arrayList.add("1912 - ஆப்பிரிக்க தேசிய காங்கிரஸ் அமைக்கப்பட்டது.");
                        arrayList.add("1996 - சயீரில் அண்டோனொவ் விமானம் ஒன்று வீழ்ந்ததில் 350 பேர் கொல்லப்பட்டனர்.");
                        arrayList.add("2008 - கொழும்பு புறநகர்ப் பகுதியான ஜா-எலையில் இடம்பெற்ற கிளைமோர் தாக்குதலில் நாடாளுமன்ற உறுப்பினரும் அமைச்சருமான டி.எம்.தசநாயக்க உட்பட மூவர் கொல்லப்பட்டனர்.");
                        break;
                    case 9:
                        arrayList.add("475 - பைசண்டைன் பேரரசன் சீனோ அவனது தலைநகரான கொன்ஸ்டண்டீனப்போல் நகரை விட்டுக் கட்டாயமாக வெளியேற்றப்பட்டான்.");
                        arrayList.add("1431 - ஜோன் ஒஃப் ஆர்க் மீதான முன் விசாரணைகள் ஆங்கிலேயர்களைப் பெரும்பான்மையாகக் கொண்ட நீதிமன்றத்தில் ஆரம்பமானது.");
                        arrayList.add("1905 - ரஷ்யத் தொழிலாளர் சென் பீட்டர்ஸ்பேர்க்கில் குளிர்கால அரண்மனையை முற்றுகையிட்டனர். சார் மன்னரின் படைகள் பலரைச் சுட்டுக் கொன்றனர் (ஜூலியன் நாட்காட்டியின் படி). இந்நிகழ்வே 1905 ரஷ்யப் புரட்சி ஆரம்பமாவதற்கு வழிகோலியது.");
                        arrayList.add("2001 - சீனாவின் ஷென்சூ 2 விண்கலம் ஏவப்பட்டது.");
                        arrayList.add("2005 - சூடான் அரசுக்கும் சூடான் மக்கள் விடுதலை இயக்கத்துக்கும் இடையில் அமைதி ஒப்பந்தம் கென்யாவில் கைச்சாத்திடப்பட்டது.");
                        break;
                    case 10:
                        arrayList.add("9 - மேற்கத்தைய ஆன் அரசமரபு முடிவுக்கு வந்தது.");
                        arrayList.add("236 - பேபியன் 20வது திருத்தந்தையானார்.");
                        arrayList.add("1924 - பிரித்தானியாவின் நீர்மூழ்கிக் கப்பல் எல்-34 ஆங்கிலக் கால்வாயில் மூழ்கியதில் 43 பேர் கொல்லப்பட்டனர்.");
                        arrayList.add("2001 - விக்கிப்பீடியா நியூபீடியாவின் கீழ் ஆரம்பிக்கப்பட்டது. இது 5 நாட்களின் பின்னர் தனித்தளமாக இயங்க ஆரம்பித்தது.");
                        arrayList.add("2005 - தெற்கு ஆஸ்திரேலியாவில் அயர் குடாவில் இடம்பெற்ற காட்டுத்தீயில் சிக்கி 9 பேர் இறந்தனர். 113 பேர் காயமடைந்தானர்.");
                        break;
                    case 11:
                        arrayList.add("1055 - தியோடோரா பைசண்டைன் பேரரசியாக முடி சூடினாள்.");
                        arrayList.add("1569 - முதலாவது குலுக்குச் சீட்டு இங்கிலாந்தில் பதிவாகியது.");
                        arrayList.add("1911 - காம்ரேட் என்ற பத்திரிகையை விடுதலைப் போராட்ட வீரர் மவுலானா முகம்மது அலி");
                        arrayList.add("1998 - அல்ஜீரியாவில் நூற்றுக்கும் மேற்பட்ட பொதுமக்கள் கொல்லப்பட்டனர்.");
                        arrayList.add("2007 - செயற்கைக் கோள் தகர்ப்பு ஏவுகணைச் சோதனையை சீனா நடத்தியது");
                        break;
                    case 12:
                        arrayList.add("475 - பசிலிஸ்கஸ் பைசண்டைன் பேரரசனாக முடி சூடினான்.");
                        arrayList.add("1528 - சுவீடனின் மன்னனாக முதலாம் குஸ்தாவ் முடி சூடினான்.");
                        arrayList.add("1945 - இரண்டாம் உலகப் போர்: சோவியத் ஒன்றியம் நாசிகளுக்கு எதிரான பெரும் போரை கிழக்கு ஐரோப்பாவில் ஆரம்பித்தது.");
                        arrayList.add("2006 - 25 ஆண்டுகளுக்கு முன்னர் பாப்பரசர் இரண்டாம் ஜோன் போலை சுட்டுக் காயப்படுத்திய மெஹ்மேட் அலி ஆக்கா என்பவர் துருக்கிய சிறையில் இருந்து விடுவிக்கப்பட்டார்.");
                        arrayList.add("2007 - மாக்னாட் வாள்வெள்ளி சுற்றுப்பாதை வீச்சுக்குக் கிட்டவாக வந்து 40 ஆண்டுகளில் தெரிந்த மிகவும் பிரகாசமான வால்வெள்ளியானது.");
                        break;
                    case 13:
                        arrayList.add("1610 - கலிலியோ கலிலி வியாழனின் 4வது துணைக்கோளைக் கண்டுபிடித்தார்.");
                        arrayList.add("1658 - இங்கிலாந்தின் இராணுவ மற்றும் அரசியல் தலைவருமான ஒலிவர் குரொம்வெல்லுக்கு எதிராக சதித்திட்டம் தீட்டிய எட்வார்ட் செக்ஸ்பி என்பவன் லண்டன் கோபுர சிறையில் இறந்தான்.");
                        arrayList.add("1942 - ஹென்றி போர்ட் பிளாஸ்டிக்கினால் ஆன தானுந்துக்கான காப்புரிமம் பெற்றார்.");
                        arrayList.add("2001 - எல் சல்வடோரில் இடம்பெற்ற நிலநடுக்கத்தில் 800 பேர் கொல்லப்பட்டனர்.");
                        arrayList.add("2006 சீனாவின் தென் கிழக்குப் பகுதியில் இடம்பெற்ற நிலநடுக்கத்தினால் 13,000 வீடுகள் இடிந்து தரை மாட்டமாயின.");
                        break;
                    case 14:
                        arrayList.add("1539 - ஸ்பெயின் கியூபாவை இணைத்துக் கொண்டது.");
                        arrayList.add("1690 - கிளாரினெட் இசைக்கருவி ஜெர்மனியில் வடிவமைக்கப்பட்டது.");
                        arrayList.add("1913 - கிரேக்கம் துருக்கியரை பிசானி என்ற இடத்தில் இடம்பெற்ற சமரில் வென்றனர்.");
                        arrayList.add("1998 - ஆப்கானிஸ்தானின் சரக்கு விமானம் ஒன்று பாகிஸ்தானில் மலை ஒன்றில் மோதியதில் 50 பேர் கொல்லப்பட்டனர்.");
                        arrayList.add("2005 - சனிக் கோளின் டைட்டான் என்ற நிலாவில் ஐரோப்பாவின் இயூஜென் விண்கலம் இறங்கியது.");
                        break;
                    case 15:
                        arrayList.add("69 - ரோமின் ஆட்சியை ஓத்தோ கைப்பற்றித் தன்னை மன்னனாக அறிவித்தான். எனினும் மூன்று மாதங்களில் அவன் தற்கொலை செய்து கொண்டான்.");
                        arrayList.add("1559 - முதலாம் எலிசபெத் இங்கிலாந்தின் அரசியாக முடி சூடினாள்.");
                        arrayList.add("1908 - யாழ்ப்பாணத்துக்கும் காரைநகருக்கும் இடையில் பயணிகள் படகுச் சேவை (ferry) ஆரம்பிக்கப்பட்டது.");
                        arrayList.add("1944 - ஆர்ஜெண்டீனாவில் சான் ஜுவான் நகரில் இடம்பெற்ற நிலநடுக்கத்தில் 10,000 பேர் வரையில் கொல்லப்பட்டனர்.");
                        arrayList.add("1966 - நைஜீரியாவில் இடம்பெற்ற இராணுவப் புரட்சியில் அபூபக்கர் டஃபாவா பாலேவா என்பவாரின் ஆட்சி கவிழ்க்கப்பட்டது.");
                        break;
                    case 16:
                        arrayList.add("547 - நான்காம் இவான் ரஷ்யாவின் சார் மன்னனாக முடிசூடினான்.");
                        arrayList.add("1556 - இரண்டாம் பிலிப்பு ஸ்பெயின் மன்னன் ஆனான்.");
                        arrayList.add("1956 - எகிப்து அதிபர் கமால் அப்துல் நாசர் பாலஸ்தீனத்தைக் கைப்பற்றுவதாக சூளுரைத்தார்.");
                        arrayList.add("2008 - 2002 போர்நிறுத்த உடன்படிக்கையில் இருந்து இலங்கை அரசு அதிகாரபூர்வமாக விலகியது.");
                        arrayList.add("2008 - இலங்கைப் போர் நிறுத்தக் கண்காணிப்புக் குழு இலங்கையில் தனது பணிகள் அனைத்தையும் நிறுத்தியது.");
                        break;
                    case 17:
                        arrayList.add("1377 - பாப்பாண்டவர் பதினோராம் கிரெகரி தனது ஆட்சியை ரோமுக்கு மாற்றினார்.");
                        arrayList.add("1524 - இத்தாலிய நாடுகாண்பயணி ஜியோவன்னி டா வெரசானோ சீனாவுக்கான தனது பயணத்தை ஆரம்பித்தார்.");
                        arrayList.add("1917 - கன்னித் தீவுகளுக்காக ஐக்கிய அமெரிக்கா $25 மில்லியனை டென்மார்க்கிற்குக் கொடுத்தது.");
                        arrayList.add("1973 - பேர்டினண்ட் மார்க்கோஸ் பிலிப்பீன்சின் நிரந்தர அதிபர் ஆனார்.");
                        arrayList.add("1991 - வளைகுடாப் போர் ஆரம்பித்தது.");
                        break;
                    case 18:
                        arrayList.add("350 - ஜெனரல் மக்னென்டியஸ் ரோமப் பேரரசன் கொன்ஸ்டன்சை அகற்றி தன்னை மன்னனாக அறிவித்தான்.");
                        arrayList.add("1520 - அசுண்டே ஆற்றுக்கருகில் இடம்பெற்ற போரில் டென்மார்க் மற்றும் நோர்வேயின் இரண்டாம் கிறிஸ்டியன் சுவீடனை வென்றான்.");
                        arrayList.add("1896 - எக்ஸ்றே இயந்திரம் முதற் தடவையாகக் காட்சிப்படுத்தப்பட்டது.");
                        arrayList.add("1997 - போர்ஜ் அவுஸ்லாண்ட் என்பவர் அண்டார்க்டிக்காவை துணை எதுவுமின்றி முதன் முதலில் கடந்து சாதனை படைத்தார்.");
                        arrayList.add("2002 - சியேரா லியோனியில் உள்நாட்டுப் போர் முடிவுக்கு வந்ததாக அறிவிக்கப்பட்டது.");
                        break;
                    case 19:
                        arrayList.add("1419 – நூறாண்டுப் போர்: நார்மாண்டியை கைப்பற்றிய இங்கிலாந்தின் ஐந்தாம் ஹென்றியிற்கு ரொவ்வென் சரணடைந்தது.");
                        arrayList.add("1511 – மிரான்டோலா பிரெஞ்சிற்கு சரணடைந்தார்.");
                        arrayList.add("1927 – பிரித்தானியா சீனாவுக்கு படைகளை அனுப்பியது.");
                        arrayList.add("2006 – புளூட்டோவுக்கான முதலாவது நியூ ஹரைசன்ஸ் என்ற விண்ணுளவியை நாசா விண்ணுக்கு ஏவியது.");
                        arrayList.add("2007 – இலங்கையின் கிழக்கே மட்டக்களப்பு மாவட்டத்தில் விடுதலைப்புலிகளின் கட்டுப்பாட்டில் இருந்த வாகரையைத் தாம் கைப்பற்றிவிட்டதாக இலங்கை இராணுவம் அறிவித்தது.");
                        break;
                    case 20:
                        arrayList.add("1265 - இங்கிலாந்து நாடாளுமன்றம் தனது முதலாவது கூட்டத்தை வெஸ்ட்மின்ஸ்டர் அரண்மனையில் நடத்தியது.");
                        arrayList.add("1523 - இரண்டாம் கிறிஸ்டியான் டென்மார்க், நோர்வேயின் மன்னர் பதவியில் இருந்து அகற்றப்பட்டான்.");
                        arrayList.add("1913 - யாழ்ப்பாணம், உடுவிலில் இராமநாதன் பெண்கள் கல்லூரி ஆரம்பிக்கப்பட்டது.");
                        arrayList.add("1992 - பிரான்சில் பயணிகள் விமானம் ஒன்று வீழ்ந்து நொருங்கியதில் 85 பேர் கொல்லப்பட்டனர்.");
                        arrayList.add("2001 - பிலிப்பீன்சில் இடம்பெற்ற புரட்சியில் தலைவர் ஜோசப் எஸ்ட்ராடா பதவியகற்றப்பட்டு குளோரியா மக்கபாகல்-அறாயோ தலைவரானார்.");
                        break;
                    case 21:
                        arrayList.add("1643 - ஏபல் டாஸ்மான் தொங்காவில் இறங்கிய முதல் ஐரோப்பியர் ஆனார்.");
                        arrayList.add("1793 - பிரான்சின் பதினாறாம் லூயி மன்னன் அரசத்துரோகக் குற்றச்சாட்டுகளுக்காக மரணதண்டனைக்கு உட்படுத்தப்பட்டான்.");
                        arrayList.add("1947 - முதலாவது சிங்களத் திரைப்படம் (கடவுணு பொரன்டுவ) திரையிடப்பட்டது.");
                        arrayList.add("2008 - அலாஸ்காவின் இயாக் மொழி பேசும் கடைசி பழங்குடி இறந்தார்.");
                        arrayList.add("2009 - செம்மொழி தமிழாய்வு மத்திய நிறுவனம் அமைக்கப்பட்ட தினம்.");
                        break;
                    case 22:
                        arrayList.add("1506 - 150 சுவிஸ் பாதுகாப்புப் படைகளைக்கொண்ட முதற் தொகுதி வத்திக்கானை அடைந்தது.");
                        arrayList.add("1798 - நெதர்லாந்தில் இராணுவப் புரட்சி இடம்பெற்றது.");
                        arrayList.add("1941 - இரண்டாம் உலகப் போர்: ஐக்கிய இராச்சியம் லிபியாவின் டோப்ருக் நகரை நாசிப் படைகளிடம் இருந்து கைப்பற்றியது.");
                        arrayList.add("2003 - பயனியர் 10 விண்கலத்துடன் கடைசித் தொடர்பு மேற்கொள்ளப்பட்டது.");
                        arrayList.add("2004 - ஆர்க்குட் தொடங்கப்பட்டது.");
                        break;
                    case 23:
                        arrayList.add("1368 - சூ யுவான்ஷாங் சீனாவின் பேரரசனாக முடிசூடினான். இவனது மிங் பரம்பரை 3 நூற்றாண்டுகள் சீனாவை ஆண்டது.");
                        arrayList.add("1556 - சீனாவின் சாங்சி மாநில நிலநடுக்கத்தில் 830,000 வரையானோர் இறந்தனர். உலக வரலாற்றில் மிக அதிகமானோர் கொல்லப்பட்ட நிலநடுக்கம் இதுவாகும்.");
                        arrayList.add("1924 - விளாடிமிர் லெனின் ஜனவரி 21 இல் இறந்ததாக சோவியத் ஒன்றியம் அதிகாரபூர்வமாக அறிவித்தது.");
                        arrayList.add("2002 - அமெரிக்க ஊடகவியலாளர் டானியல் பேர்ள் கராச்சியில் கடத்தப்பட்டார். இவர் பின்னர் கொலை செய்யப்பட்டார்.");
                        arrayList.add("2005 - திருச்சி ஸ்ரீரங்கத்தில் கல்யாண மண்டபத்தில் ஏற்பட்ட தீவிபத்தில் மணமகன் உள்பட 62 பேர் கொல்லப்பட்டனர்.");
                        break;
                    case 24:
                        arrayList.add("41 - கலிகுலா படுகொலை செய்யப்பட்டான். அவனது மாமன் குளோடியஸ் முடி சூடினான்.");
                        arrayList.add("1679 - இங்கிலாந்தின் இரண்டாம் சார்ல்ஸ் நாடாளுமன்றத்தைக் கலைத்தான்.");
                        arrayList.add("1943 - இரண்டாம் உலகப் போர்: பிராங்க்ளின் ரூஸ்வெல்ட், வின்ஸ்டன் சேர்ச்சில் ஆகியோர் தமது கசபிளாங்கா உச்சி மாநாட்டை முடித்துக் கொண்டனர்.");
                        arrayList.add("2007 - சூடானிலிருந்து 103 பயணிகளுடன் சென்ற விமானம் நடு வானில் கடத்தப்பட்டது.");
                        arrayList.add("2009 - இலங்கை ஊடகவியலாளர் பிரகீத் எக்னலிகொட அரசுத்தலைவர் தேர்தலுக்கு இரண்டு நாட்களுக்கு முன்னர் கொழும்பில் காணாமல் போனார்.");
                        break;
                    case 25:
                        arrayList.add("1327 - 14 வயது மூன்றாம் எட்வர்ட் இங்கிலாந்தின் மன்னனாக முடி சூடினான்.");
                        arrayList.add("1494 - இரண்டாம் அல்பொன்சோ நேப்பில்ஸ் மன்னனாக முடிசூடினான்.");
                        arrayList.add("1955 - சோவியத் ஒன்றியம் ஜேர்மனி மீது அதிகாரபூர்வமாக போரை நிறுத்தியது.");
                        arrayList.add("2006 – சூரியக் குடும்பத்திற்கு வெளியே பால் வழியின் நடுவிற்குக் கிட்டவாக பூமியில் இருந்து 21,500 ± 3,300 ஒளியாண்டுகள் தூரத்தில் OGLE-2005-BLG-390Lb என்ற கோள் கண்டுபிடிக்கப்பட்டது.");
                        arrayList.add("2009 - முல்லைத்தீவில் ராமநாதபுரம் பகுதியில் உள்ள கல்மடு குளத்தின் அணை விடுதலைப் புலிகளால் உடைக்கப்பட்டது.");
                        break;
                    case 26:
                        arrayList.add("1340 - இங்கிலாந்து மன்னன் மூன்றாம் எட்வர்ட் பிரான்சின் மன்னனாக அறிவிக்கப்பட்டான்.");
                        arrayList.add("1500 - விசெண்ட் யானெஸ் பின்சோன் பிரேசில் நாட்டில் காலடி வைத்த முதலாவது ஐரோப்பியர் ஆனார்.");
                        arrayList.add("1942 - இரண்டாம் உலகப் போர்: ஐக்கிய அமெரிக்காவின் படையினர் முதற்தடவையாக ஐரோப்பாவை (வட அயர்லாந்து) அடைந்தனர்.");
                        arrayList.add("2001 - குஜராத் நிலநடுக்கத்தில் 20,000க்கும் அதிகமானோர் கொல்லப்பட்டனர்.");
                        arrayList.add("2006 - வெஸ்டர்ன் யூனியன் நிறுவனம் தொலைத்தந்தி மூலமான தனது சேவைகளை நிறுத்திக் கொண்டது.");
                        break;
                    case 27:
                        arrayList.add("1695 - ஓட்டோமான் பேரரசின் மன்னன் இரண்டாம் அஹமது இறந்ததை அடுத்து இரண்டாம் முஸ்தபா மன்னனானான்.");
                        arrayList.add("1880 - தாமஸ் எடிசன் வெள்ளொளிர்வு விளக்குக்கான காப்புரிமம் பெற்றார்.");
                        arrayList.add("1938 - நியூ யோர்க்கில் நயாகரா நீர்வீழ்ச்சியில் நயாகரா பாலம் உடைந்து வீழ்ந்தது.");
                        arrayList.add("1996 - நைஜரில் இடம்பெற்ற இராணுவப் புரட்சியில் நாட்டின் முதலாவது மக்களால் தெரிவு செய்யப்பட்ட அதிபர் மஹமான் ஊஸ்மன் பதவியிலிருந்து அகற்றப்பட்டு இராணுவத் தளபதி இப்ராகிம் மயினாசரா ஆட்சிப் பொறுப்பை ஏற்றார்.");
                        arrayList.add("2002 - நைஜீரியாவின் லாகோஸ் நகரில் இராணுவக் களஞ்சியமொன்றில் இடம்பெற்ற குண்டுவெடிப்புகளில் 1,000 பேருக்கு மேல் கொல்லப்பட்டனர்.");
                        break;
                    case 28:
                        arrayList.add("1547 - எட்டாம் ஹென்றியின் இறப்பு. அவனது 9 வயது மகன் ஆறாம் எட்வர்ட் இங்கிலாந்தின் மன்னன் ஆனான்.");
                        arrayList.add("1624 - கரிபியனில் முதலாவது பிரித்தானியக் குடியேற்ற நாடான சென் கிட்ஸ் சர் தொமஸ் வார்னர் என்பவரால் அமைக்கப்பட்டது.");
                        arrayList.add("1909 - ஐக்கிய அமெரிக்கப் படைகள் குவாண்டானாமோ விரிகுடாவைத் தவிர்த்து கியூபாவின் மற்றைய பகுதிகளில் இருந்து விலகினர்.");
                        arrayList.add("1987 - மட்டக்களப்பு கொக்கட்டிச்சோலை கிராமத்தில் இலங்கை இராணுவத்தினரால் 86 தமிழ் இளைஞர்கள் படுகொலை செய்யப்பட்டனர்.");
                        arrayList.add("2002 - கொலம்பியாவில் போயிங் விமானம் ஒன்று அண்டெஸ் மலையில் மோதியதில் 92 பேர் கொல்லப்பட்டனர்.");
                        break;
                    case 29:
                        arrayList.add("1595 - ஷேக்ஸ்பியரின் ரோமியோவும் ஜூலியட்டும் நாடகம் முதன் முதலாக அரங்கேறியது.");
                        arrayList.add("1676 - மூன்றாம் பியோதர் ரஷ்யாவின் மன்னனாக முடி சூடினான்.");
                        arrayList.add("1916 - முதலாம் உலகப் போர்: பாரிஸ் ஜெர்மனியரின் குண்டுத்தாக்குதலுக்கு இலக்கானது.");
                        arrayList.add("1996 - இத்தாலியில் வெனிஸ் நகரில் உள்ள ஓப்பரா மாளிகையான லா ஃபெனீஸ் தீயினால் அழிந்தது.");
                        arrayList.add("2005 - சீனாவின் பெருநிலப்பரப்பில் இருந்து 1949ம் ஆண்டிற்குப் பின்னர் முதற்தடவையாக வர்த்தக விமானம் ஒன்று தாய்வானுக்கு வந்து சேர்ந்தது.");
                        break;
                    case 30:
                        arrayList.add("1648 - எண்பதாண்டுப் போர்: நெதர்லாந்துக்கும் ஸ்பெயினுக்கும் இடையில் போர் நிறுத்த ஒப்பந்தம் உடன்பாடாகியது.");
                        arrayList.add("1649 - முதலாம் சார்ல்ஸ் மன்னன் தூக்கிலிடப்பட்டான். அவனது மனைவி ஹென்றியேட்டா மரீயா பிரான்ஸ் சென்றாள்.");
                        arrayList.add("1945 - இரண்டாம் உலகப் போர்: பால்ட்டிக் கடலில் வில்ஹெல்ம் கூஸ்ட்லொஃப் என்ற பயணிகள் கப்பல் சோவியத் நீர்மூழ்கிக் கப்பலினால் தாக்கப்பட்டதில் அதில் பயணம் செய்த 9,000 பேர் கொல்லப்பட்டனர்.");
                        arrayList.add("2003 - பெல்ஜியம் சமப்பால் திருமணத்தைச் சட்டபூர்வமாக்கியது.");
                        arrayList.add("2006 - தமிழர் புனர்வாழ்வுக் கழகப் பணியாளர்கள் ஒரு பெண் உட்பட 7 இலங்கைத் தமிழர் மட்டக்களப்பு, வெலிக்கந்தையில் கடத்தப்பட்டனர். இவர்கள் இறந்து விட்டதாகப் பின்னர் அறிவிக்கப்பட்டது.");
                        break;
                    case 31:
                        arrayList.add("1606 - இங்கிலாந்து மன்னன் முதலாம் ஜேம்சிற்கு எதிராகவும் நாடாளுமன்றத்திற்கெதிராகவும் சதி முயற்சியில் இறங்கியமைக்காக காய் ஃபோக்ஸ் என்பவன் தூக்கிலிடப்பட்டான்.");
                        arrayList.add("1747 - பால்வினை நோய்களுக்கான முதலாவது மருத்துவ நிலையம் லண்டனில் லொக் மருத்துவமனையில் நிறுவப்பட்டது.");
                        arrayList.add("1958 - ஐக்கிய அமெரிக்காவின் வெற்றிகரமான முதலாவது செய்மதி எக்ஸ்புளோரர் 1 விண்ணுக்கு ஏவப்பட்டது.");
                        arrayList.add("1996 - கொழும்பு மத்திய வங்கியின் மீது நடத்தப்பட்ட குண்டுத் தாக்குதலில் 86 பேர் கொல்லப்பட்டு 1,400 பேர் வரை படுகாயமடைந்தனர்.");
                        arrayList.add("2003 - ஆஸ்திரேலியா, நியூ சவுத் வேல்ஸ் மாநிலத்தில் வோட்டர்ஃபோல் என்ற இடத்தில் தொடருந்து ஒன்று தடம்புரண்டதில் சாரதி உட்பட 7 பேர் கொல்லப்பட்டனர்.");
                        break;
                }
                break;
            case 1:
                switch (i2) {
                    case 1:
                        arrayList.add("1788 - ஐசக் பிறிக்ஸ் மற்றும் வில்லியம் லோங்ஸ்ட்ரீட் ஆகியோர் நீராவிப்படகுக்கான காப்புரிமம் பெற்றனர்");
                        arrayList.add("1832 - ஆசியாவின் முதல் அஞ்சல் வண்டி சேவை கண்டியில் துவங்கப்பட்டது");
                        arrayList.add("1913 - உலகின் மிகப் பெரிய தொடருந்து நிலையம் நியூயார்க்கில் திறக்கப்பட்டது");
                        arrayList.add("1977 - இந்தியாவின்  முதல் இரயில்வே அருங்காட்சியகம் சாணக்கியபுரி யில்   ( புது டெல்லியில் ) திறக்கப்பட்ட தினம் இன்று");
                        arrayList.add("2003 - விண்வெளி வீராங்கனை கல்பனா சாவ்லா இறந்த தினம்");
                        break;
                    case 2:
                        arrayList.add("1880 - இந்தியாவில் முதல் முறையாக தெருக்களில் மின்சார விளக்குகள் நிறுவப்பட்டன");
                        arrayList.add("1908 - 60 ஆண்டுகளுக்கு ஒருமுறை இடம்பெறும் இந்துக்களின் சிறப்பு நாளான அருத்தோத்யம் தினம்");
                        arrayList.add("1946 - ஹங்கேரி குடியரசு அமைக்கப்பட்டது");
                        arrayList.add("1989 - ஸ்கை தொலைக்காட்சி ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1933 - ஜெர்மனி நாடாளுமன்றத்தை ஹிட்லர் கலைத்தார்");
                        break;
                    case 3:
                        arrayList.add("1690 - அமெரிக்காவின் முதல் காகித நாணயம் மசாசூசெட்ஸில் அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("1783 - அமெரிக்காவின் விடுதலையை ஸ்பெயின் அங்கீகரித்தது");
                        arrayList.add("1930 - வியட்நாம் கம்யூனிஸ்ட் கட்சி அமைக்கப்பட்டது");
                        arrayList.add("1969 - தமிழகத்தின் 6வது முதல்வர் சி.என்.அண்ணாதுரை இறந்த தினம்");
                        arrayList.add("1969 - பிரபல ஹாலிவுட்  நட்சத்திரமான நடிகர் போரிஸ்  கார் :. லாப் இறந்த தினம் இன்று");
                        break;
                    case 4:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக புற்றுநோய் தினம்");
                        arrayList.add("1948 - இலங்கை விடுதலை நாள்");
                        arrayList.add("1936 - முதல்முறையாக ரேடியம் ஈ என்ற செயற்கைக் கதிரியக்க மூலகம் உருவாக்கப்பட்டது");
                        arrayList.add("1978 - ஜெயவர்த்தனா  முதல் இலங்கை அதிபராகப் பதவி ஏற்ற தினம் இன்று");
                        arrayList.add("1859 - கிரேக்க பைபிளின் 4ம் நூற்றாண்டுக் கையெழுத்துப்படி ஒன்று எகிப்தில் கண்டுபிடிக்கப்பட்டது");
                        break;
                    case 5:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பாகிஸ்தான், காஷ்மீர் தினம்");
                        arrayList.add("1840 - டன்லப் என்ற காற்றடைத்த  டயரைக் கண்டு பிடத்த ஜான் போய்டு என்னும் ஸ்காட்லாந்து நாட்டுக் கண்டுபிடிப்பாளர் இன்று தான் பிறந்தார்");
                        arrayList.add("1960 - ரஷ்ய மக்கள் நட்புறவுப் பல்கலைக்கழகம், மாஸ்கோவில் துவங்கப்பட்டது");
                        arrayList.add("1900 - அமெரிக்கா, லண்டன் இடையே பனாமா கால்வாய் தொடர்பான உடன்பாடு எட்டப்பட்டது");
                        arrayList.add("1976 - இந்திய நடிகர் அபிஷேக் பச்சன் பிறந்த தினம்");
                        break;
                    case 6:
                        arrayList.add("1665 - இங்கிலாந்து அரசியான அண்ணி பிறந்த தினம் இன்று");
                        arrayList.add("1819 - ஸ்டாம்ஃபோர்ட் ராஃபில்ஸ் என்பவரால் சிங்கப்பூர் அமைக்கப்பட்டது");
                        arrayList.add("1931 - இந்திய அரசியல் தலைவர் மோதிலால் நேரு இறந்த தினம்");
                        arrayList.add("1827 - கர்நாடக இசை மும்மூர்த்திகளில் ஒருவரான சியாமா சாஸ்திரிகள் இறந்த தினம்");
                        arrayList.add("1983 - இந்திய கிரிக்கெட் வீரர் ஸ்ரீசாந்த் பிறந்த தினம்");
                        break;
                    case 7:
                        arrayList.add("1999 - உலகத்தமிழ் இணைய மாநாடு சென்னையில் துவங்கியது");
                        arrayList.add("1992 - ஐரோப்பிய ஒன்றியம் அமைப்பதற்கான மாஸ்ட்ரிக்ட் ஒப்பந்தம் ஏற்படுத்தப்பட்டது");
                        arrayList.add("1979 - புளூட்டோ நெப்டியூனின் சுற்றுப் பாதைக்குள் நுழைந்தது");
                        arrayList.add("1914 - சார்லி சாப்ளினின் முதல் திரைப்படமான கிட் ஆட்டோ ரேசஸ் அட் வெனிஸ் வெளியானது");
                        arrayList.add("1971 - சுவிட்சர்லாந்தில் பெண்களுக்கு வாக்குரிமை கிடைத்தது");
                        break;
                    case 8:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பரிநிர்வாண நாள்- பெளத்த வழிபாட்டு நாள்");
                        arrayList.add("1819 - ஆங்கிலேய எழுத்தாளரும் , அரசியல் கட்டுரையாளருமான ஜான் ரஸ்கின் இன்று தான் பிறந்தார்.");
                        arrayList.add("1971 - நாஸ்டாக் பங்குச்சந்தைக் குறியீடு அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("1897 - இந்தியாவின் 3வது குடியரசுத் தலைவர் ஜாகீர் உசேன் பிறந்த தினம்");
                        arrayList.add("1963 - இந்தியாவின் முன்னாள் கிரிக்கெட் வீரர் முகம்மது அசாருதீன் பிறந்த தினம்");
                        break;
                    case 9:
                        arrayList.add("1895 - வில்லியம் மோர்கன், வாளிப்பாலைக் கண்டுபிடித்தார்");
                        arrayList.add("1900 - டேவிஸ் கோப்பை டென்னிஸ் போட்டி ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1942 - அமெரிக்காவில் பகலொளி சேமிப்பு நேரம் அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("1904 - போர்ட் ஆர்தர் சமர் துவங்கப்பட்டது");
                        arrayList.add("1971 - அப்பல்‌லோ 14 விண்கலம் 3 அமெரிக்கர்களுடன் பூமிக்கு திரும்பியது");
                        break;
                    case 10:
                        arrayList.add("1931 - புதுடில்லி, இந்தியாவின் தலைநகராக்கப்பட்டது");
                        arrayList.add("1897 - மடகஸ்காரில் மத சுதந்திரம் அறிவிக்கப்பட்டது");
                        arrayList.add("1763 - பிரான்ஸ், கியூபெக் மாநிலத்தை லண்டனுக்கு அளித்தது");
                        arrayList.add("1863 - அலன்சன் கிரென், தீயணைப்பு கருவியின் காப்புரிமம் பெற்றார்");
                        arrayList.add("1870 - கிறிஸ்தவப் பெண்கள் இளையோர் அமைப்பு(ஒய்.டபிள்யூ.சி.ஏ) நியூயார்க்கில் அமைக்கப்பட்டது");
                        break;
                    case 11:
                        arrayList.add("கிமு 660 - ஜப்பான் நாடு அமைக்கப்பட்ட தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அமெரிக்க கண்டுபிடிப்பாளர் தினம்");
                        arrayList.add("1847 - அமெரிக்க கண்டுபிடிப்பாளர் தாமஸ் ஆல்வா எடிசன் பிறந்த தினம்");
                        arrayList.add("1933 - மகாத்மா காந்தி ஹரிஜன் என்ற பத்திரிகையைத் தொடங்கினார்");
                        arrayList.add("1990 - நெல்சன் மண்டேலா 27 ஆண்டுகளுக்கு பின் சிறையிலிருந்து விடுதலையானார்");
                        break;
                    case 12:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - டார்வின் தினம்");
                        arrayList.add("1809 - இயற்பியல் அறிஞர் சார்லஸ் டார்வின் பிறந்த தினம்");
                        arrayList.add("1908 - தமிழகத்தில் தமிழ் பணியாற்றிய அமெரிக்கர் ஜி.யு.போப் இறந்த தினம்");
                        arrayList.add("1502 - வாஸ்கோ ட காமா, இந்தியாவிற்கான தனது 2வது கடற் பயணத்தை லிஸ்பனில் இருந்து ஆரம்பித்தார்");
                        arrayList.add("1912 - சீனக் குடியரசில் கிரெகோரியன் நாட்காட்டி அமலுக்கு வந்தது");
                        break;
                    case 13:
                        arrayList.add("1914 - பொன்னம்பலம் அருணாசலத்திற்கு பக்கிங்ஹம் அரண்மனையில் சர் பட்டம் வழங்கப்பட்டது");
                        arrayList.add("1960 - பிரான்ஸ், தனது முதல் அணுகுண்டு சோதனையை நடத்தியது");
                        arrayList.add("1879 - இந்திய சுதந்திரப் போராட்ட வீராங்கனை சரோஜினி நாயுடு பிறந்த தினம்");
                        arrayList.add("1950 - தமிழறிஞர் செய்குத்தம்பி பாவலர் இறந்த தினம்");
                        arrayList.add("1920 - தமிழ் திரைப்பட பாடலாசிரியர் அ.மருதகாசி பிறந்த தினம்");
                        break;
                    case 14:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக காதலர் தினம்");
                        arrayList.add("1924 - ஐ.பி.எம்., நிறுவனம் அமைக்கப்பட்டது");
                        arrayList.add("1946 - எனியாக் என்ற முதல் தலைமுறைக் கணினி அறிமுகமானது");
                        arrayList.add("1961 - 103வது தனிமமான லோரென்சியம், கலிபோர்னியா பல்கலைக்கழகத்தில் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1989 - ஜி.பி.எஸ்., திட்டத்தின் 24 செய்மதிகளில் முதலாவது விண்ணில் ஏவப்பட்டது");
                        break;
                    case 15:
                        arrayList.add("1906 - பிரிட்டன் தொழிலாளர் கட்சி அமைக்கப்பட்டது");
                        arrayList.add("1946 - எனியாக் என்ற முதல் தலைமுறைக் கணினி அறிமுகமானது");
                        arrayList.add("2005 - யூடியூட் சேவை அமெரிக்காவில் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1564 - இத்தாலிய இயற்பியலாளர் கலீலியோ கலிலி பிறந்த தினம்");
                        arrayList.add("1984 - தென்னிந்திய நடிகை மீரா ஜாஸ்மின் பிறந்த தினம்");
                        break;
                    case 16:
                        arrayList.add("1918 - லித்துவேனியா விடுதலை நாள்");
                        arrayList.add("1937 - வொலஸ் கரோத்தேர்ஸ், நைலானுக்கான காப்புரிமம் பெற்றார்");
                        arrayList.add("2005 - கியோட்டோ உடன்பாடு நடைமுறைக்கு வந்தது");
                        arrayList.add("1944 - இந்திய திரைப்படத்துறையின் முன்னோடி தாதாசாஹெப் பால்கே இறந்த தினம்");
                        arrayList.add("1934 - ஆஸ்திரியாவில் உள்நாட்டுப் போர் முடிவுக்கு வந்தது");
                        break;
                    case 17:
                        arrayList.add("1867 - சூயஸ் கால்வாய் வழியாக முதல் கப்பல் போக்குவரத்து நடைபெற்றது");
                        arrayList.add("1933 - நியூஸ் வீக்கின் முதலாவது இதழ் வெளிவந்தது");
                        arrayList.add("1936 - சிறுவர்களுக்கான வரைகதையில் அதிமேதாவி மாயாவி முதல்முறையாக தோன்றினார்");
                        arrayList.add("2000 - விண்டோஸ் 2000 வெளியிடப்பட்டது");
                        arrayList.add("1984 - தென்னிந்திய திரைப்பட நடிகை சதா பிறந்த நாள்");
                        break;
                    case 18:
                        arrayList.add("1965 - காம்பியா விடுதலை நாள்");
                        arrayList.add("1836 - இந்திய ஆன்மிகவாதி ஸ்ரீ ராமகிருஷ்ணர் பிறந்த தினம்");
                        arrayList.add("1929 - ஆஸ்கார் விருது முதன்முறையாக அறிவிக்கப்பட்டது");
                        arrayList.add("1911 - இந்தியாவில் முதல் விமான அஞ்சல் சேவை அலகாபாத்தில் அதிகாரப்பூர்வமாக ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1967 - அணுகுண்டை கண்டுபிடித்த ராபர்ட் ஓப்பன்ஹெய்மர் இறந்த தினம்");
                        break;
                    case 19:
                        arrayList.add("1855 - தமிழறிஞர் உ.வே.சாமிநாத ஐயர் பிறந்த தினம்");
                        arrayList.add("1819 - பிரிட்டானியாவின் வில்லியம் ஸ்மித், தெற்கு ஷெட்லாந்து தீவுகளைக் கண்டுபிடித்தார்");
                        arrayList.add("1878 - தாமஸ் எடிசன், கிராமபோனிற்கான காப்புரிமம் பெற்றார்");
                        arrayList.add("1959 - ஐரோப்பா, சைப்பிரசுக்கு விடுதலை வழங்கியது");
                        arrayList.add("1473 - கணிதவியலாளர் நிக்கோலஸ் கோர்ப்பனிக்கஸ் பிறந்த தினம்");
                        break;
                    case 20:
                        arrayList.add("1987 - அருணாச்சலப் பிரதேசம், அசாமில் இருந்து தனி மாநிலமாக பிரிக்கப்பட்டது");
                        arrayList.add("1876 - தமிழறிஞர் கா.நமச்சிவாயம் பிறந்த தினம்");
                        arrayList.add("1873 - கலிபோர்னியா பல்கலைக்கழகத்தில் முதல் முறையாக மருத்துவப் பிரிவு துவங்கப்பட்டது");
                        arrayList.add("1835 - சிலி நாட்டின் கொன்செப்சியோன் நகரம் நிலநடுக்கத்தால் அழிந்தது");
                        arrayList.add("1962 - ஜான் கிளேன், பூமியை 3 முறை சுற்றிய முதல் அமெரிக்கர் என்ற புகழைப் பெற்றார்");
                        break;
                    case 21:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச தாய்மொழி தினம்");
                        arrayList.add("1440 - புரூசியக் கூட்டமைப்பு உருவானது");
                        arrayList.add("1937 - முதலாவது பறக்கும் தானுந்து வெற்றிகரமாகப் பறக்க விடப்பட்டது");
                        arrayList.add("1878 - இந்திய ஆன்மிகவாதி புதுச்சேரி அன்னை பிறந்த தினம்");
                        arrayList.add("1907 - தென்னிந்திய நடிகர் எம்.ஆர்.ராதா பிறந்த தினம்");
                        break;
                    case 22:
                        arrayList.add("1853 - வாஷிங்டன் பல்கலைக்கழகம், எலியட் செமினறி என்ற பெயரில் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1900 - ஹவாய், அமெரிக்காவின் ஒரு பிரிவானது");
                        arrayList.add("1958 - எகிப்து, சிரியா ஆகியவை இணைந்து ஐக்கிய அரபுக் குடியரசை அமைத்தன");
                        arrayList.add("1732 - அமெரிக்காவின் முதல் ஜனாதிபதி ஜார்ஜ் வாஷிங்டன் பிறந்த தினம்");
                        arrayList.add("1857 - சாரணர் இயக்க நிறுவனர் பேடன் பவல் பிறந்த தினம்");
                        break;
                    case 23:
                        arrayList.add("1893 - ருடொல்ஃப் டீசல், டீசல் இயந்திரத்துக்கான காப்புரிமம் பெற்றார்");
                        arrayList.add("1905 - ரோட்டரி அமைப்பு ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1941 - புளூட்டோனியம், முதல்முறையாக உருவாக்கப்பட்டது");
                        arrayList.add("1947 - ஐ.எஸ்.ஓ.,(தர நிர்ணய நிறுவனம்) ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1965 - டெல் நிறுவனத்தை ஆரம்பித்த மைக்கேல் டெல் பிறந்த தினம்");
                        break;
                    case 24:
                        arrayList.add("1918 - எஸ்தோனியா விடுதலை நாள்");
                        arrayList.add("1948 - தமிழக அரசியல்வாதி ஜெ.ஜெயலலிதா பிறந்த தினம்");
                        arrayList.add("1886 - தமிழ் தட்டச்சுப் பொறியை உருவாக்கிய ஆர்.முத்தையா பிறந்த தினம்");
                        arrayList.add("1955 - ஆப்பிள் கம்பியூட்டர் நிறுவனத்தை துவங்கியவர்களுள் ஒருவரான ஸ்டீவ் ஜொப்ஸ் பிறந்த தினம்");
                        arrayList.add("1986 - கலாஷேத்திரா நடனப் பள்ளி நிறுவனர் ருக்மணிதேவி அருண்டேல் இறந்த தினம்");
                        break;
                    case 25:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - குவைத் தேசிய நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பிலிப்பைன்ஸ் மக்கள் எழுச்சி தினம்");
                        arrayList.add("1836 - சாமுவேல் கோல்ட், சுழல் துப்பாக்கிக்கான அமெரிக்க காப்புரிமத்தை பெற்றார்");
                        arrayList.add("1988 - மாதிரி அணு ஆயுதத்தை சுமந்து சென்ற இந்தியாவின் முதல் ஏவுகணையான பிருத்வி ஏவப்பட்டது");
                        arrayList.add("1982 - தென்னிந்திய திரைப்பட நடிகர் தனுஷ் பிறந்த தினம்");
                        break;
                    case 26:
                        arrayList.add("1991 - குவைத் விடுதலை நாள்");
                        arrayList.add("1606 - வில்லெம் ஜான்சூன், ஆஸ்திரேலியாவைக் கண்ட முதல் ஐரோப்பியரானார்");
                        arrayList.add("1991 - டிம் பெர்னேர்ஸ், லீ நெக்சஸ் என்ற உலகின் முதலாவது இணைய உலாவியை அறிமுகப்படுத்தினார்");
                        arrayList.add("1991 - டிம் பெர்னேர்ஸ், லீ நெக்சஸ் என்ற உலகின் முதலாவது இணைய உலாவியை அறிமுகப்படுத்தினார்");
                        arrayList.add("1848 - இரண்டாவது பிரெஞ்சு குடியரசு அறிவிக்கப்பட்டது");
                        break;
                    case 27:
                        arrayList.add("1700 - நியூ பிரிட்டானியா தீவு கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1879 - சேக்கரீன் என்ற செயற்கை இனிப்பூட்டி கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1900 - பிரிட்டானிய தொழிற் கட்சி அமைக்கப்பட்டது");
                        arrayList.add("1940 - ரேடியோ கார்பன் என்ற கரிமம் 14 கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("2008 - எழுத்தாளர் சுஜாதா இறந்த தினம்");
                        break;
                    case 28:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - இந்தியாவின் தேசிய அறிவியல் தினம்");
                        arrayList.add("1784 - ஜான் வெஸ்லி, மெதடிஸ்த திருச்சபையை ஆரம்பித்தார்");
                        arrayList.add("1935 - வொலஸ் கரோதேர்ஸ், நைலானை கண்டுபிடித்தார்");
                        arrayList.add("1991 - முதலாம் வளைகுடாப் போர் முடிவுற்றது");
                        arrayList.add("1963 - இந்தியாவின் முதல் ஜனாதிபதி இராஜேந்திர பிரசாத்");
                        break;
                    case 29:
                        arrayList.add("1896 - முன்னாள் இந்திய பிரதமர் மொரார்ஜி தேசாய் பிறந்த தினம்");
                        arrayList.add("1940 - பின்லாந்து, குளிர்காலப் போரை முடிவுக்கு கொண்டு வர அமைதி முயற்சிகளில் இறங்கியது");
                        arrayList.add("1892 - செயின்ட் பீட்டஸ்பர்க், புளோரிடா ஆகியன இணைக்கப்பட்டன");
                        arrayList.add("1892 - செயின்ட் பீட்டஸ்பர்க், புளோரிடா ஆகியன இணைக்கப்பட்டன");
                        arrayList.add("1952 - ஹிலிகோலாந்து தீவு மீண்டும் ஜெர்மனின் கட்டுப்பாட்டுக்குள் வந்தது");
                        break;
                }
                break;
            case 2:
                switch (i2) {
                    case 1:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - தென்கொரியா விடுதலை நாள்");
                        arrayList.add("1953 - தமிழக உள்துறை அமைச்சர் ஸ்டாலின் பிறந்த தினம்");
                        arrayList.add("1975 - ஆஸ்திரேலியாவில் வண்ண தொலைக்காட்சி சேவை துவங்கப்பட்டது");
                        arrayList.add("1565 - ரியோ டி ஜெனிரோ நகரம் அமைக்கப்பட்டது");
                        arrayList.add("1837 - அமெரிக்காவின் புகழ் பெற்ற நாவலாசிரியரான வில்லியன் டீன் ஹவல்ஸ்  பிறந்தார்");
                        break;
                    case 2:
                        arrayList.add("1935 - வயலின் இசைக்கலைஞர் குன்னக்குடி வைத்தியநாதன் பிறந்த தினம்");
                        arrayList.add("1949 - இந்திய சுதந்திர போராட்ட வீராங்கனை சரோஜினி நாயுடு இறந்த தினம்");
                        arrayList.add("1930 - மகாத்மா காந்தி, உப்பு சத்தியாக்கிரகம் ஆரம்பிப்பதற்காக தண்டி நோக்கி நடைப் பயணம் துவக்கினார்");
                        arrayList.add("1931 - அமெரிக்காவின் தேசிய கீதமாக ' ஸ்டார் ஸ்பான் கில்ட் பானர்....' என்ற பாடல் ஆதிகார பூர்வமாக ஏற்றுக் கொள்ளப்பட்ட நாள் இன்று.");
                        arrayList.add("1900 - ஜெர்மன்  இசை அமைப்பாளரான  கர்ட் வெய்ல்  பிறந்தார்");
                        break;
                    case 3:
                        arrayList.add("1847 - கண்டுபிடிப்பாளர் அலெக்சாண்டர் கிரஹாம் பெல் பிறந்த தினம்");
                        arrayList.add("1839 - இந்திய தொழிலதிபர் ஜாம்ஷெட்ஜி டாடா பிறந்த தினம்");
                        arrayList.add("1971 - இந்தோ-பாகிஸ்தான் போர் துவங்கியது");
                        arrayList.add("1707 - மொகலாயப் பேரரசின் கடைசி சக்கரவர்த்தியான ஔரங்கசீப் இறந்தார் .");
                        arrayList.add("1918 - முதல் உலகப் போரில் ரஷ்யாவும்   ஜெர்மனியும்  பிரஸ்ட் லிட்வோஸ்க் என்ற உடன்படிக்கை செய்து கொண்டன");
                        break;
                    case 4:
                        arrayList.add("1877 - எமிலி பேர்லீனர், மைக்ரோபோனை கண்டுபிடித்தார்");
                        arrayList.add("1917 - ரஷ்யாவில் பிப்ரவரி புரட்சி வெற்றி பெற்றது");
                        arrayList.add("2006 - அசாம் மாநிலம், அசோம் என மாற்றப்பட்டது");
                        arrayList.add("1193 - புகழ் பெற்ற எகிப்திய சுல்தான் அலாவுதீன் இறந்த தினம் இன்று");
                        arrayList.add("1395 - உலகில் முதன் முதலாகக் கடலில் கப்பல் ஓட்டும் பயிற்சிப் பள்ளியைத் தொடங்கியவரும் ,  போர்சுகளின் முதலாம் ஜான்  மன்னரின் மூன்றாவது மகனுமான இளவரசர் ஹென்றி பிறந்தார் . இவர் மிகச் சிறந்த மாலுமியும் ஆவார்.");
                        break;
                    case 5:
                        arrayList.add("1943 - ஐரோப்பாவில் முதல் விமான சேவை துவங்கப்பட்டது");
                        arrayList.add("1949 - இந்தியாவில் ஜார்க்கண்ட் கட்சி துவங்கப்பட்டது");
                        arrayList.add("1836 - சாமுவேல் கோல்ட், நவீன துப்பாக்கியை தயாரித்தார்");
                        arrayList.add("1953 - ரஷ்யாவின் சர்வாதிகாரியான ஜோசப் ஸ்டாலின் மாரடைப்பினால் இன்று  மரணம் அடைந்தார்.");
                        arrayList.add("1778 - புகழ்பெற்ற பாடல் ஆசிரியரான தாமஸ் அகஸ்டைன் ஆர்னி இறந்தார்.");
                        break;
                    case 6:
                        arrayList.add("1957 - கானா விடுதலை நாள்");
                        arrayList.add("1869 - ரஷ்ய வேதியியல் அறிஞர் டிமிட்ரி மென்டலீவ், முதல் வகைப்பாட்டு பட்டியலை சமர்ப்பித்தார்");
                        arrayList.add("1921 - போர்ச்சுக்கீசிய கம்யூனிஸ்ட் கட்சி துவங்கப்பட்டது");
                        arrayList.add("1899 - பேயர், ஆஸ்பிரினை வர்த்தக பொருளாக பதிவு செய்தார்");
                        arrayList.add("1885 - அமெரிக்க நகைச்சுவை மன்னரான ரிங்லார்ட்னர் பிறந்தார்");
                        break;
                    case 7:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அல்பேனியா ஆசிரியர் தினம்");
                        arrayList.add("1876 - அலெக்சாண்டர் கிரகாம் பெல், தொலைப்பேசிக்கான காப்புரிமம் பெற்றார்");
                        arrayList.add("1798 - ரோமன் குடியரசு அமைக்கப்பட்டது");
                        arrayList.add("1876 - தொலைபேசியைக் கண்டுபிடித்ததற்க்கான உரிமையை அலெக்சாண்டர் கிரஹாம் பெல் அதிகார பூர்வமாகப்  பெற்ற தினம் இன்று .");
                        arrayList.add("1832 - தஞ்சையை ஆண்ட சரபோஜி மகராஜா இறந்த தினம் இன்று . இவர் தான் சரஸ்வதி மஹாலை நிறுவினார்.");
                        break;
                    case 8:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச மகளிர் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அல்பேனியா மற்றும் ரோமானியா அன்னையர் தினம்");
                        arrayList.add("1817 - நியூயார்க், பங்குச் சந்தை நிறுவன மையமாக்கப்பட்டது");
                        arrayList.add("1911 - சர்வதேச மகளிர் தினம் முதன்முதலில் டென்மார்க்கில் கொண்டாடப்பட்டது");
                        arrayList.add("1618 - ஜொஹன்னஸ் கெப்லர், கோள்களின் இயக்கங்களுக்கான 3வது விதியை கண்டுபிடித்தார்");
                        break;
                    case 9:
                        arrayList.add("1934 - விண்வெளிக்கு சென்ற முதல் மனிதரான யூரி ககாரின் பிறந்த தினம்");
                        arrayList.add("1959 - பார்பி பொம்மை முதன் முதலாக விற்பனைக்கு வந்தது");
                        arrayList.add("2006 - சனியின் துணைக்கோளான என்செலாடசில் திரவ நிலையில் நீர் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1856 - அலபாமா பல்கலைக்கழகம் துவங்கப்பட்டது");
                        arrayList.add("1790 - உலகில், முதன் முதலாக , பொது மக்களின்   பார்வைக்காக   ஏற்படுத்தப்பட்ட மிருகக் காட்சி சாலை பாரிசில் அதிகார பூர்வமாகத் திறக்கப்பட்ட தினம் இன்று .");
                        break;
                    case 10:
                        arrayList.add("1876 - அலெக்சாண்டர் கிரகாம் பெல் உலகின் முதல் தொலைப்பேசி அழைப்பை மேற்கொண்டார்");
                        arrayList.add("1801 - பிரிட்டனில் முதல் மக்கள் தொகை கணக்கெடுப்பு நடத்தப்பட்டது");
                        arrayList.add("1948 - இந்திய யூனியன் முஸ்லீம் லீக் கட்சி துவங்கப்பட்டது");
                        arrayList.add("1982 - அனைத்து கோள்களும் சூரியனின் ஒரு பக்கத்தில் வரிசையாக காணப்பட்டன");
                        arrayList.add("1917 - பெட்ரோகிரேட் நகரில் முதன் முதலாக ரஷிய ராணுவக் கலவரம் தோன்றிய தினம்.");
                        break;
                    case 11:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஜாம்பியா இளைஞர்கள் தினம்");
                        arrayList.add("1702 - முதல் ஆங்கில நாளிதழான தி டெய்லி குராண்ட், லண்டனில் வெளியிடப்பட்டது");
                        arrayList.add("1861 - அமெரிக்க மாநிலங்களின் கூட்டமைப்பு, புதிய அரசியலமைப்பை அறிமுகப்படுகியது");
                        arrayList.add("1918 - ரஷ்யாவின் தலைநகரம் பெத்ரோகிராட்டில் இருந்து மாஸ்கோவுக்கு மாறியது");
                        arrayList.add("1955 - கண்டுபிடிப்பாளர் அலெக்சாண்டர் பிளெமிங் இறந்த தினம்");
                        break;
                    case 12:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - மொரீசியஸ் தேசிய தினம்");
                        arrayList.add("1954 - சாகித்ய அகாடமி, இந்திய அரசினால் தொடங்கப்பட்டது");
                        arrayList.add("1894 - முதல் முறையாக கொக்க-கோலா பானம், பாட்டிலில் விற்பனைக்கு வந்தது");
                        arrayList.add("1791 - புகழ் பெற்ற கனடா நாட்டு அரசியல் தலைவர் வில்லியம் மெக்கென்சி பிறந்தார்");
                        arrayList.add("1925 - அட்லாண்டிக் கடலுக்கு அப்பாலும் வானொலி நிகழ்ச்சிகள் கேட்கும்படியாக முதன் முதலாக அமெரிக்காவில் ஒலிபரப்பு இன்று  ஆரம்பமான தினம் .");
                        break;
                    case 13:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக சிறுநீரக நோய் விழிப்புணர்வு தினம்");
                        arrayList.add("1839 - இந்தியாவின் நவீன தொழில்துறையின் முன்னோடி ஜாம்ஷெட்ஜி டாடா பிறந்த தினம்");
                        arrayList.add("1639 - ஹாவர்ட் பல்கலைக்கழகத்திற்கு, ஆன்மீகவாதி ஜான் ஹாவர்டின் பெயர் சூடப்பட்டது");
                        arrayList.add("1781 - வில்லியம் ஹேர்ச்செல், யுரேனஸ் கோளை கண்டுபிடித்தார்");
                        arrayList.add("1923 - ஊமைப் படம் பேசும்படமாகியது இன்று தான் . இந்த ஒலி இணைந்த திரைப்படத்தை கண்டு பிடித்தவர்  , லீ டி பாரெஸ்ட் என்னும் அமெரிக்க விஞ்ஞானி");
                        break;
                    case 14:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஜப்பான் மற்றும் கொரியாவில் காதலர் தினம்");
                        arrayList.add("1879 - இயற்பியலாளர் ஆல்பர்ட் ஐன்ஸ்டீன் பிறந்த தினம்");
                        arrayList.add("1965 - இந்திய நடிகர் அமீர் கான் பிறந்த தினம்");
                        arrayList.add("1932 - அமெரிக்க கண்டுபிடிப்பாளர் ஜார்ஜ் ஈஸ்ட்மேன் இறந்த தினம்");
                        arrayList.add("1883 - ஜெர்மனிய தத்துவமேதை கார்ல் மார்க்ஸ் இறந்த தினம்");
                        break;
                    case 15:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச நுகர்வோர் தினம்");
                        arrayList.add("1970 - எக்ஸ்போ 70 உலகக் கண்காட்சி, ஜப்பானின் ஒசாக்கா நகரில் துவங்கியது");
                        arrayList.add("2004 - சூரியக் குடும்பத்தில் அதிவேகமான பொருளான 90377 செட்னா கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1917 - ரஷ்யாவில் தற்காலிக அரசாங்கம் நிறுவப்பட்டது. ஜார் மன்னர் இரண்டாம் நிகோலஸ் பதவி துறந்தார்.பின்னர் , இன்று இதே நாளில்  அவர் குடும்பத்துடன் சிறைவைக்கப்பட்டார்.");
                        arrayList.add("1767 - அமெரிக்காவின் ஏழாவது ஜனாதிபதியான ஆண்ட்ரூ  ஜாக்சன் இன்று தான் பிறந்தார்.");
                        break;
                    case 16:
                        arrayList.add("2006 - மனித உரிமைகளுக்கான ஐ.நா., அமைப்பை உருவாக்க ஐ.நா., பொதுச் சபை ஆதரவாக வாக்களித்தது");
                        arrayList.add("1942 - முதலாவது வி-2 ராக்கெட் விண்ணில் செலுத்தப்பட்டது");
                        arrayList.add("1966 - மனிதரை கொண்டு சென்ற நாசாவின் 12வது விண்கலமான ஜெமினி 8 ஏவப்பட்டது");
                        arrayList.add("1521 - மெகலன் பிலிப்பைன்சை அடைந்தார்");
                        arrayList.add("1787 - ஜெர்மன் நாட்டுப் பௌதிக விஞ்ஞானியான ஜார்ஜ் எஸ். ஓம். பிறந்த தினம் இன்று.");
                        break;
                    case 17:
                        arrayList.add("1861 - இத்தாலியப் பேரரசு அமைக்கப்பட்டது");
                        arrayList.add("1845 - ரப்பர் பேண்ட் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1950 - கலிபோர்னியா பல்கலைக்கழக ஆய்வாளர்கள் கலிபோர்னியம் என்ற 98வது தனிமத்தை கண்டுபிடித்ததாக அறிவித்தனர்");
                        arrayList.add("1473 - ஸ்காட்லாந்து அரசரான நான்காம் ஜேம்ஸ் மன்னர் பிறந்த தினம் இன்று.");
                        arrayList.add("1776 - போஸ்டனில் ( அமெரிக்கா)  இருந்த பிரிட்டிஷ் அகதிகள் இங்கிலாந்திற்குத் திரும்பிய தினம் இன்று.");
                        break;
                    case 18:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அருபா நாட்டின் கொடி நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - மங்கோலியா ராணுவ வீரர்கள் தினம்");
                        arrayList.add("1962 - அல்ஜீரிய விடுதலைப் போர் முடிவுக்கு வந்தது");
                        arrayList.add("1989 - எகிப்தில் 4400 ஆண்டுகள் பழமையான பதனிடப்பட்ட உடல் பிரமிட் ஒன்றில் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1858 - டீசல் இஞ்சினைக் கண்டு பிடித்த ஜெர்மானியக் கண்டு பிடிப்பாளரான ருடால்ப் டீசல்  பிறந்தார்.");
                        break;
                    case 19:
                        arrayList.add("1972 - இந்தியா-வங்கதேச நட்புறவு ஒப்பந்தம் கையெழுத்தானது");
                        arrayList.add("1932 - சிட்னி துறைமுகப் பாலம் திறந்து வைக்கப்பட்டது");
                        arrayList.add("1915 - புளூட்டோவின் ஒளிப்படம் முதல் முறையாக எடுக்கப்பட்டது");
                        arrayList.add("1860 - இங்கிலாந்தைச் சார்ந்த பிரபல அரசியல் தலைவர் வில்லியம் ஜென்னிங்க்ஸ் பிரைன் பிறந்தார்.");
                        arrayList.add("1883 - அமெரிக்காவின் புகழ்   பெற்ற தளபதியான ஜோசப் ஸ்டில்வெல்  பிறந்தார்.");
                        break;
                    case 20:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக சிட்டுக்குருவிகள் தினம்");
                        arrayList.add("1602 - டச்சு கிழக்கிந்தியக் கம்பெனி அமைக்கப்பட்டது");
                        arrayList.add("1956 - பிரான்சிடம் இருந்து துனீசியா விடுதலை பெற்றது");
                        arrayList.add("1727 - கணித அறிஞரும் , விஞ்ஞானியுமான சர். ஐசக் நியூட்டன் இறந்தார்");
                        arrayList.add("1834 - அமெரிக்கக் கல்வியாளர் சார்லஸ் டபுள்யூ எலியட் பிறந்தார்");
                        break;
                    case 21:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச வன நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக செய்யுள் நாள்(யுனெஸ்கோ)");
                        arrayList.add("1916 - புகழ்பெற்ற ஷெனாய் இசை கலைஞர் பிஸ்மில்லா கான் பிறந்த தினம்");
                        arrayList.add("1801 - அலெக்ஸாந்திரியா  யுத்தம் ஆரம்பமானது");
                        arrayList.add("1960 - தென்னாப்ரிக்காவில் ஷார்ப் ஷில்லி என்னும் இடத்தில் சமூக விரோதிகள் பயங்கர படுகொலையை நடத்திய கருப்பு தினம் இன்று");
                        break;
                    case 22:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச தண்ணீர் தினம்");
                        arrayList.add("1888 - கால்பந்தாட்ட லீக் போட்டிகள் துவங்கப்பட்டது");
                        arrayList.add("1993 - இன்டெல் நிறுவனம் முதல் பென்டியம் சிப்(80586) அறிமுகம் செய்தது");
                        arrayList.add("1895 - முதன் முதலாக லூமியேர சகோதரர்கள் அசையும் திரைப்படத்தை பிரத்யேகமாக காண்பித்தனர்");
                        arrayList.add("1430 - பிரான்ஸ் நாட்டுப் பிரபுவின் மகளும் , பிற்காலத்தில் இங்கிலாந்து அரசர் ஐந்தாம் ஹென்றியை மணந்து கொண்ட வளுமான மார்க்கரட் இன்று தான் பிறந்தார்.");
                        break;
                    case 23:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக வானிலை தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பாகிஸ்தான் குடியரசு தினம்");
                        arrayList.add("1940 - முஸ்லீம் லீக், இந்தியாவை மத அடிப்படையில் பிரிக்கும் கோரிக்கையை வெளியிட்டது");
                        arrayList.add("1931 - இந்திய சுத‌ந்திர போராட்ட வீரர் பகத் சிங் இறந்த தினம்");
                        arrayList.add("1931 - பிரிட்டிஷ் அரசின் வன்முறை நடவடிக்கைகளுள் ஒன்றான ரௌலட் சட்டத்தை எதிர்த்து  காந்திஜி உண்ணாவிரதம் இருந்த தினம் இன்று.");
                        break;
                    case 24:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச காச நோய் தினம்");
                        arrayList.add("1923 - கிரீஸ் நாடு குடியரசானது");
                        arrayList.add("1923 - தமிழ் திரைப்பட பின்னணி பாடகர் டி.எம்.செளந்தரராஜன் பிறந்த தினம்");
                        arrayList.add("1834 - இங்கிலாந்தைச் சேர்ந்த பிரபல கவிஞரான வில்லியம் மோரிஸ் பிறந்தார்");
                        arrayList.add("1977 - 81 வயதான மொரார்ஜி தேசாய் இந்தியாவின் பிரதமாராக பிரமாணம் எடுத்துக் கொண்ட தினம். இவர் இந்தியாவின் நான்காவது பிரதமர் மட்டும் அல்ல. உலகில் முதல் அதிக வயதான பிரதமரும் கூட.");
                        break;
                    case 25:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - கிரேக்க விடுதலை தினம்");
                        arrayList.add("1655 - டைட்டான் என்ற சனிக் கோளின் மிகப் பெரிய சந்திரனை கிறிஸ்டியன் ஹைஜன்ஸ் கண்டுபிடித்தார்");
                        arrayList.add("1857 - லியோன் ஸ்கொட், ஒலியை பதிவு செய்யும் கருவிக்கான காப்புரிமம் பெற்றார்");
                        arrayList.add("1807 - அடிமைகளை வர்த்தகம் செய்வது ஐக்கிய ராஜ்ய நாடுகளில் சட்டப்பூர்வமாக தடை செய்யப்பட்டது");
                        arrayList.add("1133 - இங்கிலாந்தைக் தனது  கண்டிப்பான நிர்வாகத்தினால் உயர்த்திய அரசர்  இரண்டாம் ஹென்றி இன்று தான் பிறந்தார்.");
                        break;
                    case 26:
                        arrayList.add("1971 - வங்கதேசம்  விடுதலை பெற்ற  தினம்");
                        arrayList.add("1934 - ரஷ்யாவில் வாகன ஓட்டுனர்களுக்கான தேர்வு அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("1953 - ஜொனாஸ் சால்க், போலியோ தடுப்பூசியை அறிமுகப்படுத்தினார்");
                        arrayList.add("2006 - முதல் அறிவியல் தமிழ் மாநாடு சென்னையில் நடைபெற்றது");
                        arrayList.add("1979 - எகிப்து நாட்டிற்கும் , இஸ்ரேல் நாட்டிற்கும் இடையே 30 ஆண்டுகளாக நடந்த போர் முடிவுக்கு வந்த தினம் இன்று");
                        break;
                    case 27:
                        arrayList.add("1918 - மல்தோவா, பெசராபியா ஆகியன ருமேனியாவுடன் இணைந்தன");
                        arrayList.add("1969 - நாசாவின் மரைனர் 7 என்ற ஆளில்லா தானியங்கி விண்கலம் செவ்வாய் கோளை நோக்கி ஏவப்பட்டது");
                        arrayList.add("1994 - ஐரோப்பாவில் முதல் விமான சேவை ஜெர்மனியில் துவங்கப்பட்டது");
                        arrayList.add("1794 - அமெரிக்காவில் நிரந்தர கடற்படையும், அதற்கான அலுவலகமும் அமைக்கப்பட்டது");
                        arrayList.add("1964 - அமெரிக்காவின் அலாஸ்கா மாநிலத்தின் பெரும் பகுதி பயங்கர பூகம்பத்தினால் அழிந்த தினம் இன்று");
                        break;
                    case 28:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஸ்லோவேக்கியா, செக் குடியரசு -ஆசிரியர் தினம்");
                        arrayList.add("1802 - ஓல்பேர்ஸ், 2 பேலெஸ் என்ற சிறுகோளைக் கண்டுபிடித்தார்");
                        arrayList.add("1982 - தென்னிந்திய நடிகை சோனியா அகர்வால் பிறந்த தினம்");
                        arrayList.add("1943 - இந்திய விடுதலை போராட்ட வீரர் எஸ்.சத்தியமூர்த்தி இறந்த தினம்");
                        arrayList.add("2006 - தத்துவஞானி வேதாத்திரி மகரிஷி இறந்த தினம்");
                        break;
                    case 29:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - தைவான் இளைஞர்கள் தினம்");
                        arrayList.add("1849 - பஞ்சாபை ஐக்கிய ராஜ்ஜியம் கைப்பற்றியது");
                        arrayList.add("2004 - அயர்லாந்து, புகைத்தலை வேலையிடங்களில் தடை செய்த முதல் நாடானது");
                        arrayList.add("1790 - அமெரிக்காவின் பத்தாவது ஜனாதிபதியான ஜான் டெய்லர் பிறந்தார்.");
                        arrayList.add("1871 - விக்டோரியா கலாத்துக் கட்டடப்பாணியில் உருவாக்கப்பட்ட இலண்டன் ஆல்பர்ட் ஹால் அதிகார பூர்வமாக திறக்கப்பட்டது.");
                        break;
                    case 30:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அமெரிக்காவில் தேசிய மருத்துவர்கள் தினம்");
                        arrayList.add("1709 - தமிழில் நாட்குறிப்பு எழுதிய ஆனந்த் ரங்கம் பிள்ளை பிறந்த தினம்");
                        arrayList.add("1842 - அறுவை சிகிச்சைகளில் முதன் முதலாக மயக்க மருந்து குரோஃபோர்ட் லோங் என்பவரால் பயன்படுத்தப்பட்டது");
                        arrayList.add("1858 - ரப்பர் உடனான பென்சிலுக்கு ஹைமன் லிப்மன் என்பவர் காப்புரிமம் பெற்றார்");
                        arrayList.add("1853 - டச்சு நாட்டு ஓவிய மேதை வின்சென்ட் வான்கோவ் ஹாலந்தில் இன்று பிறந்தார்");
                        break;
                    case 31:
                        arrayList.add("1979 - மால்ட்டா விடுதலை நாள்");
                        arrayList.add("1889 - ஈபிள் கோபுர தொடக்க விழா கொண்டாடப்பட்டது");
                        arrayList.add("2004 - கூகுள், 1 ஜிகா பைட் கொள்ளளவு உள்ள ஜிமெயிலை அறிவித்தது");
                        arrayList.add("1878 - உலகப் புகழ் பெற்ற அமெரிக்கக் குத்துச் சண்டை வீரரான ஜாக் ஜான்சன் இன்று தான் பிறந்தார்.");
                        arrayList.add("1966 - சந்திரனை முதன் முதலாக சுற்றி வந்த லூனா - 10 என்ற விண்கலம் விண்ணில் செலுத்தப்பட்ட தினம் ( இன்று )");
                        break;
                }
                break;
            case 3:
                switch (i2) {
                    case 1:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - சர்வதேச முட்டாள்கள் தினம்");
                        arrayList.add("1960 - முதலாவது வானிலை செயற்கைக் கோள்ளான  டைரோஸ் விண்ணில்  செலுத்தப்பட்ட தினம் இன்று. இது தான்  முதன் முதலாக மேகக் கூட்டங்களை  ஆராய்ந்து 25,000 படங்களை அனுப்பியது குறிப்பிடத்தக்கது.");
                        arrayList.add("1881 - உலகில் முதன் முதலாக பல இல்லங்களுக்கு தொலைபேசி இணைப்பு கொடுக்கப்பட்டது. ");
                        arrayList.add("1891 - சிகாகோவில் ரிக்லி நிறுவனம் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1951 - இந்தியாவில் முதல் ஐந்தாண்டுத் திட்டம் தொடங்கப்பட்ட தினம் இன்று ");
                        break;
                    case 2:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - உலக சிறுவர் நூல் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - ஈரானில் இயற்கை தினம்");
                        arrayList.add("1975 - டொரண்டோவில் உலகின் மிக உயரமான சி.என்.கோபுரம் கட்டி முடிக்கப்பட்டது");
                        arrayList.add("1980 - லோக் தளத்தில் இருந்து நீக்கப்பட்ட ராஜ் நாராயன் ஜனதா ( எஸ்) கட்சியை உருவாக்கினார். ");
                        arrayList.add("1953 - இந்தியப் போராட்ட வீரர்களுள் ஒருவரான ஆசப் அலி இறந்தார். ");
                        break;
                    case 3:
                        arrayList.add("1721 - இங்கிலாந்தின் முதல் பிரதமராக ராபர்ட் வால்போல் பதவி ஏற்றார். ");
                        arrayList.add("1973 - உலகின் முதல் நகர்பேசி அழைப்பு நியூயார்க் நகரில் மேற்கொள்ளப்பட்டது");
                        arrayList.add("1955 - இந்திய பின்னணி பாடகர் ஹரிஹரன் பிறந்த தினம்");
                        arrayList.add("1680 - மராட்டிய பேரரசர் சிவாஜி இறந்த தினம்");
                        arrayList.add("1948 - தென் கொரியாவில் ஜேஜூ என்ற இடத்தில் மனித உரிமை மீறல் மற்றும் உள்நாட்டுப் போர் ஆரம்பித்தது");
                        break;
                    case 4:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - சர்வதேச விழிப்புணர்வு தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - தைவான், ஹாங்காங்கில் சிறுவர்கள் தினம்");
                        arrayList.add("1969 - டெண்டன் கூலி, உலகின் முதல் தற்காலிக செயற்கை இதயத்தை பொருத்தினார்");
                        arrayList.add("1968 - கறுப்பினத் தலைவர் மார்டின் லூதர் கிங் இறந்த தினம்");
                        arrayList.add("1979 - பாகிஸ்தானில் ஏற்பட்ட இராணுவப் புரட்சியால் பதவி பறிக்கப்பட்டு கைது செய்யப்பட்ட பூட்டோவுக்கு தூக்கு தண்டனை நிறைவேற்றப்பட்டது. ");
                        break;
                    case 5:
                        arrayList.add("1930 - மகாத்மா காந்தி, தண்டியில் உப்பு சத்தியாகிரகம் மேற்கொண்டார்");
                        arrayList.add("1879 - பொலிவியா,பெரு மற்றும் சிலி நாடுகளிடையே பசிபிக் போர் ஆர்மபமானது");
                        arrayList.add("1654 - ஆங்கில-டச்சு போரை முடிவுக்கு கொண்டு வர வெஸ்ட்மின்ஸ்டர் உடன்பாடு ஏற்பட்டது");
                        arrayList.add("1974 - பிரஞ்சுப் புரட்சி வீரர் ஜார்ஜ் ஜெக்யூடாண்டனுக்குத் தூக்குத் தண்டனை நிறைவேற்றப்பட்ட தினம் இன்று.  ");
                        arrayList.add("1979 - இந்தியாவின் முதல் கப்பல்படை அருங்காட்சியகம் பம்பாயில் நிறுவப்பட்ட தினம் இன்று ");
                        break;
                    case 6:
                        arrayList.add("கிமு 648 - ஆரம்பகால சூரிய கிரகணம் கிரேக்கர்களால் பதியப்பட்டது");
                        arrayList.add("1199 - இங்கிலாந்தின் முதலாம் ரிச்சர்ட் மன்னர் பிரான்ஸ் சாலுஸ் போர்க்களத்தில்  வீர மரணம் அடைந்த தினம் இன்று. ");
                        arrayList.add("1896 - நவீன யுகத்தில் , முதல் ஒலிம்பிக் விளையாட்டுப் போட்டிகள் ஏதென்சில் ஆரம்பமான தினம் இன்று. ");
                        arrayList.add("1919 - மகாத்மா காந்தி பொது வேலை நிறுத்தத்தை அறிவித்தார்");
                        arrayList.add("1965 - ஏர்ளி பேட் என்ற தொடர்பாடற்ற செய்மதி விண்ணில் ஏவப்பட்டது");
                        break;
                    case 7:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - உலக சுகாதார தினம்");
                        arrayList.add("1948 - உலக சுகாதார நிறுவனம், ஐ.நா.,வால் தொடங்கப்பட்டது");
                        arrayList.add("1920 - இந்திய சிதார் கலைஞரான பண்டிட் ரவிசங்கர் இன்று தான்  பிறந்தார். இவர் தான் முதல் முதலாக வெளிநாட்டுப் படங்களுக்கு (முதன் முதலில்)  இசை அமைத்த  இந்தியக் கலைஞர்.   ");
                        arrayList.add("1946 - பிரான்சிடம் இருந்த சிரியாவின் விடுதலை அங்கீகரிக்கப்பட்டது");
                        arrayList.add("1989 - உலகிலேயே 4000 ரன்களும், 300 விக்கெட்டுகளும் எடுத்த இரண்டாவது  வீரர் என்ற பெருமையை கபில் தேவ் பெற்ற தினம் இன்று.  ");
                        break;
                    case 8:
                        arrayList.add("1957 - எகிப்தில் சூயஸ் கால்வாய் திறக்கப்பட்டது");
                        arrayList.add("1867 - முதலாவது உலக கண்காட்சி பாரிசில் ஆரம்பமானது");
                        arrayList.add("1938 - ஐ.நா., வின் முன்னாள் பொதுச் செயலாளர் கோபி அன்னன் பிறந்த தினம்");
                        arrayList.add("1986 - இந்தியாவின் முதல் பல்கலைக் கழகமான 'யுனிவெர்சிட்டி ஆப் ஹெல்த் சயின்ஸ்' விஜயவாடாவில் ஆரம்பிக்கப்பட்ட தினம் இன்று.  ");
                        arrayList.add("1993 - குடியரசு மாசிடோனியா, ஐ.நா.,வில் இணைந்தது");
                        break;
                    case 9:
                        arrayList.add("1882 - கவிஞர் டாண்டே கேபிரியல் ரேஸட்டி என்ற   புகழ் பெற்ற ஓவியர் மறைந்தார். ");
                        arrayList.add("1953 - வார்னர் பிரதர்ஸ் நிறுவனம், முதல் 3டி திரைப்படமான ஹவுஸ் ஆப் வேக்ஸ்-ஐ வெளியிட்டது");
                        arrayList.add("1945 - அமெரிக்காவில் அணுசக்தி கழகம் உருவாக்கப்பட்டது");
                        arrayList.add("1957 - சூயஸ் கால்வாயில் கப்பல் போக்குவரத்து துவங்கப்பட்டது");
                        arrayList.add("1969 - உலகின் 2வது பழமையான கூடைப்பந்து கழகம் பிலிபைன்சில் கழகத்தால் முதல் முறையாக கூடைப்பந்தாட்ட போட்டிகள் நடத்தப்பட்டது");
                        break;
                    case 10:
                        arrayList.add("1542 - முகலாய மன்னர் அக்பர் பிறந்தார் ");
                        arrayList.add("1710 - காப்புரிமை பற்றிய முதல் சட்ட விதிகள் பிரிட்டானியாவில் வெளியிடப்பட்டன");
                        arrayList.add("1912 - டைட்டானிக் பயணிகள் கப்பல் தனது முதல் மற்றும் கடைசியுமான பயணத்தை இங்கிலாந்தின் செளதாப்ம்டன் துறைமுகத்தில் துவங்கியது");
                        arrayList.add("1982 - இன்சாட் 1 ஏ என்ற இந்திய செயற்கைக் கோள் அமெரிக்காவில் இருந்து ஏவப்பட்ட தினம் இன்று.   ");
                        arrayList.add("1995 - இந்தியாவின் முன்னாள் பிரதமர் மொராஜி தேசாய் இறந்த தினம்");
                        break;
                    case 11:
                        arrayList.add("1921 - விளையாட்டு வர்ணனை முதன் முறையாக வானொலியில் ஒலிபரப்பானது");
                        arrayList.add("1905 - ஐன்ஸ்டீன் தனது சார்புக் கோட்பாட்டை வெளியிட்டார்");
                        arrayList.add("1919 - சர்வதேச தொழிலாளர் அமைப்பு துவங்கப்பட்டது");
                        arrayList.add("1970 - அப்போலோ 13 விண்ணில் ஏவப்பட்டது");
                        arrayList.add("1971 - பங்களாதேஷின்  அதிபராக முஜிபுர் ரகுமான்,  தம்மை அறிவித்துக் கொண்ட தினம் இன்று. ");
                        break;
                    case 12:
                        arrayList.add("1931 - ஸ்பெயின் நாட்டு அரசர் அல்பான்சோ முடி துறந்த தினம் இன்று    ");
                        arrayList.add("1981 - முதலாவது மீள் விண்ணோடமான கொலம்பியா விண்ணில்‌ ஏவப்பட்டது");
                        arrayList.add("1945 - அமெரிக்க ஜனாதிபதியான ரூஸ்வெல்ட் மரணம் அடைந்த தினம் இன்று. ");
                        arrayList.add("1991 - வளைகுடாப்  போர் 86 நாட்களுக்குப் பின் முடிவுக்கு வந்த தினம் இன்று ");
                        arrayList.add("2006 - கன்னட நடிகர் ராஜ்குமார் இறந்த தினம்");
                        break;
                    case 13:
                        arrayList.add("2006 - கூகுள் காலண்டர் வெள்ளோட்டம் விடப்பட்டது");
                        arrayList.add("1749 - அமெரிக்க ஜனாதிபதிகளுள் ஒருவரான தாமஸ்  ஜெபர்சன் பிறந்தார்  ");
                        arrayList.add("1930 - தமிழ்த் திரைப்பட பாடலாசிரியர் பட்டுக்கோட்டை கல்யாணசுந்தரம் பிறந்த தினம்");
                        arrayList.add("1960 - முதல் கடல் ஆய்வுச் செயர்க்கைகோளான டிரான்சிஸ்ட் 1 பி அனுப்பப்பட்ட தினம் இன்று. இது கடலில் பயணம் செய்பவர்களுக்குப் பெரிதும் உதவும்.  ");
                        arrayList.add("1992 - தமிழகத்தில் பெண்களால் நிர்வகிக்கப்படும் முதலாவது காவல் நிலையம் ஆரம்பிக்கப்பட்ட தினம் இன்று. ");
                        break;
                    case 14:
                        arrayList.add("1828 - நோவா வெப்ஸ்டர் தனது அகராதியின் முதல் பதிவுக்கான காப்புரிமையை பெற்றார்");
                        arrayList.add("1849 - ஹங்கேரி ஆஸ்திரியாவிலிருந்து விடுதலை அறிவித்தது");
                        arrayList.add("1890 - இந்திய சட்ட நிபுணர் அம்பேத்கார் பிறந்த தினம்");
                        arrayList.add("1951 - இந்திய ரயில்வே  பிரிக்கப்பட்டு முதல் மண்டலமாக தென்மண்டலம் ஒழுங்குபடுத்தப்பட்டு அதற்கு சென்னையை தலைமை இடமாகக் கொண்டு செயல் பட ஆரம்பித்த தினம் இன்று. ");
                        arrayList.add("1988 - ஆப்கானிஸ்தானில் அமைதியை நிலைநாட்ட ஜெனிவா உடன்பாடு கையெழுத்து ஆன தினம் இன்று. ");
                        break;
                    case 15:
                        arrayList.add("1976 - தமிழகத்தில் வள்ளுவர் கோட்டம் திறந்து வைக்கப்பட்டது");
                        arrayList.add("1755 - சாமுவேல் ஜான்சன், தனது ஆங்கில அகராதியை வெளியிட்டார்");
                        arrayList.add("1892 - ஜெனரல் எலக்ட்ரிக் நிறுவனம் உருவாக்கப்பட்டது");
                        arrayList.add("1923 - இன்சுலின் முதன் முதலாக நீரிழிவு நோய்க்கு மருந்தாகக் கருதப்பட்டது");
                        arrayList.add("1912 - இன்று அதிகாலை தான் டைடானிக் கப்பல் கடலில் மூழ்கியது ");
                        break;
                    case 16:
                        arrayList.add("1946 - சிரியா விடுதலை நாள்");
                        arrayList.add("1889 - நகைச்சுவை நடிகர் சார்லி சாப்ளின் பிறந்த தினம்");
                        arrayList.add("1853 - இந்தியாவின் முதல் பயணிகள் தொடருந்து சேவை மும்பையில் துவங்கப்பட்டது");
                        arrayList.add("1992 - ஆறு ஆண்டுகளாக ஆப்கானிஸ்த்தானை  ஆண்ட சர்வாதிகாரி நஜிபுல்லா பதவி விலகியதுடன் நாட்டை விட்டே ஓடிய தினம் இன்று.  ");
                        arrayList.add("1917 - முதல் உலகப் போரில் அமெரிக்கா தனது மௌனத்தைக் கலைத்து முதன் முதலாக ஜெர்மனியின் மீது போர் பிரகடனம் செய்த நாள் ");
                        break;
                    case 17:
                        arrayList.add("1756 - இந்திய சுதந்திர போராட்ட வீரர் தீரன் சின்னமலை பிறந்த தினம்");
                        arrayList.add("1959 - சிந்து நதியின் தண்ணீரை இந்தியாவும், பாகிஸ்தானும் பயன்படுத்திக் கொள்வதற்கான ஒப்பந்தம் கையெழுத்து  ஆன தினம் இன்று. ");
                        arrayList.add("1790 - அமெரிக்க கண்டுபிடிப்பாளர் பெஞ்சமின் பிராங்கிளின் இறந்த தினம்");
                        arrayList.add("1975 - இந்தியாவின் முன்னாள் ஜனாதிபதி டாக்டர் ராதாகிருஷ்ணன் மறைந்தார்.  ");
                        arrayList.add("1975 - ரோகிணி  என்னும்   செயற்கைக் கோளை இந்தியா விண்ணில்  ஏவிய தினம் இன்று. ");
                        break;
                    case 18:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - உலக பாரம்பரிய தினம்");
                        arrayList.add("1980 - ஜிம்பாப்வே விடுதலை நாள்");
                        arrayList.add("1859 - ஜான்சி  ராணி  லக்ஷ்மிபாயின் குருவான தாந்தியா தோபே இறந்த தினம் இன்று ");
                        arrayList.add("1955 - விஞ்ஞானி ஆல்பர்ட் ஐன்ஸ்டீன் இறந்தார் ");
                        arrayList.add("1991 - கேரளா 100 சதவித எழுத்தறிவு கொண்ட மாநிலம் என்பதை  அம்மாநில  அரசு அதிகார பூர்வமாக அறிவித்த தினம் இன்று ");
                        break;
                    case 19:
                        arrayList.add("1957 - இந்திய தொழிலதிபர் முகேஷ் அம்பானி பிறந்த தினம்");
                        arrayList.add("1975 - இந்தியாவின் முதல் செய்மதி ஆரியபட்டா விண்ணுக்கு ஏவப்பட்டது");
                        arrayList.add("1775 - அமெரிக்க புரட்சிப் போர் துவங்கியது");
                        arrayList.add("1810 - வெனிசுலாவில் ராணுவ ஆட்சி நிறுவப்பட்டது");
                        arrayList.add("1882 - விஞ்ஞானி சார்லஸ் டார்வின் மறைந்தார் ");
                        break;
                    case 20:
                        arrayList.add("1999 - ஜெர்மன் நாடாளுமன்றம் பெர்லின் நகருக்கு மாற்றப்பட்டது");
                        arrayList.add("1926 - திரைப்படத்துக்கு ஒலியை இணைக்கும் வைட்டாபோன் என்ற முறை அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("1889 - ஜெர்மானிய சர்வாதிகாரி அடொல்ஃப் ஹிட்லர் பிறந்த தினம்");
                        arrayList.add("1950 - இந்திய அரசியல் தலைவர் சந்திரபாபு நாயுடு பிறந்த தினம்");
                        arrayList.add("1810 - ஸ்பெயின் நாடு விடுதலை அடைந்ததாக அறிவிக்கப்பட்டது");
                        break;
                    case 21:
                        arrayList.add("1944 - பிரான்சில் பெண்களுக்கு வாக்குரிமை கிடைத்தது");
                        arrayList.add("1960 - பிரேசீலியா, பிரேசிலின் தலைநகர் ஆக்கப்பட்டது");
                        arrayList.add("1994 - சூரிய குடும்பத்திற்கு வெளியே கோள்கள் இருப்பதை அலெக்சாண்டர் வோல்ஸ்க்சான் முதன் முதலில் அறிவித்தார்");
                        arrayList.add("1964 - புரட்சிக் கவிஞர் பாவேந்தர் பாரதிதாசன் இறந்த தினம்");
                        arrayList.add("1926 - ஐக்கிய ராஜ்யத்தின் மகாராணி இரண்டாம் எலிசபெத் பிறந்த தினம்");
                        break;
                    case 22:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - சர்வதேச பூமி நாள்");
                        arrayList.add("2006 - இந்தியாவில் பிரமோஸ் ஏவுகணை வெற்றிகரமாக சோதனை செய்யப்பட்டது");
                        arrayList.add("1991 - அல்பேனியாவில் தேசிய ஜனநாயகக் கட்சி துவங்கப்பட்டது");
                        arrayList.add("1915 - முதன் முதலாகப் போரில் விஷ வாயுவை பயன்படுத்தும் யுத்தியை ஜெர்மனி இன்று கையாண்ட தினம் ");
                        arrayList.add("1870 - ரஷ்யத்   தலைவர் லெனின் பிறந்தார் ");
                        break;
                    case 23:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - உலக புத்தக மற்றும் பதிப்புரிமை தினம்");
                        arrayList.add("1639 - புனித ஜார்ஜ் கோட்டை சென்னையில் கட்டப்பட்டது");
                        arrayList.add("1993 - இந்திய தேசிய லீக் கட்சி உருவாக்கப்பட்டது");
                        arrayList.add("1850 - புகழ்  பெற்ற ஆங்கிலக்  கவிஞரான வில்லியம் வோர்ட்ஸ் வொர்த் மறைந்தார் ");
                        arrayList.add("1992 - உலகப் புகழ்பெற்ற திரைப்பட இயக்குனர் சத்யஜித்ரே இறந்த தினம்");
                        break;
                    case 24:
                        arrayList.add("1970 - ஜாம்பியா குடியரசு தினம்");
                        arrayList.add("1973 - இந்திய கிரிக்கெட் வீரர் சச்சின் டெண்டுல்கர் பிறந்த தினம்");
                        arrayList.add("1993 - இந்தியாவில் பஞ்சாயத்து ராஜ் திட்டம் அமைக்கப்பட்டது");
                        arrayList.add("1981 - முதலாவது ஐ.பி.எம்., மேஜைக் கணினி அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("1704 - அமெரிக்காவின் செய்திப் பத்திரிக்கையான தி பொஸ்டன் நாளிதழ் வெளியிடப்பட்டது");
                        break;
                    case 25:
                        arrayList.add("1599 - முதலாம் வில்லியம் அரசர் பிறந்தார். ");
                        arrayList.add("1974 - போர்ச்சுக்கல் விடுதலை நாள்");
                        arrayList.add("1906 - நவீன தமிழ் இலக்கிய முன்னோடி புதுமைபித்தன் பிறந்த தினம்");
                        arrayList.add("1898 - அமெரிக்கா,ஸ்பெயின் மீது போரை அறிவித்தது");
                        arrayList.add("1912 - டாக்டர் மு. வரதராசன் பிறந்தார் ");
                        break;
                    case 26:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - அறிவுசார் சொத்துரிமை பாதுகாப்பு தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - தான்சானியா தேசிய தினம்");
                        arrayList.add("1564 - ஆங்கில எழுத்தாளர் வில்லியம் ஷேக்ஸ்பியர் பிறந்த தினம்");
                        arrayList.add("1897 - தமிழறிஞர் மனோன்மணியம் பெ.சுந்தரம் பிள்ளை இறந்த தினம்");
                        arrayList.add("1564 - புகழ்பெற்ற நாடக ஆசிரியர் ஷேக்ஸ்பியர்  அவர்களுக்கு ஞானஸ்னானம்   செய்யப்பட  நாள் ");
                        break;
                    case 27:
                        arrayList.add("1739 - தந்தி  முறையைக் கண்டுபிடித்த  சாமுவேல் எப் .பி. மோர்ஸ் அமெரிக்காவில் பிறந்தார் ");
                        arrayList.add("1960 - டோகோ விடுதலை நாள்");
                        arrayList.add("1981 - ஜெராக்ஸ் பார்க், முதன் முறையாக கணினி மவுசை அறிமுகப்படுத்தியது");
                        arrayList.add("1992 - செர்பியா மற்றும் மொண்டெனேகிரோ ஆகியவற்றை உள்ளடக்கிய யுகொஸ்லாவிய கூட்டுக் குடியரசு அமைக்கப்பட்டது");
                        arrayList.add("1994 - தென்னாப்பிரிக்காவில் முதன் முறையாக கறுப்பினத்தவரும் வாக்களித்த மக்களாட்சி முறையிலான தேர்தல் நடைபெற்றது");
                        break;
                    case 28:
                        arrayList.add("1920 - அசர்பைஜான், சோவியத் ஒன்றியத்துடன் இணைக்கப்பட்டது");
                        arrayList.add("1932 - மஞ்சள் காய்ச்சலுக்கான தடுப்பூசி முதன் முதலாக அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("1942 - தமிழறிஞர் உ.வே.சாமிநாதையர் இறந்த தினம்");
                        arrayList.add("1945 - இத்தாலிய நாட்டு சர்வாதிகாரி முசோலினி இறந்த தினம்");
                        arrayList.add("1945 - கம்பி இல்லாத தந்தி முதன் முதலாக அமெரிக்காவில் செயல் படுத்தப் பட்ட தினம் இன்று ");
                        break;
                    case 29:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - சர்வதேச நடன நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - ஜப்பான் தேசிய தினம்");
                        arrayList.add("1848 - இந்திய ஓவியர் ரவி வர்மா பிறந்த தினம்");
                        arrayList.add("1970 - அமெரிக்க டென்னிஸ் வீரர் அன்ட்ரே அகாசி பிறந்த தினம்");
                        arrayList.add("1985 - இந்தியா விண்ணில் செலுத்திய அனுராதா என்னும் செயற்கைக் கோள் வெடித்த தினம் ");
                        break;
                    case 30:
                        arrayList.add("1975 - வியட்நாம் விடுதலை நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - மெக்சிகோ சிறுவர் தினம்");
                        arrayList.add("1982 - திருச்சியில் பாரதிதாசன் பல்கலைக்கழகம் அமைக்கப்பட்டது");
                        arrayList.add("1945 - ஹிட்லர் தனது காதலி உடன் தற்கொலை செய்து கொண்ட தினம் ");
                        arrayList.add("1985 - 55 வயதில் ரிச்சர்ட் என்னும் அமெரிக்கர் எவரெஸ்ட்  சிகரத்தை அடைந்து புதிய உலக சாதனை படைத்தார் ");
                        break;
                }
                break;
            case 4:
                switch (i2) {
                    case 1:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக தொழிலாளர் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - இத்தாலி தேசிய தினம்");
                        arrayList.add("1956 - இளம்பிள்ளை வாத நோய்த் தடுப்பு மருந்து அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("1897 - சுவாமி விவேகானந்தரால் 'ராமகிருஷ்ணா  மிஷன்'  இந்தியாவில் நிறுவப்பட்ட தினம் இன்று.");
                        arrayList.add("1866 - இந்தியாவில் பதிவுத் தபால் கடித உறை அறிமுகமானது.");
                        break;
                    case 2:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - போலந்து கொடி நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஈரான் ஆசிரியர் தினம்");
                        arrayList.add("1921 - இந்திய திரைப்பட இயக்குநர் சத்யஜித் ரே பிறந்த தினம்");
                        arrayList.add("1519 - இத்தாலிய ஓவியர் லியானர்டோ டா வின்சி இறந்த தினம்");
                        arrayList.add("2009 - தென்னிந்திய திரைப்பட நடிகர் கே.பாலாஜி இறந்த தினம்");
                        break;
                    case 3:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக பத்திரிக்கை சுதந்திர தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - போலந்து அரசியலமைப்பு தினம்");
                        arrayList.add("1941 - பிபிசி தமிழோசை வானொலி ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1469 - இத்தாலிய சிந்தனையாளர் மாக்கியவல்லி பிறந்தார்");
                        arrayList.add("1926 - பிரிட்டனில்  பொது வேலை நிறுத்தம் தொடங்கிய தினம் இன்று");
                        break;
                    case 4:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச தீயணைப்பு படையினர் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சீனா இளைஞர்கள் தினம்");
                        arrayList.add("1924 - பாரிஸ் நகரில் ஒலிம்பிக் விளையாட்டுக்கள் ஆரம்பமாயின");
                        arrayList.add("1779 - ஆங்கிலேயர்களால் மைசூரை ஆண்ட திப்பு சுல்தான் கொல்லப்பட்ட தினம் இன்று");
                        arrayList.add("1990 - காவேரி பிரச்சனைக்கு நடுவர் மன்றத்தை அமைக்குமாறு மத்திய அரசுக்கு உச்சநீதிமன்றம் உத்தரவு பிறப்பித்த தினம்.");
                        break;
                    case 5:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச மருத்துவச்சிகள் தினம்");
                        arrayList.add("1945 - டென்மார்க் விடுதலை நாள்");
                        arrayList.add("1916 - தமிழ் திரைப்பட நடிகர் பி.யு.சின்னப்பா பிறந்த தினம்");
                        arrayList.add("1936 - இத்தாலி - எத்தியோப்பியா  போர் நடந்த தினம். இதில் பிரிட்டன் எத்தியோபியாவை மீட்டு  அரசர் ஹெயில் செலாஸிடம் திருப்பிக் கொடுத்த தினம்.");
                        arrayList.add("1818 - காரல் மார்க்ஸ் பிறந்தார்");
                        break;
                    case 6:
                        arrayList.add("1854 - இந்தியாவில் முதல் தபால் தலை வெளியிடப்பட்டது");
                        arrayList.add("1861 - இந்திய விடுதலை வீரர் மோதிலால் நேரு பிறந்த தினம்");
                        arrayList.add("1840 - பென்னி பிளாக் அஞ்சல்தலை ரஷ்யாவில் பயன்படுத்த அனுமதிக்கப்பட்டது");
                        arrayList.add("1870 - மயக்க மருந்தான குலோரபாமை கண்டுபிடித்த  ஜேம்ஸ் சிம்ப்ஸன் என்பவர் இறந்தார்.");
                        arrayList.add("1622 - செவ்விந்திய மக்களிடம் சில உடைகளையும், பாசிமணி மாலைகளையும் கொடுத்து , மன்ஹாட்ட தீவை வெள்ளையர்கள் ஏமாற்றி வாங்கிய தினம் இன்று. அதன் மதிப்பு வெறும் 20 டாலர் மட்டுமே.");
                        break;
                    case 7:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - நார்வே தேசிய தினம்");
                        arrayList.add("1861 - வங்காள மொழிக் கவிஞர் ரவீந்திரநாத் தாகூர் பிறந்த தினம்");
                        arrayList.add("1946 - சோனி நிறுவனம் டோக்கியோவில் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1952 - ஒருங்கிணைந்த மின்சுற்று தத்துவம் ஜெப்ரி டம்மர் என்பவரால் வெளியிடப்பட்டது");
                        arrayList.add("1812 - ஆங்கிலக் கவிஞர் ஆன    ராபர்ட் பிரௌனிங்க் பிறந்தார்");
                        break;
                    case 8:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக செஞ்சிலுவை தினம்");
                        arrayList.add("1945 - ஐரோப்பா வெற்றி தினம்");
                        arrayList.add("2007 - புதிய வட அயர்லாந்து உயர்சபை அமைக்கப்பட்டது");
                        arrayList.add("1945 - இரண்டாம் உலகப்போரின் முடிவில் ஜெர்மானியப் படையினர் , நேசக் கூட்டணியிடம் சரணம் அடைந்த தினம் இன்று.");
                        arrayList.add("1974 - இந்தியாவில் முதல் ரயில்வே  பொது வேலை நிறுத்தம் நடந்த தினம் இன்று.");
                        break;
                    case 9:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச அன்னையர் தினம்");
                        arrayList.add("1945 - ரஷ்யா வெற்றி நாள்");
                        arrayList.add("1874 - குதிரையால் செலுத்தப்படும் உலகின் முதல் பயணிகள் வண்டி மும்பையில் அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("1540 - முகலாய அரசரான அக்பரையே கதிகலங்க செய்த மாவீரர் ராணா பிரதாப் சிங்க் பிறந்த தினம் இன்று.");
                        arrayList.add("1800 - ஆபிரகாம் லிங்கனுக்கு முன்பாகவே நீக்ரோக்களுக்காக பாடுபட்ட ஜான் பிரவுன் என்ற தியாகி பிறந்த தினம் இன்று. அவர் இதற்காக மரண தண்டனை விதிக்கப்பட்டார்.");
                        break;
                    case 10:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அமெரிக்க வானியல் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஹங்கேரியில் பறவைகள் மற்றும் மரங்கள் தினம்");
                        arrayList.add("1979 - மைக்குரேனேசிய கூட்டாட்சி நாடுகள் சுயாட்சி பெற்றன");
                        arrayList.add("1990 - மணிக்கு 225 கிலோமீட்டர் வேகத்தில் ஆந்திராவில் ஏற்பட்ட புயல் காரணமாக 85 பேர்  மாண்டனர்.");
                        arrayList.add("1940 - பிரிட்டிஷ் மக்களின் நம்பிக்கையை இழந்ததால் பிரதமர் நெவில்லி சேம்பர்லின் தன் பதவியை ராஜினாமா செய்தார்");
                        break;
                    case 11:
                        arrayList.add("கி . பி  330 - ரோமன் தலைநகராக கான்ஸ்டான்டி நோபில் செயல் படத் தொடங்கிய தினம்.");
                        arrayList.add("1949 - சியாம் நாடு தாய்லாந்து எனப் பெயர் மாற்றப்பட்டது");
                        arrayList.add("1998 - இந்தியா, பொஹ்ரைனில் 3 அணுச் சோதனையை நடத்தியது");
                        arrayList.add("1897 - யோகி சுத்தானந்த பாரதியார் பிறந்த தினம்");
                        arrayList.add("1895 - தத்துவ சிந்தனையாளர் ஜே. கிருஷ்ண மூர்த்தி பிறந்தார்.");
                        break;
                    case 12:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச செவிலியர் தினம்");
                        arrayList.add("1820 - நவீன தாதியியல் முறையை உருவாக்கிய புளோரன்ஸ் நைட்டிங்கேல் பிறந்த தினம்");
                        arrayList.add("1821 - கிரேக்க சுதந்திர போர் துவங்கியது");
                        arrayList.add("1965 - சோவியத் ஒன்றியத்தின் லூனா 5 விண்கலம் சந்திரனில் மோதியது");
                        arrayList.add("1812 - ஆங்கிலத்தில் 'நான்சன்ஸ்' என்ற தலைப்பில் வேடிக்கை கதைகளை எழுதிய 'எட்வர்ட் லீர்' என்ற புகழ் பெற்ற எழுத்தாளர் பிறந்தார்.");
                        break;
                    case 13:
                        arrayList.add("1830 - எக்குவாடோர் விடுதலை அடைந்தது");
                        arrayList.add("1648 - டில்லியில் செங்கோட்டை கட்டி முடிக்கப்பட்டது");
                        arrayList.add("1956 - இந்திய ஆன்மிக குரு ஸ்ரீ ஸ்ரீ ரவிசங்கர் பிறந்த தினம்");
                        arrayList.add("1971 - இந்தியாவில் பொதுக்காப்பீடு  அரசு உடைமை ஆக்கப்பட்ட தினம் இன்று.");
                        arrayList.add("1846 - அமெரிக்கா மெக்சிகோ மீது போர் பிரகடனம் செய்த தினம் இன்று");
                        break;
                    case 14:
                        arrayList.add("1811 - பராகுவே, ஸ்பெயினிடம் இருந்து விடுதலை பெற்றது");
                        arrayList.add("1796 - பெரியம்மை நோய்க்கான தடுப்பூசியை எட்வர்ட் ஜென்னர் அறிமுகம் செய்தார்");
                        arrayList.add("1963 - குவைத் ஐநாவில் இணைந்தது");
                        arrayList.add("1889 - குழந்தைகள் சேவை நிறுவனமான என்எஸ்பிசிசி லண்டனில் துவங்கப்பட்டது");
                        arrayList.add("1948 - பாலஸ்தீனத்தில் இருந்து பிரிட்டிஷ் படைகள் வாபஸ் ஆனதால் இஸ்ரேல் சுதந்திர நாடாக மாறிய தினம் இன்று.");
                        break;
                    case 15:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச குடும்ப தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - மெக்சிகோ மற்றும் தென் கொரியாவில் ஆசிரியர் தினம்");
                        arrayList.add("1973 - இந்தியாவின் முதல் திரவ எரிபொருள் ராக்கெட் விண்ணில் செலுத்தப்பட்ட தினம் இன்று.");
                        arrayList.add("1982 - விண்வெளி வீரர்களுடன் சல்யூட் - 7 என்ற ரஷிய விண்கலம் விண்ணில் செலுத்தப்பட்ட தினம் இன்று.");
                        arrayList.add("1988 - சோவியத் படைகள் ஜெனீவா ஒப்பந்தப்படி ஆப்கானிஸ்த்தானில் இருந்து வெளியேறத் தொடங்கியது.");
                        break;
                    case 16:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - மலேசிய ஆசிரியர் தினம்");
                        arrayList.add("1667 - வாக்கிய பஞ்சாங்கம் முதன் முதலில் ராமலிங்க முனிவரால் யாழ்ப்பாணத்தில் வெளியிடப்பட்டது");
                        arrayList.add("1975 - பொதுமக்கள் வாக்கெடுப்பின் அடிப்படையில் சிக்கிம் இந்தியாவின் ஒரு மாநிலமாக இணைக்கப்பட்டது");
                        arrayList.add("2006 - தமிழகத்தில் அனைத்து ஜாதியினரும் கோயில் அர்ச்சகர் ஆகலாம் என்ற அறிவிப்பு வெளியிடப்பட்டது");
                        arrayList.add("1975 - இந்தியக் குடி அரசில் சிக்கிம் 22 ஆவது மாநிலமாக சேர்த்துக் கொள்ளப்பட்ட தினம் இன்று.");
                        break;
                    case 17:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக தொலைத்தகவல் தொடர்பு தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - நார்வே நாட்டின் அரசியல் நிர்ணய தினம்");
                        arrayList.add("1792 - நியூயார்க் பங்குச் சந்தை ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1886 - ஸ்பெயின் நாட்டு அரசரான பதின் மூன்றாம் அல்போன்சா பிறந்தார்");
                        arrayList.add("1939 - பிரிட்டிஷ் அரசர்களுள் முதன் முதலாகக் கனடாவுக்கு விஜயம் செய்தவர்  ஆறாம் ஜார்ஜ் மன்னர் . அவர் இந்த நாளில் தான் அங்கு சென்றார்.");
                        break;
                    case 18:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச அருங்காட்சியகங்கள் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச எய்ட்ஸ் நோய் எதிர்ப்பு மருந்து தினம்");
                        arrayList.add("1974 - சிரிக்கும் புத்தர் என பெயரிடப்பட்ட திட்டத்தில் இந்தியா, தனது முதல் அணுகுண்டை வெற்றிகரமாக மோதனை செய்தது");
                        arrayList.add("1994 - இந்தியாவில் முதன் முதலாக ராஜஸ்தான் பாலைவனத்தில் பொக்ரான் என்னுமிடத்தில் வெற்றிகரமாக அணு வெடிச் சோதனை நடத்தி இந்தியா சாதனை நிகழ்த்திய பொன்னான நாள்.");
                        arrayList.add("1860 - ஆபிரகாம் லிங்கன் முதன் முதலாக அமெரிக்க ஜனாதிபதியாக தேர்ந்தெடுக்கப்பட்ட தினம் இன்று.");
                        break;
                    case 19:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உக்ரைன் அறிவியல் தினம்");
                        arrayList.add("1904 - இந்திய நவீன தொழில்துறையின் முன்னோடி ஜாம்செட்ஜி டாடா இறந்த தினம்");
                        arrayList.add("1890 - வியட்நாம் தலைவர் ஹோ ஷி மின் பிறந்த தினம்");
                        arrayList.add("1971 - சோவியத் ஒன்றியம், மார்ஸ் 2 விண்கலத்தை ஏவியது");
                        arrayList.add("1971 - இந்தியாவின் முதல் நீர் மூழ்கிக் கப்பலான வீர் பாகு ( vir bahu ) , விசாகப்பட்டினத்தில் செயல்படத் தொடங்கிய தினம் இன்று.");
                        break;
                    case 20:
                        arrayList.add("1506 - அமெரிக்காவை கண்டு பிடித்த ஆய்வுப்  பயண வீரரான கொலம்பஸ் இறந்தார்");
                        arrayList.add("1999 - புளூடூத் வெளியிடப்பட்டது");
                        arrayList.add("1891 - தாமஸ் ஆல்வா எடிசன் தனது முதலாவது உடல் அசைவு ஒளிப்படக்கருவியைக் காட்சிப்படுத்தினார்");
                        arrayList.add("1570 - உலகின் முதலாவது நவீன அட்லசை ஆபிரகாம் ஓர்ட்டேலியஸ் வரைந்தார்");
                        arrayList.add("1983 - எய்ட்ஸ் நோயை உண்டாக்கும் வைரஸ்களை கண்டுபிடித்த செய்தி முதல் முறையாக வெளியிடப்பட்டன");
                        break;
                    case 21:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - இந்தியாவில் பயங்கரவாத எதிர்ப்பு தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சிலி கடற்படையினர் தினம்");
                        arrayList.add("1960 - தென்னிந்திய நடிகர் மோகன்லால் பிறந்த தினம்");
                        arrayList.add("1688 - ஆங்கிலக் கவிஞரான அலெக்சாண்டர்  போப் பிறந்தார்");
                        arrayList.add("1994 - உலக அழகியாக 18 வயது நிரம்பிய சுஸ்மிதா சென் என்ற  இந்திய அழகி தேர்தெடுக்கப்பட்டார் .");
                        break;
                    case 22:
                        arrayList.add("1972 - இலங்கை குடியரசு தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஏமன் தேசிய தினம்");
                        arrayList.add("1834 - இலங்கையில் சட்டசபையின் முதலாவது கூட்டம் கொழும்பில் இடம்பெற்றது");
                        arrayList.add("1855 - பிரஞ்சு எழுத்தாளர் விக்டர் ஹியூகோ மறைந்தார்");
                        arrayList.add("1990 - வட, தென் யேமன்கள்   இணைந்து புதிய ஏமன்  குடியரசு உருவானது");
                        break;
                    case 23:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச ஆமைகள் தினம்");
                        arrayList.add("1568 - நெதர்லாந்து ஸ்பெயினிடம் இருந்து விடுதலை அறிவித்தது");
                        arrayList.add("1995 - ஜாவா புரோக்ராமின் முதல் பதிவு வெளியிடப்பட்டது");
                        arrayList.add("1733 - ஹிப்னாடிச முறையைக் கண்டுபிடித்த  பிரடெரிக் ஆண்டன் மெஸ்மர் பிறந்தார். இவர் ஓர் ஜெர்மானிய டாக்டர் ஆவார் .");
                        arrayList.add("1994 - கம்போடியாவில் முதல் ஜனநாயகத்  தேர்தல் நடந்த தினம் இன்று");
                        break;
                    case 24:
                        arrayList.add("1819 - அமெரிக்க அரசி விக்டோரியா மகாராணி பிறந்த தினம்");
                        arrayList.add("1543 - வானியலாளர் நிக்கோலஸ் கோப்பர்னிக்கஸ் இறந்த தினம்");
                        arrayList.add("1883 - நியூயார்க்கில் புரூக்ளின் பாலம் திறந்து விடப்பட்டது");
                        arrayList.add("1956 - சுவிட்சர்லாந்தில் முதலாவது யூரோவிஷன் பாடல் போட்டி இடம்பெற்றது");
                        arrayList.add("1956 - பகவான் புத்தரின் 2500 ஆவது பிறந்த நாள் விழா கொண்டாடப்பட்டது");
                        break;
                    case 25:
                        arrayList.add("1993 - எத்தியோப்பியா விடுதலை நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அர்ஜென்டினாவில் மே புரட்சி தினம்");
                        arrayList.add("1963 - அடிஸ் அபாபாவில் ஆப்பிரிக்க ஒன்றியம் உருவானது");
                        arrayList.add("1911 - மெக்சிகோ நாட்டில் உள்நாட்டு போர் முண்டது இதனை சமாளிக்க முடியாமல் அந்நாட்டு அதிபர் போர்பிரியோ டயஸ்  தனது பதவியை  ராஜினாமா செய்த தினம் இன்று.");
                        arrayList.add("1611 - மொகலாய அரசர் ஜஹாங்கீர் , மெகருன்னிஷாவைத்  திருமணம் செய்து கொண்ட தினம் இன்று.இவள் தான் பிற்காலத்தில் நூர்ஜஹான்  என்று அழைக்கப்பட்டாள் .");
                        break;
                    case 26:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஆஸ்திரேலியாவின் தேசிய மன்னிப்பு தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - போலந்து அன்னையர் தினம்");
                        arrayList.add("1884 - கர்நாடக இசைக் கலைஞர் மகா வைத்தியநாத ஐயர் பிறந்த தினம்");
                        arrayList.add("1966 - பிரிட்டானிய கயானா விடுதலை அடைந்து கயானா எனப் பெயர் மாற்றம் பெற்றது");
                        arrayList.add("2002 - மார்ஸ் ஒடிசி விண்ணுர்தி செவ்வாய்க் கோளில் நீர் பனிப் படிவுகள் இருப்பதை அறிந்தது");
                        break;
                    case 27:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - நைஜீரியா சிறுவர் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பொலீவியா அன்னையர் தினம்");
                        arrayList.add("1910 - ஜெர்மனிய அறிவியலாளர் ராபர்ட் ஹூக் இறந்த தினம்");
                        arrayList.add("1703 - ரஷ்யசார் மன்னர் முதலாம் பீட்டர், புனித பீட்டர்ஸ்பெர்க் நகரை அமைத்தான்");
                        arrayList.add("1564 - பிரஞ்சு நாட்டு மதச் சீர்திருத்தவாதியான ஜான்கால் இறந்தார்.");
                        break;
                    case 28:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பிலிபைன்ஸ் தேசிய கொடி நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அசர்பைஜான், ஆர்மீனியா குடியரசு தினம்");
                        arrayList.add("1923 - இந்திய நடிகர் மற்றும் அரசியல்வாதி என்.டி.ராமாராவ் பிறந்த தினம்");
                        arrayList.add("1986 - திருமணமாகாத பெண் ஊழியர்களுக்கும் கருணையின் அடிப்படையில் மத்திய அரசு பிள்ளைப்பேறு விடுமுறையை அனுமதிக்க ஆரம்பித்தது.");
                        arrayList.add("1883 - இந்து மகாசபையை நிறுவிய சுதந்திரப் போராட்ட வீரரான  வீரசாவர்க்கர்  பிறந்தார்.");
                        break;
                    case 29:
                        arrayList.add("1999 - நைஜீரியா மக்களாட்சி தினம்");
                        arrayList.add("1947 - இந்திய தரக்கட்டுப்பாடு நிறுவனம் அமைக்கப்பட்டது");
                        arrayList.add("1790 - ரோட் தீவு, அமெரிக்காவின் 13வது மாநிலமாக ஏற்றுக் கொள்ளப்பட்டது");
                        arrayList.add("1917 - அமெரிக்க நாட்டு ஜனாதிபதிகளுள் ஒருவரான ஜான் எப் கென்னடி பிறந்தார்.");
                        arrayList.add("1736 - அமெரிக்க நாட்டு இராஜதந்திரிகளுள் ஒருவரான பாட்ரிக்  ஹென்றி பிறந்தார்.");
                        break;
                    case 30:
                        arrayList.add("1987 - கோவா தனி மாநிலமாகியது");
                        arrayList.add("1635 - பிராக் அமைதி உடன்பாடு எட்டப்பட்டது");
                        arrayList.add("1845 - திரினிடாட் டொபாகோவிற்கு முதல் தொகுதி இந்தியர்கள் வந்திறங்கினர்");
                        arrayList.add("1919 - ஜாலியன் வாலா பாக் கொலையைக் கண்டிக்கும் விதத்தில் பிரிட்டிஷ் அரசு தந்த சர் பட்டத்தைக் கவியரசர் தாகூர் திரும்பக் கொடுத்தார்.");
                        arrayList.add("1982 - பாலஸ்தீன விடுதலை இயக்கத்தை சேர்ந்த தலைவர் யாசர் அராபத் , பெய்ரூட்டை விட்டு வெளியேறிய தினம் இன்று.");
                        break;
                    case 31:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச புகையிலை எதிர்ப்பு தினம்");
                        arrayList.add("1911 - தமிழக ஓவியர் கே.சி.எஸ்.பணிக்கர் பிறந்த தினம்");
                        arrayList.add("1987 - திரைப்பட இயக்குனர் ஜான் ஆபிரகாம் இறந்த தினம்");
                        arrayList.add("1819 - அமெரிக்க கவிஞரான வால்ட் விட்மன் பிறந்தார்");
                        arrayList.add("1875 - போப்பாண்டவர்களுள் ஒருவரான பதினொன்றாவது பயஸ் எஸ்பவர் இத்தாலி நாட்டில் , ஏழை விவசாயியின் மகனாகப் பிறந்த தினம் இன்று.");
                        break;
                }
                break;
            case 5:
                switch (i2) {
                    case 1:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச குழந்தைகள் தினம்");
                        arrayList.add("1962 - சமோவா விடுதலை நாள்");
                        arrayList.add("1996 - இந்தியாவின் 6வது ஜனாதிபதி நீலம் சஞ்சீவ் ரெட்டி இறந்த தினம்");
                        arrayList.add("1987 - லெபனான் பிரதமர் ரஷித்  கராமி ( Rashid karami)  ஹெலிகாப்ட்டர்  விபத்தில் கொல்லப்பட்டார்.");
                        arrayList.add("1964 - நயா  பைசா வை 'பைசா' என்று இந்தியாவில் மாற்றப்பட்ட தினம் இன்று.");
                        break;
                    case 2:
                        arrayList.add("1999 - பூட்டானில் தொலைக்காட்சி முதல் முறையாக அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("1953 - இரண்டாம் எலிசபெத், இங்கிலாந்து அரசியாக முடிசூட்டிய விழா முதல் முறையாக தொலைக்காட்சியில் நேரடியாக ஒளிபரப்பப்பட்டது");
                        arrayList.add("1882 - நவீன இத்தாலியை உருவாக்கிய கரிபால்டி இறந்த தினம்");
                        arrayList.add("1840 - ஆங்கில நாவலாசிரியரான தாமஸ் ஹார்டி பிறந்தார்.");
                        arrayList.add("1990 - அமெரிக்க அதிபர் ஜார்ஜ்  புஷ்ஷும் , சோவியத் அதிபர் கோர்பசேவும்  இரு நாடுகளுக்கும்  இடையேயான 'பனிப்போரை' முடிவுக்குக் கொண்டு வந்த தினம் இன்று.");
                        break;
                    case 3:
                        arrayList.add("1924 - தமிழக முதல்வர் கருணாநிதி பிறந்த தினம்");
                        arrayList.add("1966 - பாகிஸ்தான் முன்னாள் கிரிக்கெட் வீரர் வாசிம் அக்ரம் பிறந்த தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சிங்கப்பூர் சுகந்திரம் அடைந்த தினம் இன்று");
                        arrayList.add("1915 - கவியரசர் தாகூருக்கு பிரிட்டிஷ் அரசு 'ஸர்' பட்டத்தை வழங்கியது.");
                        arrayList.add("1972 - பம்பாயில் கட்டப்பட்ட இந்தியாவின் முதல் நவீன போர்க் கப்பலான நீல்கிரி ( Nilgiri) பிரதமர் இந்திராகாந்தியால் மிதக்கவிடப்பட்ட தினம் இன்று.");
                        break;
                    case 4:
                        arrayList.add("1959 - இந்திய தொழிலதிபர் அனில் அம்பானி பிறந்த தினம்");
                        arrayList.add("1946 - இந்திய திரைப்பட பின்னணி பாடகர் எஸ்.பி.பாலசுப்ரமணியம் பிறந்த தினம்");
                        arrayList.add("1973 - ஏ.டி.எம் இயந்திரத்திற்கான காப்புரிமத்தை டொன் வெட்சல்,டொம் பார்ன்ஸ்,ஜார்ஜ் சாஸ்டெயின் ஆகியோர் பெற்றனர்");
                        arrayList.add("1944 - இரண்டாம் உலகப்போரில் ரோம் நேசப்படைகளிடம் தோல்வி   கண்டு சிக்கிய தினம் இன்று.");
                        arrayList.add("1738 - கிரேட் பிரிட்டனின் மூன்றாம் ஜார்ஜ் மன்னர் பிறந்தார்.");
                        break;
                    case 5:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக சுற்றுச்சூழல் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - டென்மார்க் அரசியல் நிர்ணய தினம்");
                        arrayList.add("1977 - முதலாவது தனிக்கணிணி ஆப்பிள் 2 விற்பனைக்கு விடப்பட்டது");
                        arrayList.add("1975 - சூயஸ் கால்வாய் மூடப்பட்டு , எட்டு ஆண்டுகள் கழித்து பின்பு மீண்டும் திறக்கப்பட்ட தினம் இன்று.");
                        arrayList.add("1984 - பொற்கோவிலில்  எடுக்கப்பட்ட புளு ஸ்டார் நடவடிக்கையில் , கோவிலுக்குள் புகுந்த இந்திய இராணுவத்தினரால் பிந்திரன் வாலே என்பவரும், 325 க்கும் மேற்பட்டோரும் கொல்லப்பட்ட தினம் இன்று.");
                        break;
                    case 6:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சுவீடன் தேசிய தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - தென் கொரியா நினைவு தினம்");
                        arrayList.add("1986 - தென்னிந்திய நடிகை பாவனா பிறந்த தினம்");
                        arrayList.add("1990 - பத்தாண்டுக்கு ஒரு முறை பாஸ்போர்ட்டை புதுப்பித்துக் கொண்டால் போதும் என மத்திய அரசு அறிவித்த தினம் இன்று .");
                        arrayList.add("1868 - வட துருவத்தை ஆராய்ந்த ராபர்ட் பால்கன் ஸ்காட் என்பவர் பிறந்தார்.");
                        break;
                    case 7:
                        arrayList.add("1974 - இந்திய டென்னிஸ் வீரர் மகேஷ் பூபதி பிறந்த தினம்");
                        arrayList.add("1863 - மெக்சிகோ நகரம் பிரெஞ்ச் படையினரால் கைப்பற்றப்பட்டது");
                        arrayList.add("1975 - சோனி நிறுவனம் பீட்டாமேக்ஸ் வீடியோகேசட் ரெக்கார்டரை சந்தையில் அறிமுகம் செய்தது");
                        arrayList.add("1923 - முதன் முதலாக பஸிபிக் பெருங்கடலை மனிதன் பறந்து கடந்த தினம் இன்று. 'சதர்ன் கிராஸ்' என்னும் தங்கள் விமானத்தில் சார்லஸ் கிங்க்ஸ்போர்டு ஸ்மித் என்பவரும் கேப்டன் உளம் என்பவரும் பஸிபிக் பெருங்கடலைக் கடந்து ஆஸ்திரேலியாவில்  உள்ள பிரிஸ்பேன் என்னுமிடத்தில் வெற்றிகரமாக இன்று தான்  அடைந்தார்கள்.");
                        arrayList.add("கி. பி. 632 - இஸ்லாம் மதத்தை தோற்றுவித்த முகமது இறந்தார்.");
                        break;
                    case 8:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச கடல் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச மூளை கட்டி தினம்");
                        arrayList.add("1995 - படிவ நிரலாக்க மொழி பிஹச்பி வெளியிடப்பட்டது");
                        arrayList.add("1772 - ஸ்காட்டிஷ் நாட்டு புகழ் பெற்ற இன்ஜினியரான ராபர்ட் ஸ்டீவென்சன் பிறந்தார்");
                        arrayList.add("1948 - ஏர் - இந்தியா நிறுவனம் ,தனது  முதல் சர்வ  தேச சேவையை , இந்தியாவுக்கும் இங்கிலாந்துக்கும் இடையே ஆரம்பித்த தினம் இன்று.");
                        break;
                    case 9:
                        arrayList.add("1945 - இந்தியாவின் முதல் பெண் போலீஸ் அதிகாரி கிரண் பேடி பிறந்த தினம்");
                        arrayList.add("1930 - இந்திய திரைப்பட இயக்குனர் கே.பாலச்சந்தர் பிறந்த தினம்");
                        arrayList.add("1934 - வால்ட் டிஸ்னியின் டொனால்ட் டக் வரைகதை வெளி வந்தது");
                        arrayList.add("1781 - இரயில்வே  போக்குவரத்தை நிறுவிய இங்கிலாந்து நாட்டுக் கண்டுபிடிப்பாளரான ஜார்ஜ் ஸ்டீபன் பிறந்தார். இவர் உருவாக்கிய முதல் புகை வண்டியின் பெயர் , இராக்ஜெட் என்பதாகும்.");
                        arrayList.add("1870 - ஆங்கில இலக்கிய மேதையான சார்லஸ் பிக்கன்ஸ் இறந்தார்");
                        break;
                    case 10:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - போர்ச்சுக்கல் தேசிய தினம்");
                        arrayList.add("1925 - தமிழக நூலகத்துறையின் முன்னோடி வே.தில்லைநாயகம் பிறந்த தினம்");
                        arrayList.add("1846 - கலிஃபோர்னியா குடியரசு மெக்சிகோவிலிருந்து விடுதலையை அறிவித்தது");
                        arrayList.add("1801 - சிவகங்கையின் சின்னமருது தனது சுதந்திரப் பிரகடனத்தை திருச்சியில் வெளியிட்டார்");
                        arrayList.add("1829 - இங்கிலாந்தில் உள்ள தேம்ஸ்  நதியில்  முதல் படகுப் போட்டி நடந்த தினம் இன்று. இங்கிலாந்தின் ஆக்ஸ்போர்ட் , கேம்ப்ரிட்ஜ்  பல்கலைக் கழகங்களுக்கு இடையே ஆண்டுதோறும் நடக்கும் போட்டி இது.");
                        break;
                    case 11:
                        arrayList.add("1947 - இந்திய அரசியல்வாதி லாலு பிரசாத் யாதவ் பிறந்த தினம்");
                        arrayList.add("1901 - நியூசிலாந்து, குக் தீவுகளை தன்னுடன் இணைத்துக் கொண்டது");
                        arrayList.add("2002 - அன்டோனியோ மெயூச்சி, தொலைபேசியை முதன் முதலில் கண்டுபிடித்தவர் என அமெரிக்க காங்கிரசினால் அறிவிக்கப்பட்டார்");
                        arrayList.add("2004 - நாசாவின் கசீனி-ஹியூ‌ஜென்ஸ் விண்ணுளவி சனிக் கோளின் ஃபீபி துணைக்கோளை நெருங்கிச் சென்றது");
                        arrayList.add("1964 - நேருவின் அஸ்தி இந்தியா முழுவதும் தூவப்பட்ட தினம் இன்று.");
                        break;
                    case 12:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச குழந்தை தொழிலாளர் ஒழிப்பு தினம்");
                        arrayList.add("1990 - ரஷ்யாவின் ரஷ்ய தினம்");
                        arrayList.add("1924 - அமெரிக்காவின் 41வது அதிபர் ஜார்ஜ் டபிள்யூ புஷ் பிறந்த தினம்");
                        arrayList.add("1990 - இந்தியத் தகவல் தொடர்புச் செயர்க்கைகோளான இன்ஸ்டாட் -1 டி ( Insat - 1 D)  ப்ளோரிடாவில் உள்ள கென்னடி விண்வெளித்  தடத்தில் இருந்து  ஏவப்பட்ட தினம் இன்று.");
                        arrayList.add("1987 - இங்கிலாந்தில் மூன்றாவது முறையாக நடந்த தேர்தலில் வெற்றி பெற்று திருமதி . மார்கரெட் தாட்சர்    சாதனை படைத்தார்");
                        break;
                    case 13:
                        arrayList.add("1955 - சோவியத் ஒன்றியத்தில் முதலாவது வைரச் சுரங்கம் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1948 - மலாயா தொழிற்சங்கங்களின் சம்மேளனம் மலேசியாவில் தடை செய்யப்பட்டது");
                        arrayList.add("1934 - ஹிட்லரும் முசோலினியும் வெனிசில் சந்தித்தனர்");
                        arrayList.add("1943 - சுதந்திரப் போராட்ட வீரரான சுபாஷ் சந்திர போஸ் நீர்மூழ்கிக் கப்பல் மூலம் ஜெர்மனியில் இருந்து டோக்கியோ ( ஜப்பானுக்கு) வுக்கு வந்து சேர்ந்த தினம் இன்று.");
                        arrayList.add("1944 - வி - 1 எனப்படும் பறக்கும் குண்டு முதன் முதலாக , இரண்டாம் உலகப் போரில் , லண்டனில் விழுந்த தினம் இன்று.");
                        break;
                    case 14:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக வலைப்பதிவர் நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக ரத்த வழங்கல் தினம்");
                        arrayList.add("1872 - கனடாவில் தொழிற் சங்கங்கள் அதிகாரபூர்வமாக்கப்பட்டன");
                        arrayList.add("1909 - இந்தியாவில் முதல் கம்யூனிஸ்ட் கட்சியின் முதல் மந்திரியான எ. எம். ஸ். நம்பூதிரிபாட் கேரளாவில் உள்ள பாலக்காட்டில் இன்று  பிறந்தார்.");
                        arrayList.add("1860 - இந்தியாவில் முதல் ரசீது தபால் தலைகள் ( Receipt ) வெளியிடப்பட்ட தினம் இன்று");
                        break;
                    case 15:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - டென்மார்க் கொடி நாள்");
                        arrayList.add("1948 - ராஜா சர் அண்ணாமலை செட்டியார் இறந்த தினம்");
                        arrayList.add("1938 - பிரிட்டானியாவில் லாஸ்கோ பைரோ, குமிழ் முனைப் பேனாக்களை கண்டுபிடித்தார்");
                        arrayList.add("1843 - எட்வர்ட் கிரெய்க் என்னும் நார்வே நாட்டு இசையமைப்பாளர் பிறந்தார்.");
                        arrayList.add("1908 - கல்கத்தா ஸ்டாக் எக்சேஞ் ( stock exchange)  திறக்கப்பட்ட தினம் இன்று.");
                        break;
                    case 16:
                        arrayList.add("1911 - இந்திய விடுதலைப் போராட்ட வீரர் வாஞ்சிநாதன் இறந்த தினம்");
                        arrayList.add("1976 - தென்னாப்பிரிக்க இளைஞர் தினம்");
                        arrayList.add("1897 - ஹவாய்க் குடியரசை அமெரிக்காவுடன் இணைக்கும் உடன்பாடு எட்டப்பட்டது");
                        arrayList.add("1991 - இந்திய ரிசர்வ் வங்கி, வெளிநாட்டுக் கரன்சிகளை டெபொசிட் பண்ணும் திட்டத்தை அறிவித்த தினம் இன்று.");
                        arrayList.add("1977 - லியோனிட் பிரஷ்னேவ் , சோவியத் யூனியன் அதிபராகத் தேர்வு செய்யப்பட்ட  தினம் இன்று.");
                        break;
                    case 17:
                        arrayList.add("1236 - முதலாம் எட்வர்ட் அரசர் ( இங்கிலாந்தில் ) பிறந்தார்");
                        arrayList.add("1944 - ஐஸ்லாந்து தேசிய தினம்");
                        arrayList.add("1980 - அமெரிக்க டென்னிஸ் வீராங்கனை வீனஸ் வில்லியம்ஸ் பிறந்த தினம்");
                        arrayList.add("1885 - விடுதலை சிலை, நியூயார்க் துறைமுகத்தை வந்தடைந்தது");
                        arrayList.add("1950 - முதல் சிறுநீரக அறுவை சிகிச்சையை 55 வயதான டாக்டர் ஹெச். லாலெர் அமெரிக்காவின் சிகாகோவில் உள்ள 'லிட்டில் கம்பனி ஆப் மேரி  ஹாஸ்பிடலில்' வெற்றிகரமாய் நடத்திய  தினம் இன்று.");
                        break;
                    case 18:
                        arrayList.add("1870 - இந்தியாவின் முதல் கோர்ட் தபால் தலைகள் வெளியிடப்பட்ட தினம் இன்று.");
                        arrayList.add("1869 - இந்திய ரூபாய் அதன் வெள்ளியில் குறிக்கப்பட்ட துணை அலகுகளுடன் இலங்கையின் சட்டப்படியான நாணயமாக அறிவிக்கப்பட்டது");
                        arrayList.add("2006 - கசகிஸ்தான், கஸ்சாட் என்ற தனது முதலாவது செய்மதியை அனுப்பியது");
                        arrayList.add("1981 - சான் பிரான்சிஸ்கோ மருத்துவ ஆய்வாளர்கள் எயிட்ஸ் நோயை முறைபடியாகக் கண்டுபிடித்தனர்");
                        arrayList.add("1936 - புகழ்பெற்ற எழுத்தாளரும், சிந்தனையாளருமான மாக்ஸிம் கார்க்கி  இறந்தார்.");
                        break;
                    case 19:
                        arrayList.add("1945 - மியான்மர் ஜனநாயக கட்சி தலைவி ஆங் சாங் சூகி பிறந்த தினம்");
                        arrayList.add("1910 - வாஷிங்டனில் முதல் முறையாக தந்தையர் தினம் கொண்டாடப்பட்டது");
                        arrayList.add("1961 - குவெய்த், ஐக்கிய ராஜ்ஜியத்திடம் இருந்து விடுதலையை அறிவித்தது");
                        arrayList.add("1947 - இந்திய எழுத்தாளர் சல்மான் ருஷ்டி பிறந்த தினம்");
                        arrayList.add("1990 - இ. பி. ஆர். எல். எப் பொதுச் செயலாளர் உட்பட பதின்மூன்று பேர், விடுதலைப் புலிகளால் சென்னையில் படுகொலை செய்யப்பட தினம் இன்று.");
                        break;
                    case 20:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச தந்தையர் தினம்.");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச அகதிகள் தினம்");
                        arrayList.add("2006 - தமிழகக் கவிஞர் சுரதா இறந்த தினம்");
                        arrayList.add("1990 - யூரேக்கா என்ற சிறுகோள் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1991 - ஜெர்மனியின் தலைநகர் பொன் நகரில் இருந்து பெர்லினுக்கு மீண்டும் மாற்ற பாராளுமன்றத்தில் முடிவு செய்யப்பட்டது");
                        break;
                    case 21:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச மனிதநேய தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - கிரீன்லாந்து தேசிய தினம்");
                        arrayList.add("1953 - பாகிஸ்தான் முன்னாள் பிரதமர் பெனாசிர் பூட்டோ பிறந்த தினம்");
                        arrayList.add("1991 - இந்தியாவின் பத்தாவது பிரதமராய் நரசிம்மராவ் பதவி ஏற்றார்.");
                        arrayList.add("1990 - ஈரானில் இன்று  ஏற்பட்ட பூகம்பத்தில் 40,000 பேர் மேல்  இறந்தனர்.");
                        break;
                    case 22:
                        arrayList.add("1527 - இத்தாலியச் சிந்தனையாளரும்  , அரசியல்வாதியுமான மாக்கியவ்லலி இறந்தார் .");
                        arrayList.add("1906 - ஸ்வீடன் தேசிய கொடி பெறப்பட்டது");
                        arrayList.add("1974 - தென்னிந்திய திரைப்பட நடிகர் விஜய் பிறந்த தினம்");
                        arrayList.add("1976 - கனடாவில் மரண தண்டனை வழங்குவது நிறுத்தப்பட்டது");
                        arrayList.add("1825 - பிரிட்டானிய நாடாளுமன்றம் நிலமானிய முறையை நீக்கியது");
                        break;
                    case 23:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஐக்கிய ராஜ்யத்தில் சர்வதேச சமூக சேவை தினம்");
                        arrayList.add("1894 - பன்னாட்டு ஒலிம்பிக் அமைப்பு பாரிசில் அமைக்கப்பட்டது");
                        arrayList.add("1980 - இந்திய அரசியல்வாதி சஞ்சய் காந்தி இறந்த தினம்");
                        arrayList.add("1894 - இங்கிலாந்தின் எட்டாம் எட்வர்ட் அரசர் வின்ட்ஸர் கோமகன் பிறந்தார்");
                        arrayList.add("1985 - ஏர் - இந்தியா விமானம் ( போயிங் - 747) டோரோண்டோவில் இருந்து பம்பாய்க்கு வருகையில் நொறிங்கிவிட அட்லாண்டிக் பெருங்கடலில் விழுந்து 329 பேர் இறந்த அந்த சோக சம்பவம் நடந்த தினம் இன்று.");
                        break;
                    case 24:
                        arrayList.add("1509 - இங்கிலாந்தின் அரசனான எட்டாம் ஹென்றி அரசரானது இன்று தான்.");
                        arrayList.add("1571 - மணிலா நகரம் அமைக்கப்பட்டது");
                        arrayList.add("2004 - நியூயார்க்கில் மரண தண்டனை சட்டபூர்வமற்றதாக ஆக்கப்பட்டது");
                        arrayList.add("1961 - இந்தியாவின் முதல் சூப்பர் சானிக் போர் விமானமான எச். எப். 24 விண்ணில் முதன் முதலாகப் பறக்கவிடப்பட்ட தினம் இன்று.");
                        arrayList.add("1976 - வட வியட்நாமும், தென் வியட்நாமும் இணைந்து சோசியலிசக் குடியரசாக ஒரே வியட்நாம் நாடாக உருவானது இன்று தான் .");
                        break;
                    case 25:
                        arrayList.add("1975 - மொசாம்பிக் விடுதலை நாள்");
                        arrayList.add("2009 - பாப் இசை பாடகர் மைக்கேல் ஜாக்சன் இறந்த தினம்");
                        arrayList.add("1998 - வின்டோஸ் 98 முதல் பதிப்பு வெளியானது");
                        arrayList.add("1975 - பிரதமர் இந்திரா காந்தியின் பரிந்துரைப்படி , குடியரசுத் தலைவர் பக்ருதீன் அலி அகமது , இந்தியாவில் உள் நாட்டு அவசர நிலை சட்டத்தை பிரகடனம் செய்த தினம் இன்று.");
                        arrayList.add("1995 - உயிருள்ள ஒவ்வொரு மரபணுவிலும் பதினெட்டு இலட்சத்துக்கும் மேற்பட்ட டி. ஏன். ஏ  (D.N.A) ஆதாரங்கள் உள்ளன என்பதை அமெரிக்க விஞ்ஞானிகள் நீருபித்துக் காட்டிய தினம் இன்று.");
                        break;
                    case 26:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச ஆதரவு தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சோமாலிலாந்து விடுதலை நாள்");
                        arrayList.add("1976 - உலகின் மிக உயரமான கட்டிடமான கனடாவின் சி.என்., கோபுரம் பொதுமக்கள் பயன்பாட்டிற்காக திறக்கப்பட்டது");
                        arrayList.add("1824 - கம்பி இல்லாத தந்தியைக் கண்டுபிடித்தவரும், எலக்ட்ரானிக் துறை வளர்வதற்குக்  காரணமானவருமான பிரிட்டிஷ் பௌதிக விஞ்ஞானி லார்ட் கெல்வின் வில்லியம் தாம்சன் பிறந்தார்.");
                        arrayList.add("1950 - இந்திய அரசியல் சட்ட திட்டம் நடைமுறைக்கு ( முறைப்படி ) வந்த தினம் இன்று .");
                        break;
                    case 27:
                        arrayList.add("1967 - உலகின் முதலாவது ஏடிஎம் லண்டன் என்ஃபீல்டில் அமைக்கப்பட்டது");
                        arrayList.add("1998 - கோலாலம்பூர் சர்வதேச விமான நிலையம் திறக்கப்பட்டது");
                        arrayList.add("1358 - துப்ரோவ்னிக் குடியரசு அமைக்கப்பட்டது");
                        arrayList.add("1967 - இந்தியா சொந்தமாகத் தயாரித்த முதல் விமானமான எச். எஸ். 748 இந்தியன் ஏர்லைன்சில்  சேர்த்துக் கொள்ளப்பட்ட தினம் இன்று.");
                        arrayList.add("1846 - ஐரிஸ் நாட்டு அரசியல்வாதியும் சுதந்திரப்போராட்ட வீரரான சார்லஸ் பர்னெல் என்பவர் பிறந்தார்.");
                        break;
                    case 28:
                        arrayList.add("1922 - ஐரிய உள்நாட்டுப் போர் ஆரம்பமானது");
                        arrayList.add("1950 - வடகொரியா சியோலைக் கைப்பற்றியது");
                        arrayList.add("1967 - கிழக்கு ஜெருசலேமை இஸ்ரேல் தன்னுடன் இணைத்துக் கொண்டது");
                        arrayList.add("1703 - மெதடிசத்தை அறிமுகப்படுத்திய ஜான் வெஸ்லி பிறந்த தினம்");
                        arrayList.add("1767 - பீட்டர் பால் ரூபன்ஸ் என்னும் புகழ் பெற்ற பின்லாந்து நாட்டு ஓவியர் பிறந்தார்.");
                        break;
                    case 29:
                        arrayList.add("கிமு 323 - எகிப்து அரசனான மகா அலெக்ஸாண்டர் இறந்தார்");
                        arrayList.add("1534 - பிரின்ஸ் எட்வர்ட் தீவு, ஜான் கார்ட்டியர் என்பவரால் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1880 - பிரான்ஸ், டெஹீட்டி தீவைக் கைப்பற்றியது");
                        arrayList.add("2009 - மொழியியல் அறிஞர் வ.ஐ.சுப்பிரமணியம் இறந்த தினம்");
                        arrayList.add("1841 - ஆபிரிக்காவை ஆராய்ந்த ஆய்வுப் பயண வீரர்களுள் ஒருவரான சர். ஹென்றி மார்ட்டன் ஸ்டான்லி என்பவர் பிறந்தார்.");
                        break;
                    case 30:
                        arrayList.add("1960 - கொங்கோ விடுதலை நாள்");
                        arrayList.add("1972 - ஒருங்கிணைந்த சர்வதேச நேரத்தில் ஒரு லீப் வினாடி அதிகரிக்கப்பட்டது");
                        arrayList.add("1917 - இந்திய அரசியல்வாதி தாதாபாய் நவுரோஜி இறந்த தினம்");
                        arrayList.add("1905 - தொடர்பியல் தத்துவத்தை அறிமுகப்படுத்தும் ஐன்ஸ்டீனின் இயங்கும் பொருட்களின் மின்னியக்கவியல் ஆய்வுக் கட்டுரை வெளிவந்தது");
                        arrayList.add("1973 - அதிசய முழு சூரிய கிரகணம் ஏற்பட்ட நாள்");
                        break;
                }
                break;
            case 6:
                switch (i2) {
                    case 1:
                        arrayList.add("1960 - சோமாலியா விடுதலை நாள்");
                        arrayList.add("1962 - ருவாண்டா விடுதலை நாள்");
                        arrayList.add("2002 - சர்வதேச குற்றவியல் நீதிமன்றம் உருவாக்கப்பட்டது");
                        arrayList.add("1967 - ஐரோப்பிய சமூகம் உருவாக்கப்பட்டது");
                        arrayList.add("1979 - சோனி நிறுவனத்தின் வாக்மன் அறிமுகம் செய்யப்பட்டது");
                        break;
                    case 2:
                        arrayList.add("2004 - பாகிஸ்தான் ஆசியான் அமைப்பில் இணைந்தது");
                        arrayList.add("1962 - முதலாவது வோல் மார்ட் அங்காடி, ஆர்கன்சா மாநிலத்தில் திறக்கப்பட்டது");
                        arrayList.add("1698 - தாமஸ் சேவரி, முதல் நீராவிப் பொறிக்கான காப்புரிமம் பெற்றார்");
                        arrayList.add("1853 - ரஷ்யாவிற்கும் துருக்கிக்கும் இடையே கிரிமியர் போர் துவங்கியது");
                        arrayList.add("1823 - பிரேசிலில் போர்ச்சுகீசியர்களின் ஆட்சி முடிவுக்கு வந்தது");
                        break;
                    case 3:
                        arrayList.add("1944 - பெலரஸ் விடுதலை நாள்");
                        arrayList.add("1980 - இந்திய கிரிக்கெட்‌ வீரர் ஹர்பஜன் சிங் பிறந்த தினம்");
                        arrayList.add("1872 - யாழ்ப்பாணக் கல்லூரி ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1962 - பிரான்சுக்கு எதிரான அல்ஜீரிய விடுதலைப் போர் நிறைவு பெற்றது");
                        arrayList.add("1866 - புருசியாவின் வெற்றியுடன் ஆஸ்திரிய-புரூசியப் போர் முடிவுக்கு வந்தது");
                        break;
                    case 4:
                        arrayList.add("1776 - அமெரிக்க விடுதலை நாள்");
                        arrayList.add("1902 - இந்திய ஆன்மிகவாதி சுவாமி விவேகானந்தர் பிறந்த இறந்த தினம்");
                        arrayList.add("1865 - ஆலிஸின் அற்புத உலகம் வெளியிடப்பட்டது");
                        arrayList.add("2006 - டிஸ்கவரி விண்ணோடம் விண்ணுக்கு ஏவப்பட்டது");
                        arrayList.add("1634 - நியூ பிரான்சில் ட்ரோய்-ரிவியேரெஸ் நகரம் உருவாக்கப்பட்டு, பின்னர் கியூபெக் நகரமானது");
                        break;
                    case 5:
                        arrayList.add("1962 - அல்ஜிரியா விடுதலை நாள்");
                        arrayList.add("1811 - வெனிசுவேலா விடுதலை நாள்");
                        arrayList.add("1996 - குளோனிங் முறையில் முதலாவது பாலூட்டியான டோலி உருவாக்கப்பட்டது");
                        arrayList.add("1865 - சால்வேஷன் ராணுவம் இங்கிலாந்தில் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1687 - ஐசக் நியூட்டன் தனது புகழ்பெற்ற பிரின்சிப்பியா மாத்தமாட்டிக்கா நூலை வெளியிட்டார்");
                        break;
                    case 6:
                        arrayList.add("1964 - மலாவி விடுதலை தினம்");
                        arrayList.add("1966 - மலாவி குடியரசு தினம்");
                        arrayList.add("1946 - அமெரிக்காவின் 43வது அதிபர் ஜார்ஜ் டபிள்யூ புஷ் பிறந்த தினம்");
                        arrayList.add("1560 - ஸ்காட்லாந்திற்கும் இங்கிலாந்திற்கும் இடையே எடின்பரோ ஒப்பந்தம் ஏற்படுத்தப்பட்டது");
                        arrayList.add("1956 - சிங்களம், இலங்கையின் அதிகாரபூர்வ மொழியானது");
                        break;
                    case 7:
                        arrayList.add("1978 - சாலமன் தீவுகள் விடுதலை நாள்");
                        arrayList.add("1896 - இந்தியாவில் முதல் முறையாக பம்பாயில் திரைப்படம் அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("1967 - பயாபிராவில் உள்நாட்டுப் போர் ஆரம்பமானது");
                        arrayList.add("2007 - புதிய ஏழு உலக அதிசயங்கள் பட்டியலில் இந்தியாவின் தாஜ்மஹால் 7 உலக அதிசயங்களில் ஒன்றாகத் தேர்ந்தெடுக்கப்பட்டது");
                        arrayList.add("2014 - சிகரெட்டுக்கு, 50 சதவீத மதிப்பு கூடுதல் வரி விதிக்கும்படி, அனைத்து மாநில அரசு களையும், மத்திய சுகாதார அமைச்சர் வற்புறுத்தி உள்ளார்.");
                        break;
                    case 8:
                        arrayList.add("1497 - வாஸ்கோ ட காமா, இந்தியாவுக்கான முதல் நேரடிப் பயணத்தை துவங்கினார்");
                        arrayList.add("1889 - வால் ஸ்ட்ரீட் ஜேர்னல், முதலாவது இதழ் வெளியானது");
                        arrayList.add("1972 - இந்தியாவின் முன்னாள் கிரிக்கெட் வீரர் சவுரவ் கங்குலி பிறந்த தினம்");
                        arrayList.add("2006 - ம.பொ.சி., புலவர் குழந்தை ஆகியோரின் நூல்கள் நாட்டுடமை ஆக்கப்பட்டன");
                        arrayList.add("2007 - இந்தியாவின் 11வது பிரதமர் சந்திரசேகர் இறந்த தினம்");
                        break;
                    case 9:
                        arrayList.add("1816 - அர்ஜண்டினா விடுதலை நாள்");
                        arrayList.add("1930 - தமிழ் திரைப்பட இயக்குனர் கே.பாலச்சந்தர் பிறந்த தினம்");
                        arrayList.add("1991 - 30 ஆண்டுகளுக்கு பிறகு தென்னாப்பிரிக்கா மீண்டும் ஒலிம்பிக் விளையாட்டுக்களில் சேர்த்துக் கொள்ளப்பட்டது");
                        arrayList.add("2002 - ஆப்பிரிக்க ஒன்றியம், அடிஸ் அபாபாவில் அமைக்கப்பட்டது");
                        arrayList.add("1903 - யாழ்ப்பாணத்தில் இந்து வாலிபர் அமைப்பு உருவாக்கப்பட்டது");
                        break;
                    case 10:
                        arrayList.add("1973 - பஹாமாஸ் விடுதலை நாள்");
                        arrayList.add("1949 - இந்தியாவின் முன்னாள் கிரிக்கெட் வீரர் சுனில் கவாஸ்கர் பிறந்த தினம்");
                        arrayList.add("1925 - சோவியத் ஒன்றியத்தின் செய்தி நிறுவனம் டாஸ் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1800 - உருது,இந்தி மற்றும் உள்ளூர் மொழிகளை ஊக்கப்படுத்துவதற்காக கல்கத்தாவில் போர்ட் வில்லியம் கல்லூரி ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1890 - வயோமிங், அமெரிக்காவின் 44வது மாநிலமாக சேர்க்கப்பட்டது");
                        break;
                    case 11:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச மக்கள்தொகை தினம்");
                        arrayList.add("1920 - தமிழக அரசியல் தலைவர் வி.ஆர்.நெடுஞ்செழியன் பிறந்த தினம்");
                        arrayList.add("1921 - மங்கோலியா சீனாவிடம் இருந்து விடுதலை பெற்றது");
                        arrayList.add("1859 - இரு நகரங்களின் கதை என்ற நாவலை சார்லஸ் டிக்கன்ஸ் வெளியிட்டார்");
                        arrayList.add("1893 - முதன் முதலாக ஜப்பானைச் சேர்ந்த கொக்கிச்சி மிக்கிமோட்டோ, செயற்கையாக முத்துக்களை வளர்க்கும் முறையொன்றை அறிமுகப்படுத்தினார்");
                        break;
                    case 12:
                        arrayList.add("கிமு 100 - ரோமானியத் தலைவன் ஜூலியஸ் சீசர் பிறந்த தினம்");
                        arrayList.add("1854 - ஒளிப்படச் சுருளைக் கண்டுபிடித்த ஜார்ஜ் ஈஸ்ட்மன் பிறந்த தினம்");
                        arrayList.add("1898 - செனான் தனிமம் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1932 - நார்வே, வடக்கு கிறீன்லாந்தை தன்னுடன் இணைத்துக் கொண்டது");
                        arrayList.add("1975 - சாவோ டொமோ மற்றும் பிரின்சிப்பி, போர்ச்சுகலிடம் இருந்து விடுதலை பெற்றது");
                        break;
                    case 13:
                        arrayList.add("1953 - தமிழ் திரைப்பட பாடலாசிரியர் கவிஞர் வைரமுத்து பிறந்த தினம்");
                        arrayList.add("1844 - இலங்கையில் காவல்துறை நீதிமன்றங்கள் அமைக்கப்பட்டன");
                        arrayList.add("1923 - லாஸ் ஏஞ்சல்சில் ஹாலிவுட்டின் மேல் உள்ள மலையில் ஹாலிவுட் குறியீடு அதிகாரபூர்வமாக எழுதப்பட்டது");
                        arrayList.add("2012 - கேரளாவில் ஓடும் நதிகள் மாசடையாமல் பாதுகாக்கவும், நீர் ஆதாரங்களை மேம்படுத்தவும், மணல் பாதுகாப்பு ஆகியவற்றிற்காக, நதிகள் பாதுகாப்பு என்ற புதிய சட்டம் இயற்ற கேரள அரசு முடிவு செய்துள்ளதாக, மாநில நீர்வளத்துறை அமைச்சர் பி.ஜே. ஜோசப் சட்டசபையில் தெரிவித்தார்.");
                        arrayList.add("1930 - முதலாவது உலகக் கோப்பை கால்பந்து போட்டிகள் உருகுவேயில் ஆரம்பமாயின");
                        break;
                    case 14:
                        arrayList.add("1789 - பிரான்ஸ்- பாஸ்டில் தினம்");
                        arrayList.add("1989 - பிரஞ்சு புரட்சியின் 200வது ஆண்டு நிறைவை பிரான்ஸ் கொண்டாடியது");
                        arrayList.add("1967 - நாசாவின் சேர்வெயர் 4 ஆளில்லா விண்கலம் ஏவப்பட்டது");
                        arrayList.add("1933 - ஜெர்மனியில் நாசிக் கட்சியை தவிர்த்து அனைத்து அரசியல் கட்சிகளும் தடை செய்யப்பட்டன");
                        arrayList.add("2013 - ஐ.நா.,: பெண் சுதந்திரம் ,பெண் கல்விக்காக போராடும் இளம் பெண்களை ஊக்கு விக்கும் ‌வகையி்ல் இந்தாண்டு முதல் வழங்கப்பட உள்ள ஐ.நா., மாலாலா இளைஞர் விருதுக்கு இந்திய பெணகள் உட்பட உலகம் முழுவதும் இருந்து ஏழு பேர் தேர்ந்தெடுக்கப்பட்டுள்ளனர்");
                        break;
                    case 15:
                        arrayList.add("1903 - தமிழகத்தின் முன்னாள் முதல்வர் கே.காமராஜ் பிறந்த தினம்");
                        arrayList.add("1876 - தனித்தமிழ் இயக்கத்தை ஆரம்பித்த மறைமலை அடிகள் பிறந்த தினம்");
                        arrayList.add("1870 - புரூசியாவும், இரண்டாம் பிரஞ்சு பேரரசும் தம்மிடையே போர‌ை துவக்கின");
                        arrayList.add("2012 - ஏற்கனவே 6 மாதம் காலம் விண்வெளியில் இருந்து வெற்றிகரமாக சாதித்த இந்திய வம்சாவளியை சேர்ந்த அமெரிக்கரான சுனிதா வில்லியம்ஸ் இன்று 2 வது முறையாக விண்வெளிக்கு புறப்பட்டு சென்றார்.");
                        arrayList.add("2011 - ஸ்ரீஹரிகோட்டா: இந்தியாவின் வளர்ச்சி பாதையில் ஒரு முன்னேற்றக்கல்லாக இன்று தொலைதொடர்பு துறைக்கு கூடுதல் பலன் தரவல்லத்தக்க ஜி.சாட் 12 செயற்கைகோள் மாலை 4. 48 மணிக்கு விண்ணில் வெற்றிகரமாக ஏவப்பட்டது. உரிய இலக்கை அடைந்த உறுதி கிடைத்தவுடன் விஞ்ஞானிகள் கரகோஷம் எழுப்பி மகிழ்ச்சியை பரிமாறிக்கொண்டனர்.");
                        break;
                    case 16:
                        arrayList.add("1968 - இந்திய ஹாக்கி வீரர் தன்ராஜ் பிள்ளை பிறந்த தினம்");
                        arrayList.add("1984 - இந்திய திரைப்பட நடிகை கத்ரீனா கைஃப் பிறந்த தினம்");
                        arrayList.add("1930 - எத்யோப்பியாவின் முதலாவது அரசியலமைப்பை வெளியிடப்பட்டது");
                        arrayList.add("2004 - மிலேனியம் பூங்கா சிகாகோவில் அமைக்கப்பட்டது");
                        arrayList.add("2012 - அமர்நாத் பனிலிங்க தரிசன யாத்திரை துவங்கிய முதல் 17 நாட்களில், 67 யாத்ரீகர்கள் மரணம் அடைந்ததற்கு, உச்சநீதிமன்றம் கடும் கண்டனம் தெரிவித்துள்ளது. யாத்ரீகர்களுக்கு முறையான மருத்துவ வசதி மற்றும் இதர வசதிகளை செய்து கொடுக்காதது ஏன் என கேள்வி எழுப்பி, மத்திய அரசு, ஜம்மு - காஷ்மீர் மாநில அரசு மற்றும் அமர்நாத் குகை கோவில் வாரியம் ஆகியவற்றுக்கு நோட்டீஸ் அனுப்ப உத்தரவிட்டுள்ளது.");
                        break;
                    case 17:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - தென்கொரியா அரசியலமைப்பு தினம்");
                        arrayList.add("1941 - இந்திய திரைப்பட இயக்குனர் பாரதிராஜா பிறந்த தினம்");
                        arrayList.add("1841 - முதலாவது பஞ்ச் இதழ் லண்டனில் வெளியிடப்பட்டது");
                        arrayList.add("1976 - கிழக்கு தீமோர், இந்தோனேஷியாவுட‌ன் இணைக்கப்பட்டது");
                        arrayList.add("2014 - அதிபயங்கர, நவீன ஆயுதங்களை கொண்டு, ஆப்கானிஸ்தான் தலைநகர் காபூலில் உள்ள விமான நிலையத்தை பயங்கரவாதிகள் தாக்கி உள்ளனர். இந்த தாக்குதலில் தலிபான் பயங்கரவாதிகள் ஈடுபட்டுள்ளனர் என்பது குறிப்பிடத்தக்கது.");
                        break;
                    case 18:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - நெல்சல் மண்டேலா தினம்");
                        arrayList.add("1830 - உருகுவே அரசியலமைப்பு தினம்");
                        arrayList.add("1965 - சோவியத்தின் சோண்ட் 3 விண்கலம் ஏவப்பட்டது");
                        arrayList.add("2014 - பெங்களூருவில், ஒன்றாம் வகுப்பு படிக்கும், 6 வயது சிறுமியை, பள்ளியின் உடற்கல்வி ஆசிரியர் மற்றும் செக்யூரிட்டி பாலியல் பலாத்காரம் செய்த கொடுமை நடந்தேறிய தினம் இன்று  .");
                        arrayList.add("2013 - கவிஞர் வாலி இன்று அமரரான தினம்");
                        break;
                    case 19:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - மியான்மர் மாவீரர் தினம்");
                        arrayList.add("1979 - நிக்கரகுவா, தேசிய விடுதலை தினம்");
                        arrayList.add("1996 - ஒலிம்பிக் போட்டிகள் அட்லாண்டாவில் ஆரம்பிக்கப்பட்டன");
                        arrayList.add("1900 - பாரிசில் முதலாவது சுரங்கத் தொடருந்து சேவை ஆரம்பமாயிற்று");
                        arrayList.add("1980 - ஒலிம்பிக் விளையாட்டுக்கள் மாஸ்கோவில் ஆரம்பமாயின");
                        break;
                    case 20:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச சதுரங்க தினம்");
                        arrayList.add("1810 - கொலம்பியா விடுதலை நாள்");
                        arrayList.add("கிமு 356 - கிரேக்க மன்னன் அலெக்சாண்டர் பிறந்த தினம்");
                        arrayList.add("1940 - டென்மார்க் பன்னாட்டு அமைப்பில் இருந்து விலகியது");
                        arrayList.add("1953 - யூனிசெப் அமைப்பை நிரந்தமாக்கும் முடிவு ஐநாவில் எட்டப்பட்டது");
                        break;
                    case 21:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பெல்ஜியம் தேசிய தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பொலீவியா மாவீரர் தினம்");
                        arrayList.add("1899 - இந்திய ஆன்மிகவாதி சாரதா தேவி இறந்த தினம்");
                        arrayList.add("2007 - ஹாரி பாட்டர் தொடர் நாவலின் கடைசிப் பாகம் வெளிவந்தது");
                        arrayList.add("2014 - ரயில் பயணத்தின்போது தரமற்ற உணவுகள் சப்ளை செய்யப்படுவதாக புகார் எழுந்துள்ளதை அடுத்து, சம்பந்தபட்ட விற்பனையாளருக்கு, ஒரு லட்சம் ரூபாய் வரை, அபராதம் விதிக்க, ரயில்வே துறை முடிவு செய்தது .");
                        break;
                    case 22:
                        arrayList.add("1944 - போலந்தில் கம்யூனிச ஆட்சி ஆரம்பமானது");
                        arrayList.add("1999 - விண்டோஸ் லைவ் மெசன்ஜர் மைக்ரோசாப்டினால் வெளியிடப்பட்டது");
                        arrayList.add("1894 - முதல் மோட்டார் பைக் பந்தயம் பிரான்சின் இரு நகரங்களுக்கிடையே நடத்தப்பட்டது");
                        arrayList.add("1923 - இந்திய பாடகர் முக்கேஷ் பிறந்த தினம்");
                        arrayList.add("2011 - கேரள முன்னணி நடிகர்கள் மம்முட்டி, மோகன்லால் ஆகியோருக்குச் சொந்தமான திருவனந்தபுரம், கொச்சி, சென்னை மற்றும் பெங்களூரில் உள்ள வீடுகள், அலுவலகங்கள் மற்றும் நிறுவனங்களில் வருமான வரித்துறையினர், ஒரே நேரத்தில் அதிரடி சோதனை நடத்திய தினம் இன்று");
                        break;
                    case 23:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - லிபியா புரட்சி நாள்");
                        arrayList.add("1952 - எகிப்து புரட்சி நாள்");
                        arrayList.add("1925 - இந்திய விடுதலை போராட்ட வீரர் சுப்பிரமணிய சிவா இறந்த தினம்");
                        arrayList.add("1829 - அமெரிக்காவின் வில்லியம் ஒஸ்டின் பேர்ட் முதலாவது தட்டச்சு இயந்திரத்திற்கான காப்புரிமத்தை பெற்றார்");
                        arrayList.add("2013 - பிரிட்டிஷ் இளவரசர் வில்லியம்சின் மனைவி, கேட் மிடில்டனுக்கு இன்று அழகான ஆண் குழந்தை பிறந்தது.");
                        break;
                    case 24:
                        arrayList.add("1924 - பன்னாட்டு சதுரங்கக் கூட்டமைப்பு பாரிசில் அமைக்கப்பட்டது");
                        arrayList.add("1991 - இந்திய அரசு தனது பொருளாதாரக் கொள்கையை அறிவித்தது");
                        arrayList.add("1935 - உலகின் முதலாவது குழந்தைகள் ரயில்வே பிலிசியில் திறக்கப்பட்டது");
                        arrayList.add("2014 - தெலுங்கானா மாநிலத்தின் தூதராக டென்னிஸ் வீராங்கனை சானியா நியமனத்திற்கு பல்வேறு தரப்பிலும் கடும் எதிர்ப்பு கிளம்பிய தினம்.");
                        arrayList.add("2012 - சீனாவில் இது வரை சந்திக்காத வரலாறு காணாத பெரும் மழை வெள்ளத்தினால் 100 க்கும் மேற்பட்டோர் உயிரிழந்த தினம்");
                        break;
                    case 25:
                        arrayList.add("1957 - துனீசியா குடியரசு தினம்");
                        arrayList.add("1908 - அஜினோமோட்டோ கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("2007 - பிரதிபா பாட்டீல் இந்தியாவின் மு‌தல் பெண் ஜனாதிபதி ஆனார்");
                        arrayList.add("2014 - காமன்வெல்த் போட்டியில் துப்பாக்கி சுடும் போட்டியில் இன்று இந்தியாவுக்கு இரண்டு பதக்கங்கள் கிடைத்தன.");
                        arrayList.add("2013 - ஸ்பெயின் நாட்டில் பயங்கர விபத்தில்  ரயில் தடம் புரண்டு  80 பேர் வரை பலியான தினம் இன்று . இதில் 100க்கும் மேற்பட்டோர் படுகாயமடைந்தனர்.");
                        break;
                    case 26:
                        arrayList.add("1965 - மாலத்தீவு விடுதலை நாள்");
                        arrayList.add("1847 - லைபீரியா விடுதலை நாள்");
                        arrayList.add("1788 - நியூயார்க் அமெரிக்காவின் 11வது மாநிலமாக இணைந்தது");
                        arrayList.add("1891 - டெஹீட்டி பிரான்சுடன் இணைந்தது");
                        arrayList.add("1974 - ராணுவ ஆட்சிக்கு பிறகு கிரேக்கத்தில் மக்களாட்சி ஏற்பட்டது");
                        break;
                    case 27:
                        arrayList.add("1876 - கவிமணி தேசிய விநாயகம்பிள்ளை பிறந்த தினம்");
                        arrayList.add("1879 - தமிழறிஞர் சோமசுந்தர பாரதியார் பிறந்த தினம்");
                        arrayList.add("1921 - டொரண்டோ பல்கலைக்கழக ஆராய்ச்சியாளர்களால் இன்சுலின் கண்டறியப்பட்டது");
                        arrayList.add("1929 - மூன்றாவது ஜெனீவா உடன்படிக்கை ஏற்படுத்தப்பட்டது");
                        arrayList.add("1990 - பெலாரஸ், சோவியத் ஒன்றியத்தில் இருந்து விடுதலையை அறிவித்தது");
                        break;
                    case 28:
                        arrayList.add("1821 - பெரு விடுதலை நாள்");
                        arrayList.add("1586 - முதல் முறையாக உருளைக்கிழங்கு பிரிட்டனிற்கு இறக்குமதி செய்யப்பட்டது");
                        arrayList.add("1996 - வாஷிங்டனில் கென்னவிக் என்ற இடத்தில் கற்கால மனிதனின் எச்சங்கள் கண்டுபிடிக்கப்பட்டன");
                        arrayList.add("1935 - முதலாவது விமானமான போயிங் பி 17 பறக்கவிடப்பட்டது");
                        arrayList.add("2014 - உ.பி மாநிலம் ராம்பூரில்  வன்முறை வெடித்த தினம்");
                        break;
                    case 29:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ருமேனியா தேசிய கீத தினம்");
                        arrayList.add("1904 - இந்திய தொழிலதிபர் ஜே.ஆர்.டி.டாடா பிறந்த தினம்");
                        arrayList.add("1944 - இலங்கை விஞ்ஞான முன்னேற்றச் சங்கம் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1981 - வேல்ஸ் இளவரசர் சார்லஸ் - டயானா திருமணம் நடைபெற்றது");
                        arrayList.add("2014 - காமன்வெல்த் போட்டியில், மல்யுத்தத்தில் இந்தியாவுக்கு இன்று ஒரே நாளில் 3 தங்கப்பதக்கம் கிடைத்தது.");
                        break;
                    case 30:
                        arrayList.add("1980 - வனுவாட்டு விடுதலை நாள்");
                        arrayList.add("1947 - அமெரிக்க நடிகர் அர்னால்டு ஸ்வார்செனேகர் பிறந்த தினம்");
                        arrayList.add("1825 - பசிபிக் கடலில் மால்டன் தீவு கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1932 - கலிபோர்னியாவில் 10வது ஒலிம்பிக் விளையாட்டுக்கள் ஆரம்பமாகின");
                        arrayList.add("1954 - எல்விஸ் பிறீஸ்லி முதல் முறையாக பொது மேடையில் பாட ஆரம்பித்தார்");
                        break;
                    case 31:
                        arrayList.add("1492 - ஸ்பெயினில் இருந்து யூதர்கள் வெளியேற்றப்பட்டனர்");
                        arrayList.add("1865 - உலகின் முதல் குறுகிய அகல தொடருந்துப் பாதை ஆஸ்திரேலியாவின் குயின்ஸ்லாந்தில் அமைக்கப்பட்டது");
                        arrayList.add("1976 - வைக்கிங் 1 விண்கலத்தினால் செவ்வாய் கோளில் எடுக்கப்பட்ட புகழ்பெற்ற மனிதமுகம் படத்தை நாசா வெளியிட்டது");
                        arrayList.add("1805 - இந்திய குறுநில மன்னன் தீரன் சின்னமலை இறந்த தினம்");
                        arrayList.add("2014 - இந்திய ராணுவத்தின் புதிய ராணுவ தளபதியாக அரியானாவைச் சேர்ந்த தல்பீர்சிங் சுஹாக் பொறுப்பேற்றார்.");
                        break;
                }
                break;
            case 7:
                switch (i2) {
                    case 1:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - சர்வதேச நண்பர்கள் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - உலக சாரணர் தினம்");
                        arrayList.add("2008 - இந்திய அரசியல் தலைவர் ஹர்கிஷன் சிங் சுர்ஜித் இறந்த தினம்");
                        arrayList.add("1967 - கிழக்கு ஜெருசலம் இஸ்ரேலுடன் இணைக்கப்பட்டது");
                        arrayList.add("2014 - பாலஸ்தீனத்தின், 'ஹமாஸ்' பயங்கரவாதிகள் மீது, 25 நாட்களாக இஸ்ரேல் ராணுவம் நடத்தி வந்த தாக்குதல், இன்று காலை, 8:00 மணியுடன் தற்காலிகமாக நிறுத்தப்பட்டது. எனினும், சண்டை நிறுத்தத்தை திடீரென ரத்து செய்து, இருதரப்பினரும் தாக்குதலை தொடர்ந்ததில், ஒரே நாளில், பாலஸ்தீனத்தில், 60க்கும் மேற்பட்டோர் கொல்லப்பட்ட தினம்.");
                        break;
                    case 2:
                        arrayList.add("1913 - உலகத் தமிழாராய்ச்சி மன்றம் அமைக்க அடிகோலிய தனிநாயகம் அடிகளார் பிறந்த தினம்");
                        arrayList.add("1922 - தொலைப்பேசியை கண்டுபிடித்த அலெக்சாண்டர் கிரஹாம் பெல் இறந்த தினம்");
                        arrayList.add("1870 - உலகின் முதலாவது சுரங்க தொடருந்து சேவை லண்டனில் தொடங்கப்பட்டது");
                        arrayList.add("1610 - ஹென்றி ஹட்சன் தனது கடற் பயணத்தின் போது தற்போதைய ஹட்சன் குடாவை அடைந்தார்");
                        arrayList.add("2014 - தமிழகமெங்கும், 300 'அம்மா' அமுதம் பல்பொருள் அங்காடிகள் துவங்கப்படும்,'' என, முதல்வர் ஜெயலலிதா, இன்று அறிவித்த தினம்");
                        break;
                    case 3:
                        arrayList.add("1960 - நைஜர் விடுதலை நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - வெனிசுவேலா கொடி நாள்");
                        arrayList.add("1976 - காந்தி கிராமம் கிராமியப் பல்கலைக்கழகம் அமைக்கப்பட்டது");
                        arrayList.add("1949 - தேசிய கூடைப்பந்து சங்கம் அமெரிக்காவில் அமைக்கப்பட்டது");
                        arrayList.add("2013 - ஆப்கானிஸ்தானில் இந்திய துணை தூதரகத்தின் மீது இன்று தற்கொலைப்படை தாக்குதல் நடந்த தினம்");
                        break;
                    case 4:
                        arrayList.add("1961 - அமெரிக்க அதிபர் பாரக் ஒபாமா பிறந்த தினம்");
                        arrayList.add("1693 - ஷாம்பைன் ஒயின் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1906 - சிட்னியில் மத்திய தொடருந்து நிலையம் திறக்கப்பட்டது");
                        arrayList.add("1984 - அப்பர் வோல்ட்டா ஆப்ரிக்க குடியரசு புர்கினா பாசோ எனப் பெயர் மாற்றப்பட்டது");
                        arrayList.add("2007 - நாசாவின் பீனிக்ஸ் விண்கலம் செவ்வாய்க் கோளை நோக்கி ஏவப்பட்டது");
                        break;
                    case 5:
                        arrayList.add("1960 - புர்கினா பாசோ விடுதலை நாள்");
                        arrayList.add("1930 - நிலவில் முதலில் காலடிவைத்த மனிதர் நீல் ஆம்ஸ்ட்ராங் பிறந்த தினம்");
                        arrayList.add("1987 - இந்திய திரைப்பட நடிகை ஜெனிலியா பிறந்த தினம்");
                        arrayList.add("1962 - அமெரிக்க நடிகை மர்லின் மன்றோ இறந்த தினம்");
                        arrayList.add("1806 - இலங்கையில் இஸ்லாமிய திருமணச் சட்ட விதிகள் அரசியல் நிர்ணய சபையில் ஏற்றுக் கொள்ளப்பட்டது");
                        break;
                    case 6:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - ஹிரோஷிமா நினைவு தினம்");
                        arrayList.add("1962 - ஜமைக்கா விடுதலை ‌தினம்");
                        arrayList.add("1991 - உலகளாவிய வலை(WWW) தொடர்பான தனது ஆவணங்களை டிம் பேர்னேர்ஸ்-லீ வெளியிட்டார்");
                        arrayList.add("1952 - இலங்கைப் பல்கலைக்கழகம் பேரானைக்கு இடம் மாறியது");
                        arrayList.add("2012 - செவ்வாய் கிரகத்துக்கு அனுப்பப்பட்ட 'ரோவர்' விண்கலம், எட்டு மாதப் பயணத்துக்கு பின், வெற்றிகரமாக தரையிறங்கியது.");
                        break;
                    case 7:
                        arrayList.add("1966 - விக்கிப்பீடியாவை துவக்கிய ஜிம்மி வேல்ஸ் பிறந்த தினம்");
                        arrayList.add("1925 - இந்திய அறிவியலாளர் எம்.எஸ்.சுவாமிநாதன் பிறந்த தினம்");
                        arrayList.add("1832 - இலங்கையில் சேமிப்பு வங்கி துவங்கப்பட்டது");
                        arrayList.add("1955 - சோனி நிறுவனம் தனது முதல் திரிதடை வானொலியை ஜப்பானில் விற்க துவங்கியது");
                        arrayList.add("2010 - கொழும்புவில் நடந்த பரபரப்பான மூன்றாவது டெஸ்டில், பதட்டப்படாமல் ஆடிய லட்சுமண் சதம் விளாச, இந்திய அணி, இலங்கையை 5 விக்கெட் வித்தியாசத்தில் வீழ்த்தியது.");
                        break;
                    case 8:
                        arrayList.add("1981 - சுவிட்சர்லாந்து டென்னிஸ் வீரர் ரோஜர் ஃபெடரர் பிறந்த தினம்");
                        arrayList.add("1967 - ஆசியான் அமைப்பு உருவாக்கப்பட்டது");
                        arrayList.add("1988 - மியான்மரில் மக்களாட்சியை வலியுறுத்தி 8888 எழுச்சி நிகழ்ந்தது");
                        arrayList.add("2012 - மெட்ரோ ரயில் சுரங்கப்பாதை அமைக்கும் பணியின் போது, ராட்சத கிரேன் நடு அச்சு முறிந்து விழுந்து ஏற்பட்ட விபத்தில் இருவர் பலியாகினர்; ஆறு பேர் பலத்த காயம் அடைந்தனர்.");
                        arrayList.add("2010 - ஜெர்மனி நாட்டில் முனிச் நகரில் நடந்த சர்வதேச துப்பாக்கிச் சுடும் போட்டியில் 50 மீட்டர் ரைபில்ஸ் பிரிவில் இந்திய வீராங்கனை தே‌ஜாஸ்வினி சவந்த் தங்கம் வென்றார்.");
                        break;
                    case 9:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - வெள்ளையனே வெளியேறு தினம்");
                        arrayList.add("1965 - சிங்கப்பூர் விடுதலை நாள்");
                        arrayList.add("1655 - ஆலிவர் குரொம்வெல், இங்கிலாந்தை 9 மாகாணங்களாகப் பிரித்தார்");
                        arrayList.add("1892 - தாமஸ் ஆல்வா எடிசன் தனது இருவழி தந்திக்கான காப்புரிமத்தை பெற்றார்");
                        arrayList.add("1173 - பைசா சாய்ந்த கோபுரத்தின் கட்டிட பணிகள் துவங்கப்பட்டன");
                        break;
                    case 10:
                        arrayList.add("1809 - ஈக்வடார் விடுதலை தினம்");
                        arrayList.add("610 - முகம்மது நபி குர்ஆனைப் பெற்ற நாள்");
                        arrayList.add("1948 - இந்திய அணுசக்தி கழகம், ஜவஹர்லால் நேருவால் துவங்கி வைக்கப்பட்டது");
                        arrayList.add("2013 - பெண்களை ஏமாற்றி, திருமண மோசடி வேலைகளில் ஈடுபடும் ஆண்களை தண்டிக்க, மாவட்ட சமூகநல அலுவலகத்தில், திருமண பதிவு கட்டாயமாக்கப்பட்ட தினம் இன்று .");
                        arrayList.add("2010 - சிவகாசி அருகே அனுமதி இல்லாத பட்டாசு ஒழிப்பு சோதனையில் கடுமையான  வெடி விபத்து ஏற்பட்ட தினம் , இதில்  வி.ஏ.ஓ., பலியானார் .");
                        break;
                    case 11:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - பிரேசில் மாணவர் தினம்");
                        arrayList.add("கிமு 2492 - ஆர்மீனியா அமைக்கப்பட்டது");
                        arrayList.add("1812 - இலங்கையில் தாவரவியல் பூங்கா அமைக்கப்பட்டது");
                        arrayList.add("1968 - பிரிட்டானிய நீராவித் தொடருந்து தனது கடைசி பயணிகள் சேசையை நடத்தியது");
                        arrayList.add("2014 - சுதந்திர போராட்ட தலைவர் நேதாஜி சுபாஸ் சந்திரபோசுக்கு, 'பாரத ரத்னா' விருது வழங்கப்படவுள்ளதாக தகவல் வெளியானது ஆனால்  நேதாஜி குடும்பத்தினர், 'இந்த விருதை ஏற்க போவது இல்லை' என்று   தெரிவித்த தினம் .");
                        break;
                    case 12:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - சர்வதேச இளைஞர்கள் தினம்");
                        arrayList.add("1981 - ஐ.பி.எம்., தனி மேசைக் கணினி வெளியிடப்பட்டது");
                        arrayList.add("1851 - ஐசக் சிங்கர் தனது தையல் இயந்திரத்திற்கான காப்புரிமம் பெற்றார்");
                        arrayList.add("2011 - சீனாவின் தொழில்நுட்ப வழிமுறை , நிதி ஆதார உதவிகளுடன் உருவாகிய தொலை தொடர்பு செயற்கைகோளை பாகிஸ்தான் விண்ணிற்கு அனுப்பியது.");
                        arrayList.add(" - ");
                        break;
                    case 13:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - சர்வதேச இடது கையாளர்கள் தினம்");
                        arrayList.add("1960 - மத்திய ஆப்பிரிக்க குடியரசின் விடுதலை தினம்");
                        arrayList.add("கிமு 3114 - மாயா நாட்காட்டி தொடங்கப்பட்டது");
                        arrayList.add("1954 - பாகிஸ்தான் தனது தேசிய கீதத்தை முதன் முறையாக வானொலியில் ஒலிபரப்பியது");
                        arrayList.add("2014 - சுப்ரீம் கோர்ட்டில் முதல் தமிழ் பெண் நீதிபதியாக பானுமதி இன்று பொறுப்பேற்றார்.");
                        break;
                    case 14:
                        arrayList.add("1947 - பாகிஸ்தான் விடுதலை நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - பராகுவே கொடி நாள்");
                        arrayList.add("1945 - பசிபிக் போர் முடிவுற்றது");
                        arrayList.add("2012 - அமெரிக்காவில் பல்‌கலை. வாளகத்தில் மர்ம மனிதன் நடத்திய துப்பாக்கிச்சூட்டில் இரு அதிகாரிகள் உள்பட மூன்று பேர் பலியான சம்பவம் இன்று தான் நடந்தது");
                        arrayList.add("2010 - கடும் மழை வெள்ளத்தில் இருந்து  மீள முடியாமல் தவிக்கும் பாகிஸ்தான் இன்று கொண்டாட இருந்த சுதந்திரதினத்தை ரத்து செய்தது . இந்தியா 5 மில்லியன் டாலர் பாகிஸ்தானுக்கு நிதி வழங்குவதாக இந்திய வெளியுறவு துறை அமைச்சகம் இன்று தெரிவித்தது");
                        break;
                    case 15:
                        arrayList.add("1947 - இந்திய சுதந்திர தினம்");
                        arrayList.add("1948 - தென் கொரியா விடுதலை நாள்");
                        arrayList.add("1961 - தென்னிந்திய திரைப்பட நடிகை சுஹாசினி பிறந்த தினம்");
                        arrayList.add("2014 - பாகி்ஸ்தானை ஆளும் நவாஸ் ஹெரீப், ஆட்சியை எதிர்த்து எதிர்கட்சியினர் இன்று  பேரணி ஒன்றை நடத்தினர் , அது  இறுதியில்  கலவரத்தில் முடிந்தது. இந்த சம்பவத்தில், பேரணியை தலைமையேற்று நடத்திய முன்னாள் கிரிக்கெட் வீரர் , இம்ரான்கான் தாக்கப்பட்டு  மயிரிழையில் உயிர் தப்பினார்.");
                        arrayList.add("2012 - மத்திய அமைச்சர் விலாஸ்ராவ் தேஷ்முக்  உடலுக்கு இன்று மாலையில் அரசு மரியாதையுடன் குண்டுகள் முழங்கிட  இறுதிச்சடங்கு நடந்தது.");
                        break;
                    case 16:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - பராகுவே சிறுவர் தினம்");
                        arrayList.add("1886 - இந்திய ஆன்மிகவாதி ஸ்ரீ ராமகிருஷ்ண பரமஹம்சர் இறந்த தினம்");
                        arrayList.add("2003 - உகாண்டா சர்வாதிகாரி இடி அமீன் இறந்த தினம்");
                        arrayList.add("1872 - தமிழ் முன்னோடி எழுத்தாளர் அ.மாதவையா பிறந்த தினம்");
                        arrayList.add("1865 - 4 ஆண்டுகள் ஸ்பானியரின் பிடியில் இருந்த டொமினிக்கன் குடியரசு மீண்டும் விடுதலை பெற்றது");
                        break;
                    case 17:
                        arrayList.add("1945 - இந்தோனேஷியா விடுதலை நாள்");
                        arrayList.add("1947 - இந்தியாவையும் பாகிஸ்தானையும் பிரிக்கும் ராட்கிலிஃப் கோடு வெளியிடப்பட்டது");
                        arrayList.add("1963 - இந்திய திரைப்பட இயக்குனர் ஷங்கர் பிறந்த தினம்");
                        arrayList.add("1959 - மொன்டானாவில் ஏற்பட்ட நிலநடுக்கத்தால் குவேக் ஏரி அமைக்கப்பட்டது");
                        arrayList.add("1982 - முதலாவது சிடி ஜெர்மனியில் வெளியிடப்பட்டது");
                        break;
                    case 18:
                        arrayList.add("1945 - இந்திய சுதந்திர ‌போராட்ட வீரர் நேதாஜி சுபாஷ் சந்திரபோஸ் இறந்த தினம்");
                        arrayList.add("1201 - லாத்வியாவின் ரீகா நகரம் அமைக்கப்பட்டது");
                        arrayList.add("1877 - செவ்வாய் கோளின் ஃபோபோஸ் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1868 - பிரெஞ்சு வானியல் நிபுணர் பியேர் ஜான்சன் சூரிய கிரகணத்தை ஆய்வு செய்யும் போது ஹீலியம் என்ற தனிமத்தை கண்டுபிடித்தார்");
                        arrayList.add("1958 - விளாடிமீர் நபகோவ் எழுதிய லோலிட்டா என்ற புதினம் அமெரிக்காவில் வெளியிடப்பட்டது");
                        break;
                    case 19:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - சர்வதேச மனிதநேய தினம்");
                        arrayList.add("1919 - ஆப்கானிஸ்தான் விடுதலை நாள்");
                        arrayList.add("1895 - கொழும்பு தலைமை அஞ்சல் அலுவலகம் திறக்கப்பட்டது");
                        arrayList.add("2014 - இந்திய பகுதிக்குள் சீன ராணுவத்தினர் 25 கி. மீ  அத்துமீறி நுழைந்து முகாமிட்ட தினம்");
                        arrayList.add("2010 - ஈராக்கில் இருந்து அமெரிக்க ராணுவத்தினர் முழுமையாக  வெளியேறிய தினம்");
                        break;
                    case 20:
                        arrayList.add("1944 - இந்திய முன்னாள் பிரதமர் ராஜீவ் பிறந்த தினம்");
                        arrayList.add("1946 - இந்திய தொழிலதிபர் நாராயண மூர்த்தி பிறந்த தினம்");
                        arrayList.add("1953 - ஐதரசன் குண்டை சோதித்ததாக சோவியத் ஒன்றியம் அறிவித்தது");
                        arrayList.add("1977 - நாசா வொயேஜர் 2 விண்கலத்தை ஏவியது");
                        arrayList.add("2013 - பாகிஸ்தான் முன்னாள் பிரதமர் பெனாசீர்பூட்டோவை கொலை செய்த வழக்கில், அந்நாட்டு மாஜி சர்வாதிகாரி முஷாரப்புக்கு தொடர்பு இருப்பதாக கோர்ட்டில் குற்றச்சாட்டு பதிவு செய்யப்பட்ட தினம்");
                        break;
                    case 21:
                        arrayList.add("1821 - ஜார்விஸ் தீவு கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1842 - டாஸ்மானியா தலைநகரான ஹோபார்ட் நகரம் அமைக்கப்பட்டது");
                        arrayList.add("1959 - ஹவாய், அமெரிக்காவின் 50வது மாநிலமாக இணைக்கப்பட்டது");
                        arrayList.add("1991 - லாத்வியா, சோவியத் ஒன்றியத்திடம் இருந்து விடுதலையை அறிவித்தது");
                        arrayList.add("2010 - ஆந்திர மாநிலம் குண்டூர் மாவட்ட ஜூனியர் சிவில் நீதிபதி சத்தியநாராயண மூர்த்தி  நீண்ட காலம் பெண்டிங்கில் இருந்த   111 வழக்குகள் மீது  ஒரே நாளில் நியாயமான தீர்ப்பளித்து சாதனை செய்தார்");
                        break;
                    case 22:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - ரஷ்ய ‌கொடி நாள்");
                        arrayList.add("1642 - இங்கிலாந்தில் ஆங்கில உள்நாட்டுப் போர் துவங்கியது");
                        arrayList.add("1926 - ஜோகன்னஸ்பர்க்கில் தங்கம் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1972 - ரொடீசியா, ஒலிம்பிக் அமைப்பில் இருந்து வெளியேற்றப்பட்டது");
                        arrayList.add("1989 - நெப்டியூனின் முதல் கோள் வளையம் கண்டுபிடிக்கப்பட்டது");
                        break;
                    case 23:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - உக்ரேன் கொடி நாள்");
                        arrayList.add("1944 - ருமேனியா விடுதலை நாள்");
                        arrayList.add("1973 - இன்சாட் தொலைத் தொடர்பு செய்மதி ஏவப்பட்டது");
                        arrayList.add("1948 - ஏ.கே.செட்டியார் தயாரித்த காந்தி பற்றிய முதல் வரலாற்றுத் திரைப்படம் தமிழ் மற்றும் தெலுங்கில் வெளியிடப்பட்டன");
                        arrayList.add("1975 - லாவோசில் கம்யூனிசப் புரட்சி வெற்றி பெற்றது");
                        break;
                    case 24:
                        arrayList.add("1690 - கல்கத்தா நகரம் அமைக்கப்பட்டது");
                        arrayList.add("1991 - உக்ரேன் விடுதலை நாள்");
                        arrayList.add("1995 - விண்டோஸ் 95 வெளியிடப்பட்டது");
                        arrayList.add("2014 - ராஜஸ்தான் மாநிலம் பிரபல ஜெய்ப்பூர் அரண்மனையில் பெரும் தீ விபத்து ஏற்பட்டது.");
                        arrayList.add("2013 - அயோத்தியிலிருந்து, விஸ்வ இந்து பரிஷத்  ரத யாத்திரையை  மேற்கொண்டதால்   இரட்டை நகரங்களான, அயோத்தி மற்றும் பைசாபாத்தில், ஏராளமான போலீசார் குவிக்கப்பட்டனர் இதனால்  அயோத்தி மற்றும் அதனைச் சுற்றியுள்ள பகுதிகளில், பதற்றம் நிலவியது");
                        break;
                    case 25:
                        arrayList.add("1825 - உருகுவே விடுதலை நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - பிலிபைன்ஸ் தேசிய வீரர்கள் தினம்");
                        arrayList.add("1906 - கிருபானந்த வாரியார் சுவாமிகள் பிறந்த தினம்");
                        arrayList.add("1962 - வங்கள தேச எழுத்தாளர் தஸ்லிமா நஸ்ரீன் பிறந்த தினம்");
                        arrayList.add("1830 - பெல்ஜியப் புரட்சி ஆரம்பமானது");
                        break;
                    case 26:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - அமெரிக்காவில் பெண்கள் சமஉரிமை தினம்");
                        arrayList.add("1910 - அன்னை தெரசா பிறந்த தினம்");
                        arrayList.add("1956 - இந்திய அரசியல்வாதி மேனகா காந்தி");
                        arrayList.add("1972 - 22வது ஒலிம்பிக் போட்டிகள் ஜெர்மனியின் மியூனிக்கில் ஆரம்பமானது");
                        arrayList.add("2014 - கடந்த 1971ம் ஆண்டுநடந்த போருக்கு பின்னர், பாகிஸ்தான் ராணுவம் அமைதி ஒப்பந்தத்தை மீறி, இந்திய நிலைகள் மீது தொடர்ந்து  தாக்குதல் நடத்தி   வருவதால், இன்று நடந்த உயர் அதிகாரிகள் மட்டத்திலான பேச்சுவார்த்தையில், இந்தியா சார்பில் கடும்  கண்டனம் தெரிவிக்கப்பட்டது");
                        break;
                    case 27:
                        arrayList.add("1991 - மால்டோவா விடுதலை தினம்");
                        arrayList.add("1879 - நவீன அஞ்சல் சேவையை கண்டுபிடித்த ரோலண்ட் ஹில் இறந்த தினம்");
                        arrayList.add("1939 - உலகின் முதலாவது ஜெட் விமானமான ஹென்கில் ஹி 178 சேவைக்கு விடப்பட்டது");
                        arrayList.add("2014 - இந்திய கடற்படைக்கு மேலும் 40 போர்கப்பல் வாங்க உத்தரவு பிறப்பிக்கப்பட்ட தினம்");
                        arrayList.add("2010 - மேற்குவங்கத்தில் 148 பேர் உயிரை காவு வாங்கிய ரயில் கவிழ்ப்பு சம்பவத்திற்கு முக்கிய காரணகர்த்தாவாக இருந்த மாவோயிஸ்ட் இயக்க முக்கிய தலைவர்களில் ஒருவரான மகத்தோவை போலீஸ் கூட்டுப்படையினர் சுட்டுக்கொன்ற தினம்");
                        break;
                    case 28:
                        arrayList.add("1978 - வில்லியம் ஹோர்ச்செல் சனிக் கோளின் புதிய சந்திரனைக் கண்டுபிடித்தார்");
                        arrayList.add("1845 - சயின்டிஃபிக் அமெரிக்கன் முதலாவது இதழ் வெளி வந்தது");
                        arrayList.add("1898 - காலெப் பிராடம் தான் கண்டுபிடித்த மென்பானத்திற்கு பெப்சி கோலா எனப் பெரியட்டார்");
                        arrayList.add("1913 - அரசி வில்ஹெல்மினா, த ஹேக் நகரில் அமைதி அரண்மனையைத் திறந்தார்");
                        arrayList.add("1991 - சோவியத்திடம் இருந்து உக்ரைன் விடுதலை பெற்றது");
                        break;
                    case 29:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - இந்திய தேசிய விளையாட்டு தினம்");
                        arrayList.add("1958 - அமெரிக்க பாப் பாடகர் மைக்கேல் ஜாக்சன் பிறந்த தினம்");
                        arrayList.add("708 - செப்பு நாணயம் முதன் முதலில் ஜப்பானில் உருவாக்கப்பட்டது");
                        arrayList.add("1885 - காட்லீப் டாயிம்லர், மோட்டார் சைக்கிளுக்கான காப்புரிமம் பெற்றார்");
                        arrayList.add("2013 - பல்வேறு குண்டுவெடிப்புகளில் தொடர்புடைய இந்தியன் முஜாகிதீன் பயங்கரவாத அமைப்பை உருவாக்கிய நிறுவனர் யாசின்பத்கல் நேபாள எல்லையில் கைது செய்யப்பட்டான்.");
                        break;
                    case 30:
                        arrayList.add("இன்றைய  முக்கியத்துவம்    - சர்வதேச காணாமல் போனோர் தினம்");
                        arrayList.add("1957 - தென்னிந்திய நகைச்சுவை நடிகர் என்.எஸ்.கிருஷ்ணன் இறந்த தினம்");
                        arrayList.add("1984 - டிஸ்கவரி விண்ணோடம் தனது முதலாவது பயணத்தை ஆரம்பித்தது");
                        arrayList.add("1991 - அசர்பைஜான் சோவியத் ஒன்றியத்திடம் இருந்து விடுதலையை அறிவித்தது");
                        arrayList.add("2010 - தர்மபுரி அருகே, கோவை விவசாய பல்கலைக்கழக பஸ்சை  எரித்து, மாணவியர் மூன்று பேர் உயிரோடு எரிந்து சாக காரணமாக இருந்த மூன்று பேருக்கு விதிக்கப்பட்ட மரண தண்டனையை, சுப்ரீம் கோர்ட்  உறுதி செய்த தினம் இன்று .");
                        break;
                    case 31:
                        arrayList.add("1957 - மலேசியா விடுதலை தினம்");
                        arrayList.add("1991 - கிர்கிஸ்தான் விடுதலை தினம்");
                        arrayList.add("1997 - வேல்ஸ் இளவரசி டயானா இறந்த தினம்");
                        arrayList.add("1945 - ஆஸ்திரேலியாவில் லிபரல் கட்சி ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1998 - வடகொரியா தனது முதலாவது செய்மதியை ஏவியது");
                        break;
                }
                break;
            case 8:
                switch (i2) {
                    case 1:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சிங்கப்பூர் ஆசிரியர் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஸ்லாவேக்கியா அரசியலமைப்பு தினம்");
                        arrayList.add("1980 - உலகத் தமிழாராய்ச்சி நிறுவன ஸ்தாபகர் தனிநாயகம் அடிகள் இறந்த தினம்");
                        arrayList.add("1914 - ரஷ்யாவின் சென் பீட்டர்ஸ்பெர்க் நகரம், பெட்ரோகிராட் எனப் பெயர் மாற்றப்பட்டது");
                        arrayList.add("1985 - அமெரிக்க, பிரெஞ்ச் கூட்டு முயற்சியில் டைட்டானிக் கப்பலின் எச்சங்கள் கண்டுபிடிக்கப்பட்டன");
                        break;
                    case 2:
                        arrayList.add("1945 - வியட்நாம் குடியரசு தினம்");
                        arrayList.add("1969 - வியட்நாம் தலைவர் ஹோ சி மின் இறந்த தினம்");
                        arrayList.add("2009 - ஆந்திர முன்னாள் முதல்வர் ராஜசேகர ரெட்டி இறந்த தினம்");
                        arrayList.add("1752 - ஐக்கிய ராஜ்யத்தில் கிரிகேரியன் நாட்காட்டி அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("1969 - அமெரிக்காவில் முதல் ஏடிஎம் நியூயார்க்கில் அமைக்கப்பட்டது");
                        break;
                    case 3:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஆஸ்திரேலிய கொடி நாள்");
                        arrayList.add("1971 - கத்தார் விடுதலை தினம்");
                        arrayList.add("301 - உலகின் மிகச் சிறிய மற்றும் பழமையான குடியரசு நாடான சான் மரீனோ உருவாக்கப்பட்டது");
                        arrayList.add("2014 - ஈராக்கில் மற்றொரு அமெரிக்க பத்திரிகையாளர் ஐ.எஸ்.பயங்கரவாதிகளால் தலை துண்டித்து கொடூரமாக கொல்லப்பட்ட வீடியோ வெளியாகி உலகம் முழுவதும்  பரபரப்பை ஏற்படுத்திய தினம்");
                        arrayList.add("2013 - இஸ்ரேல், அமெரிக்காவுடன் இணைந்து, ஏவுகணை சோதனை நடத்தியதால், சிரியாவில் போர் பீதி ஏற்பட்ட தினம்");
                        break;
                    case 4:
                        arrayList.add("1978 - அண்ணா பல்கலைக்கழகம் அமைக்கப்பட்டது");
                        arrayList.add("1941 - இந்திய அரசியல்வாதி சுஷில்குமார் ஷிந்தே பிறந்த தினம்");
                        arrayList.add("1781 - லாஸ் ஏஞ்சல்ஸ் நகரம் அமைக்கப்பட்டது");
                        arrayList.add("1951 - கண்டங்களுக்கு இடையேயான முதலாவது நேரடி தொலைக்காட்சி ஜப்பானில் இருந்து கலிபோர்னியாவிற்கு ஒளிபரப்பப்பட்டது");
                        arrayList.add("1956 - வன்தட்டு நினைவகத்தைக் கொண்ட உலகின் முதலாவது கணினியை ஐபிஎம் அறிமுகப்படுத்தியது");
                        break;
                    case 5:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - இந்திய ஆசிரியர் தினம்");
                        arrayList.add("1888 - இந்தியாவின் 2வது ஜனாதிபதி சர்வபள்ளி ராதாகிருஷ்ணன் பிறந்த தினம்");
                        arrayList.add("1997 - அன்னை தெரசா இறந்த தினம்");
                        arrayList.add("2014 - சுப்ரீம் கோர்ட் முன்னாள் தலைமை நீதிபதி சதாசிவம் கேரள கவர்னராக பதவி ஏற்ற தினம் இன்று");
                        arrayList.add(" - ");
                        break;
                    case 6:
                        arrayList.add("1951 - தினமலர் நாளிதழ் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பாகிஸ்தான் பாதுகாப்பு தினம்");
                        arrayList.add("2006 - ஐரோப்பியத் தமிழ் வானொலி ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1885 - கிழக்கு ருமேலியா, பல்கேரியாவுடன் இணைந்தது");
                        arrayList.add("2014 - தடங்கலின்றி 2 ஆண்டுகள் மின் உற்பத்தியை  மேற்கொண்டு   ராஜஸ்தான் அணுமின்நிலையம் சாதனை புரிந்த தினம் இன்று");
                        break;
                    case 7:
                        arrayList.add("1998 - கூகுள் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1822 - பிரேசில் விடுதலை நாள்");
                        arrayList.add("1927 - பில்லோ டெய்லர் ஃபர்ன்ஸ்வொர்த், முதல் எலக்ட்ரானிக் தொலைக்காட்சியை உருவாக்கினார்");
                        arrayList.add("2014 - டில்லி கோர்ட் குழந்தைத் திருமணத்தைக் கடுமையாக கண்டித்த தினம் இன்று");
                        arrayList.add("2011 - டில்லி உயர் நீதிமன்ற வாசலில் பயங்கர குண்டு வெடிப்பு நிகழ்ந்த தினம்");
                        break;
                    case 8:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக எழுத்தறிவு தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பாகிஸ்தான் கடற்படை தினம்");
                        arrayList.add("1995 - ஆத்மஜோதி இதழாசிரியர் நா.முத்தையா இறந்த தினம்");
                        arrayList.add("2008 - வயலின் இசைக்கலைஞர் குன்னக்குடி வைத்தியநாதன் இறந்த தினம்");
                        arrayList.add("2010 - ஐதராபாத்தில் இருந்து 42 கி.மீ., தூரத்தில் ரங்கா ரெட்டி மாவட்டம், செவெல்ல டவுன் அடுத்த தேவுனி எர்ரவள்ளி கிராமத்தைச் சேர்ந்த பொதுமக்கள் 1,200 பேர், ஒரே நாளில் ஒரே நேரத்தில் கண் தானம் செய்து சாதனை படைத்த தினம் .");
                        break;
                    case 9:
                        arrayList.add("1948 - வட கொரியா குடியரசு தினம்");
                        arrayList.add("1899 - தமிழ் எழுத்தாளர் கல்கி ரா.கிருஷ்ணமூர்த்தி பிறந்த தினம்");
                        arrayList.add("1791 - அதிபர் ஜார்ஜ் வாஷிங்டன் நினைவாக அமெரிக்காவின் தலைநகராக வாஷிங்டன் டி.சி., எனப் பெயரிடப்பட்டது");
                        arrayList.add("1850 - கலிபோர்னியா, 31வது மாநிலமாக அமெரிக்காவில் இணைந்தது");
                        arrayList.add("2014 - ஐபோன்   6 மற்றும் ஐபோன் 6 பிளஸ் - ஐ யை   ஆப்பிள் நிறுவனம் அறிமுகப்படுத்திய தினம் இன்று");
                        break;
                    case 10:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச தற்கொலை தடுப்பு தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சீனா ஆசிரியர் தினம்");
                        arrayList.add("1980 - தமிழ் திரைப்பட நடிகர் ஜெயம் ரவி பிறந்த தினம்");
                        arrayList.add("1858 - 55 பண்டோரா என்ற சிறுகோள் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("2002 - சுவிட்சர்லாந்து ஐ.நா.,வில் இணைந்தது");
                        break;
                    case 11:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - லத்தீன் அமெரிக்க ஆசிரியர் தினம்");
                        arrayList.add("1862 - ஆங்கில எழுத்தாளர் ஓ ‌ஹென்றி பிறந்த தினம்");
                        arrayList.add("1921 - தமிழ் கவிஞர் சுப்பிரமணிய பாரதியார் இறந்த தினம்");
                        arrayList.add("2006 - ஜெர்மனியின் முதலாவது 24 மணிநேர தமிழ் வானொலியான ஐரோப்பியத் தமிழ் வானொலி ஆரம்பிக்கப்பட்டது");
                        arrayList.add("2011 - பரமக்குடியில் வரலாறு காணாத கலவரம் ஏற்பட்ட  தினம் இன்று .");
                        break;
                    case 12:
                        arrayList.add("1974 - எத்யோப்பியாவின் தேசிய புரட்சி தினம்");
                        arrayList.add("1832 - தமிழ் பதிப்புத்துறையின் முன்னோடி சி.வை.தாமோதரம்பிள்ளை பிறந்த தினம்");
                        arrayList.add("1848 - சுவிட்சர்லாந்து கூட்டமைப்பு ஆட்சியை நடைமுறைப்படுத்தியது");
                        arrayList.add("1933 - அணுக்கரு தொடர்வினை குறித்த கருத்தை முதன் முறையாக லியோ சிலார்ட் அறிவித்தார்");
                        arrayList.add("1980 - துருக்கியில் ராணுவப் புரட்சி இடம்பெற்றது");
                        break;
                    case 13:
                        arrayList.add("1788 - நியூயார்க் நகரம், அமெரிக்காவின் தற்காலிக தலைநகராக அறிவிக்கப்பட்டது");
                        arrayList.add("1898 - ஹனிபல் குட்வின், செலுலாயிட் புகைப்படச் சுருளைக் கண்டுபிடித்தார்");
                        arrayList.add("1948 - இந்தியப் படைகள் ஐதராபாத்தை இந்திய ஆளுமையின் கீழ் கொண்டு வந்தன");
                        arrayList.add("1994 - யுலிசெஸ் விண்கலம் சூரியனின் தென் முனையை கடந்தது");
                        arrayList.add("2010 - காஷ்மீரில் வன்முறை ஏற்பட்டு  14 பேர் கொள்ளப்பட்டு ; 70க்கும் மேற்பட்டோர் காயம் அடைந்த தினம் . அம்மாநிலமே  பற்றி எறிந்த தினம்");
                        break;
                    case 14:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச கலாச்சார ஒற்றுமை தினம்");
                        arrayList.add("1917 - ரஷ்யா அதிகாரப் பூர்வமாக குடியரசானது");
                        arrayList.add("1954 - சோவியத் ஒன்றியம் அணு ஆயுதச் சோதனையை மேற்கொண்டது");
                        arrayList.add("2000 - எம்.எஸ்., தோஸ் கடைசித் திருத்தம் வெளியிடப்பட்டது");
                        arrayList.add("2013 - டில்லியில் அப்பாவி மாணவியை கற்பழித்துக் கொன்ற  காமக் கொடூரர்கள் நான்கு பேருக்கு தூக்கு  தண்டனை விதிக்கப்பட்ட தினம் இன்று.");
                        break;
                    case 15:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச மக்களாட்சி தினம்");
                        arrayList.add("1909 - தமிழக முன்னாள் முதல்வர் சி.என்.அண்ணாதுரை பிறந்த தினம்");
                        arrayList.add("1950 - தனித்தமிழ் இயக்கத்தை தோற்றுவித்த மறைமலை அடிகள் இறந்த தினம்");
                        arrayList.add("1935 - நாசி ஜெர்மனி, சுவாஸ்டிக்காவுடன் கூடிய புதிய கொடியை அறிமுகப்படுத்தியது");
                        arrayList.add("2013 - அக்னி - 5 வெற்றிகரமாக விண்ணில் ஏவப்பட்டு சோதிக்கப்பட்ட தினம் இன்று.");
                        break;
                    case 16:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக ஓசோன் பாதுகாப்பு தினம்");
                        arrayList.add("1908 - ஜெனரல் மோட்டார்ஸ் நிறுவனம் அமைக்கப்பட்டது");
                        arrayList.add("1945 - இந்திய மத்திய அமைச்சர் ப. சிதம்பரம் பிறந்த தினம்");
                        arrayList.add("1852 - மான்செஸ்டர் நகரில் உலகின் முதலாவது இலவச நூல் நிலையம் அமைக்கப்பட்டது");
                        arrayList.add("2014 - இந்துஸ்தான் போட்டோ பிலிம்ஸ்  உட்பட 10 நிறுவனங்களை (அரசு) மூடுவதற்கு முடிவு செய்யப்பட தினம் இன்று.");
                        break;
                    case 17:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அங்கோலா தேசிய வீரர்கள் தினம்");
                        arrayList.add("1879 - திராவிட கழகத் தந்தை ஈ.வே.ரா.பெரியார் பிறந்த தினம்");
                        arrayList.add("1950 - குஜராத் முதல்வர் நரேந்திர மோடி பிறந்த தினம்");
                        arrayList.add("2004 - இந்தியாவில் தமிழ் செம்மொழியாக அறிவிக்கப்பட்டது");
                        arrayList.add("1997 - பெரியார் பல்கலைக்கழகம் அமைக்கப்பட்டது");
                        break;
                    case 18:
                        arrayList.add("1810 - சிலி விடுதலை நாள்");
                        arrayList.add("1968 - இந்திய உளவுத்துறை நிறுவனமான ரா உருவாக்கப்பட்டது");
                        arrayList.add("1851 - நியூயார்க் டைம்ஸ் இதழ் முதன் முதலில் வெளியிடப்பட்டது");
                        arrayList.add("1962 - ருவாண்டா, புருண்டி, ஜமைக்கா ஆகியன ஐ.நா.,வில் இணைந்தன");
                        arrayList.add("2011 - சிக்கிம்மில்  கடுமையான நிலநடுக்கம் ஏற்பட்டு 71 பேர் மரணம் அடைந்த தினம்");
                        break;
                    case 19:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சிலி ராணுவத்தினர் தினம்");
                        arrayList.add("1965 - அமெரிக்க விண்வெளி வீராங்கனை சுனிதா வில்லியம்ஸ் பிறந்த தினம்");
                        arrayList.add("1893 - சுவாமி விவேகானந்தர் சிகாகோ உலக சமய மாநாட்டில் உலகப் புகழ்பெற்ற சொற்பொழிவை நிகழ்த்தினார்");
                        arrayList.add("1893 - நியூசிலாந்து பெண்களுக்கு வாக்குரிமை வழங்கிய முதல் நாடானது");
                        arrayList.add("2014 - பிரபல கர்நாடக இசைக்கலைஞர், மாண்டலின் சீனிவாஸ், உடல்நலக் குறைவால் காலமானார்");
                        break;
                    case 20:
                        arrayList.add("1878 - தி ஹிந்து இதழ் வெளிவரத் துவங்கியது");
                        arrayList.add("1847 - நீலப் பென்னி அஞ்சல் தலையை பிரிட்டானியா, மொரீசியசில் வெளியிட்டது");
                        arrayList.add("1993 - துருவ செயற்கைக் கோள் ஏவுகணையை இந்தியா ஏவியது");
                        arrayList.add("2014 - ஆசிய விளையாட்டு முதல் நாள் போட்டியில் இந்தியாவுக்கு முதல் தங்கப் பதக்கம் கிடைத்தது. துப்பாக்கி சுடுதல் தனிநபர் 50 மீ., 'பிஸ்டல்' பிரிவில், இந்திய வீரர் ஜித்து ராய் தங்கம் வென்று அசத்தினார்.");
                        arrayList.add("2010 - மத்திய பிரதேசத்தில் ஏற்பட்ட ரயில் விபத்தில் 20 பேர் பலியான சம்பவம் நடந்த தினம்");
                        break;
                    case 21:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச அமைதி தினம்");
                        arrayList.add("1792 - பிரான்சில் குடியரசு நிறுவப்பட்டது");
                        arrayList.add("1964 - மோல்ட்டா விடுதலை தினம்");
                        arrayList.add("1981 - பெலீஸ் விடுதலை தினம்");
                        arrayList.add("2013 - இந்திய சினிமாவின் நூற்றாண்டு விழா சென்னையில்  நேரு உள்விளையாட்டு அரங்கில்  கொண்டாடப்பட்ட தினம் இன்று");
                        break;
                    case 22:
                        arrayList.add("1908 - பல்கேரியா விடுதலை நாள்");
                        arrayList.add("1960 - மாலி விடுதலை தினம்");
                        arrayList.add("1893 - அமெரிக்காவில் தயாரிக்கப்பட்ட தானுந்து முதன் முதலாகக் காட்சிப்படுத்தப்பட்டது");
                        arrayList.add("1499 - சுவிட்சர்லாந்து தனி நாடாகியது");
                        arrayList.add("1955 - ஐக்கிய ராஜ்யத்தில் ஐடிவி தொலைக்காட்சி சேவை ஆரம்பிக்கப்பட்டது");
                        break;
                    case 23:
                        arrayList.add("1932 - சவுதி அரேபியா தேசிய தினம்");
                        arrayList.add("1951 - தமிழ் திரைப்பட‌ நடிகர் பி.யு.சின்னப்பா இறந்த தினம்");
                        arrayList.add("1889 - நின்டெண்டோ கம்பெனி ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1884 - ஹோர்மன் ஹொலரித், கணிப்பானுக்கான காப்புரிமம் பெற்றார்");
                        arrayList.add("1932 - ஹெஜாஸ் மற்றும் நெஜிட் ஆகிய மன்னாராட்சிகள் சவுதி அரேபியா ‌என்ற பெயரில் இணைந்தன");
                        break;
                    case 24:
                        arrayList.add("1948 - ஹோண்டா நிறுவனம் அமைக்கப்பட்டது");
                        arrayList.add("1840 - இலங்கை வங்கி அமைக்கப்பட்டது");
                        arrayList.add("622 - முகமது நபி மெக்காவில் இருந்து மதினாவுக்கு இடம்பெயர்ந்தார்");
                        arrayList.add("1664 - நெதர்லாந்து நியூ ஆம்ஸ்டர்டாமை இங்கிலாந்திற்கு கொடுத்தது");
                        arrayList.add("2010 - டில்லியில் காமன்வெல்த் போட்டியை நடத்துவதற்கான உரிமையை பெற, 72 நாடுகளுக்கு சுமார் ரூ. 46 கோடி இந்தியா லஞ்சமாக கொடுத்ததாக , அதிர்ச்சி தகவல் வெளியான தினம் இன்று.");
                        break;
                    case 25:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - மொசாம்பிக் பாதுகாப்பு படையினர் தினம்");
                        arrayList.add("1899 - தமிழ் நாடக எழுத்தாளர் உடுமலை நாராயணகவி பிறந்த தினம்");
                        arrayList.add("1962 - அல்ஜீரியா மக்கள் ஜனநாயக குடியரசு அமைக்கப்பட்டது");
                        arrayList.add("1950 - தென் கொரியாவின் தலைநகரம் சியோல், ஐ.நா., கட்டுப்பாட்டின் கீழ் கொண்டு வரப்பட்டது");
                        arrayList.add("2014 - மங்கள்யான் எடுத்து அனுப்பிய புகைப்படங்களை, பெங்களூருவில் உள்ள இஸ்ரோ கட்டுப்பாட்டு அறை வெற்றிகரமாக  பெற்ற தினம் இன்று  . புகைப்படங்கள் தௌிவாக இருந்ததால் , விஞ்ஞானிகள் மகிழ்ச்சியடைந்தனர்.");
                        break;
                    case 26:
                        arrayList.add("1932 - இந்திய பிரதமர் மன்மோகன் சிங் பிறந்த தினம்");
                        arrayList.add("1962 - ஏமன் அரபுக் குடியரசு அமைக்கப்பட்டது");
                        arrayList.add("1890 - கர்நாடக இசை அறிஞர் பாபநாசம் சிவன் பிறந்த தினம்");
                        arrayList.add("1981 - அமெரிக்க டென்னிஸ் வீராங்கனை செரீனா வில்லியம்ஸ் பிறந்த தினம்");
                        arrayList.add("1959 - கவிமணி தேசிக விநாயகம்பிள்ளை இறந்த தினம்");
                        break;
                    case 27:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக சுற்றுலா தினம்");
                        arrayList.add("1907 - இந்திய விடுதலை போராட்ட வீரர் பகத் சிங் பிறந்த தினம்");
                        arrayList.add("1953 - இந்திய ஆன்மிகவாதி மாதா அமிர்தானந்தமயி பிறந்த தினம்");
                        arrayList.add("1998 - கூகுள் தேடுபொறி துவங்கப்பட்டது");
                        arrayList.add("1825 - உலகின் முதலாவது பயணிகள் தொடருந்து இங்கிலாந்தில் சேவைக்கு விடப்பட்டது");
                        break;
                    case 28:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக ரேபிஸ் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பசுமை நுகர்வோர் தினம்");
                        arrayList.add("1928 - அலெக்சாண்டர் பிளமிங் பெனிசிலினைக் கண்டுபிடித்தார்");
                        arrayList.add("1929 - இந்திய பின்னணி பாடகி லதா மங்கேஷ்கர் பிறந்த தினம்");
                        arrayList.add("1982 - இந்திய ஒலிம்பிக் வீரர் அபினவ் பிந்திரா பிறந்த தினம்");
                        break;
                    case 29:
                        arrayList.add("1885 - உலகின் முதலாவது மின்சார திராம் வண்டி இங்கிலாந்தில் சேவையை ஆரம்பித்தது");
                        arrayList.add("1971 - அரபு கூட்டமைப்பில் ஏமன் இணைந்தது");
                        arrayList.add("1991 - எயிட்டியில் ராணுவப் புரட்சி இடம்பெற்றது");
                        arrayList.add("1962 - கானடாவின் முதலாவது செய்மதி அலூட் 1 ஏவப்பட்டது");
                        arrayList.add("1916 - ஜான் ரொக்பெல்லர், உலகின் முதலாவது கோடீஸ்வரர் ஆனார்");
                        break;
                    case 30:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச மொழிபெயர்ப்பு தினம்");
                        arrayList.add("1966 - போட்ஸ்வானா விடுதலை நாள்");
                        arrayList.add("2003 - தமிழ் விக்கிப்பீடியா ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1947 - பாகிஸ்தான் ஐ.நா.,வில் இணைந்தது");
                        arrayList.add("1882 - உலகின் முதலாவது நீர்மின் திறன் அமெரிக்காவின் விஸ்கொன்சின் மாநிலத்தில் அமைக்கப்பட்டது");
                        break;
                }
                break;
            case 9:
                switch (i2) {
                    case 1:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச முதியோர் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஆர்மேனியா ஆசிரியர் தினம்");
                        arrayList.add("1854 - இந்திய அஞ்சல் துணை ஏற்படுத்தப்பட்டது");
                        arrayList.add("2014 - நாடு முழுவதும் தூய்மைபடுத்தும் திட்டமாக' கிளீன் இந்தியா ' திட்டத்தை  இன்று பிரதமர் மோடி துவக்கி வைத்தார்.");
                        arrayList.add("2012 - வரும், 2050ல், உலகில், 15 வயதுக்கு உட்பட்ட குழந்தைகளை விட, 60 வயதை கடந்த முதியவர்களே அதிக அளவில் இருப்பர்' என, ஐ.நா., மக்கள் தொகை நிதியம் (யு.என்.எப்.பி.ஏ.,), அறிக்கை ஒன்றை இன்று வெளியிட்ட தினம்");
                        break;
                    case 2:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்‌வதேச வன்முறையற்ற தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - இந்தியா காந்தி ஜெயந்தி");
                        arrayList.add("1906 - இந்தியாவின் பிரபல ஓவியர் ராஜா ரவி வர்மா இறந்த தினம்");
                        arrayList.add("2014 - பிரபல தொழிலதிபரும், காந்தியவாதியுமான பொள்ளாச்சி நா.மகாலிங்கம், சென்னையில் இன்று காலமானார்.");
                        arrayList.add("2010 - காமன்வெல்த் போட்டியின் துவக்க விழாவில்,இந்திய கொடியை ஏந்தி வரும் அரிய கவுரவம் 'ஒலிம்பிக் தங்க நாயகன்' அபினவ் பிந்த்ராவுக்கு வழங்க தீர்மானிக்கப்பட்ட தினம் இன்று .");
                        break;
                    case 3:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச வசிப்பிட தினம்");
                        arrayList.add("1932 - ஈராக் விடுதலை தினம்");
                        arrayList.add("1985 - அட்லாண்டிஸ் விண்ணோடம் தனது முதலாவது விண்வெளிப் பயணத்தை ஆரம்பித்தது");
                        arrayList.add("2014 - பாட்னாவில் காந்தி மைதானத்தில் தசரா திருவிழாவில்   ஏற்பட்ட கூட்ட நெரிசலில் சிக்கி 32 பேர் பலியானார்கள்");
                        arrayList.add("2012 - சென்னை நகரின் மையப்பகுதியான திரு‌வல்லிக்கேணியின், சுங்குவார் தெருவில் 2 மாடி கட்டடம் நொறுங்கி விழுந்தது");
                        break;
                    case 4:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக வன விலங்குகள் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக விண்வெளி வாரம் ஆரம்பம்");
                        arrayList.add("1824 - மெக்சிகோ குடியரசு ஆகியது");
                        arrayList.add("2011 - பிரபஞ்சம் மிக வேகமாக விரிவடைந்து கொண்டே வருவதைக் கண்டுபிடித்ததற்காக,  இயற்பியலுக்கான நோபல் பரிசு மூன்று பேருக்கு பகிர்ந்து அளிக்கப்பட்டது .அதன்படி, அமெரிக்கரான சால் பெர்ல்முட்டர், 52, அமெரிக்க ஆஸ்திரேலியரான பிரெய்ன் ஷ்மிட், 44, மற்றும் அமெரிக்கரான ஆடம் ரீஸ், 42, ஆகிய மூவரும்  நோபல் பரிசைப் பெற்றனர்");
                        arrayList.add("2010 - காமன்வெல்த் போட்டியில்  இன்று நடந்த 48 கி.கி., எடைப்பிரிவு பளுதூக்குதல் போட்டியில் ஒரு வெள்ளி, ஒரு வெண்கலம் உட்பட இரண்டு பதக்கங்களை இந்தியா பெற்றது.");
                        break;
                    case 5:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச ஆசிரியர் தினம்");
                        arrayList.add("1910 - போர்ச்சுக்கல் குடியரசு தினம்");
                        arrayList.add("1823 - இந்தியாவின் சன்மார்க்க சிந்தனையாளர் ராமலிங்க அடிகளார்(வள்ளலார்) பிறந்த தினம்");
                        arrayList.add("1886 - தங்கம் கண்டுபிடிக்கப்பட்டதை அடுத்து தென்னாப்பிரிக்காவின் ஜோகன்னஸ்‌பெர்க் நகரம் உருவாக்கப்பட்டது");
                        arrayList.add("1944 - பிரான்சில் பெண்கள் வாக்களிக்க அனுமதிக்கப்பட்டனர்");
                        break;
                    case 6:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - எகிப்து ராணுவ படை தினம்");
                        arrayList.add("1870 - ரோம் இத்தாலியின் தலைநகரானது");
                        arrayList.add("1987 - பிஜி குடியரசானது");
                        arrayList.add("1889 - தாமஸ் ஆல்வா எடிசன் தனது முதலாவது அசையும் படத்தைக் காண்பித்தார்");
                        arrayList.add("2014 - ஜான் ஓ கீபி, மே பிரிட் மோசர் மற்றும் எட்வர்டு ஐ மோசர் ஆகியோருக்கு  மருத்துவத் துறைக்கான நோபல் பரிசு பகிர்ந்து அளிக்கப்பட்ட தினம்.");
                        break;
                    case 7:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - கிழக்கு ஜெர்மனி குடியரசு தினம்");
                        arrayList.add("1978 - இந்திய கிரிக்கெட் வீரர் ஜாகிர் கான் பிறந்த தினம்");
                        arrayList.add("1949 - ஜெர்மன் ஜனநாயகக் குடியரசு உருவாக்கப்பட்டது");
                        arrayList.add("1806 - ரால்ஃப் வெட்ஜ்வூட் என்பவரால் கார்பன் தாள் காப்புரிமம் பெறப்பட்டது");
                        arrayList.add("1769 - கேப்டன் ஜேம்ஸ் குக் என்ற பயணியால் நியூசிலாந்து கண்டுபிடிக்கப்பட்டது");
                        break;
                    case 8:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - இந்திய விமானப் படை தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அமெரிக்காவில் கொலம்பஸ் தினம்");
                        arrayList.add("1959 - கவிஞர் பட்டுக்கோட்டை கல்யாணசுந்தரம் இறந்த தினம்");
                        arrayList.add("1982 - சொலிடாரிட்டி தொழிற்சங்கம் போலந்தில் தடை செய்யப்பட்டது");
                        arrayList.add("2010 - அமைதிக்கான நோபல் பரிசு சீன நாட்டை சேர்ந்த வியூஜியாபோவுக்கு கிடைத்தது");
                        break;
                    case 9:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக அஞ்சல் தினம்");
                        arrayList.add("1962 - உகாண்டா விடுதலை தினம்");
                        arrayList.add("1804 - டாஸ்மானியா தலைநகர் ஹோபார்ட் நகரம் அமைக்கப்பட்டது");
                        arrayList.add("1981 - பிரான்சில் மரண தண்டனை நிறுத்தப்பட்டது");
                        arrayList.add("1970 - கம்போடியாவில் கெமர் குடியரசு அறிவிக்கப்பட்டது");
                        break;
                    case 10:
                        arrayList.add("1970 - பீஜி குடியரசு தினம்");
                        arrayList.add("1888 - நாமக்கல் கவிஞர் ராமலிங்கம் பிள்ளை பிறந்த தினம்");
                        arrayList.add("1973 - தமிழிசை அறிஞர் பாபநாசம் சிவன் இறந்த தினம்");
                        arrayList.add("1974 - தமிழறிஞர் மு.வரதராஜன் இறந்த தினம்");
                        arrayList.add("1991 - தமிழகத்தில் நாகப்பட்டினம் மாவட்டம் உருவாக்கப்பட்டது");
                        break;
                    case 11:
                        arrayList.add("1852 - ஆஸ்திரேலியாவின் மிகப் பழமையான சிட்னி பல்கலைக்கழகம் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1944 - துவீனிய மக்கள் குடியரசு சோவியத் ஒன்றியத்துடன் இணைந்தது");
                        arrayList.add("1942 - இந்திய நடிகர் அமிதாப் பச்சன் பிறந்த தினம்");
                        arrayList.add("2013 - சென்னை போலீஸ் கமிஷனர் அலுவலகத்திற்காக, வேப்பேரி சாலையில், 25.46 கோடி ரூபாயில் கட்டப்பட்ட புதிய கட்டடத்தை, முதல்வர் ஜெயலலிதா திறந்து வைத்த தினம் இன்று .");
                        arrayList.add("2010 - டில்லி காமன்வெல்த் போட்டியின், வட்டு எறிதலில் இந்தியாவின் கிருஷ்ண பூனியா தங்கம் வென்று சாதித்தார்.");
                        break;
                    case 12:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - மாலாவி அன்னையர் தினம்");
                        arrayList.add("1918 - இந்திய தொழிலதிபர் கே.கே.பிர்லா பிறந்த தினம்");
                        arrayList.add("1968 - ஈக்குனட்டோரியல் கினி, ஸ்பெயினிடம் இருந்து விடுதலை பெற்றது");
                        arrayList.add("2005 - சீனாவின் 2வது ஆட்களுடன் கூடிய விண்கலம் சென்ஷோ 6, இரண்டு விண்வெளி வீரர்களுடன் ஏவப்பட்டது");
                        arrayList.add("2011 - 'பி.எஸ்.எல்.வி., சி18' ராக்கெட், 'மெகா ட்ராபிக்ஸ்' உட்பட நான்கு செயற்கைக்கோள்களுடன், இன்று காலை 11 மணிக்கு, விண்ணில் வெற்றிகரமாக ஏவப்பட்ட தினம் .");
                        break;
                    case 13:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - தாய்லாந்து தேசிய காவல்படை தினம்");
                        arrayList.add("1885 - ஜார்ஜியா தொழில்நுட்ப பல்கலைக்கழகம் அமைக்கப்பட்டது");
                        arrayList.add("1884 - அனைத்துலக நேரம் கணிக்கும் இடமாக க்றீனிச் தேர்வு செய்யப்பட்டது");
                        arrayList.add("1884 - அனைத்துலக நேரம் கணிக்கும் இடமாக க்றீனிச் தேர்வு செய்யப்பட்டது");
                        arrayList.add("1792 - வெள்ளை மாளிகைக்கான அடிக்கல் வாஷிங்டன் விசியில் இடப்பட்டது");
                        break;
                    case 14:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச கண்பார்வை தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலகத் தர நிர்ணய தினம்");
                        arrayList.add("1948 - இலங்கையின் முதலாவது நாடாளுமன்றம் கூடியது");
                        arrayList.add("2005 - தமிழ் எழுத்தாளர் சுந்தர ராமசாமி இறந்த தினம்");
                        arrayList.add("2009 - இந்திய பெண் சாதனையாளர் சி.பி.முத்தம்மாள் இறந்த தினம்");
                        break;
                    case 15:
                        arrayList.add("1931 - இந்திய முன்னாள் குடியரசுத் தலைவர் அப்துல் கலாம் பிறந்த தினம்");
                        arrayList.add("1918 - ஷீரடி சாய்பாபா இறந்த தினம்");
                        arrayList.add("1997 - நாசாவின் ஹியூஜென்ஸ் விண்ணுளவி சனி கோளை நோக்கி ஏவப்பட்டது");
                        arrayList.add("1878 - தாமஸ் ஆல்வா எடிசன் தனது மின்குமிழ் தயாரிக்கும் கம்பெனியை துவக்கினார்");
                        arrayList.add("1932 - டாடா விமான நிறுவனம் தனது முதலாவது வானூர்தி சேவையை ஆரம்பித்தது");
                        break;
                    case 16:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச உணவு தினம்");
                        arrayList.add("1799 - கட்டபொம்மன் தூக்கிலிடப்பட்ட தினம்");
                        arrayList.add("1905 - பிரிட்டானியா, இந்தியாவில் வங்காளப் பிரிவு இடம்பெற்றது");
                        arrayList.add("2003 - தமிழ் விக்கிப்பீடியாவில் முதலாவது கட்டுரை, சிரின் எபாடி பற்றி எழுதப்பட்டது");
                        arrayList.add("2014 - நேபாள நாட்டில் ஏற்பட்ட பனிச்சரிவில் சிக்கி 30 பேர் இறந்தனர்.");
                        break;
                    case 17:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச வறுமை ஒழிப்பு தினம்");
                        arrayList.add("1970 - இந்திய கிரிக்கெட் அணியின் சுழற்பந்து வீச்சாளர் அனில் கும்ளே பிறந்த தினம்");
                        arrayList.add("1965 - இலங்கை கிரிக்கெட் வீரர் அரவிந்த் டி சில்வா பிறந்த தினம்");
                        arrayList.add("1979 - அன்னை தெரசா அமைதிக்கான நோபல் பரிசைப் பெற்றார்");
                        arrayList.add("2003 - தாய்ப்பே 101, உலகின் மிக உயரமான வானளாவி ஆனது");
                        break;
                    case 18:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அமெரிக்காவில் அலாஸ்கா தினம்");
                        arrayList.add("1956 - டென்னிஸ் வீராங்கனை மார்டினா நவரத்திலோவா பிறந்த தினம்");
                        arrayList.add("1991 - நாகப்பட்டினம் மாவட்டம் அமைக்கப்பட்டது");
                        arrayList.add("1922 - பிபிசி வானொலி ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1908 - பெல்ஜியம் காங்கோவைக் கைப்பற்றியது");
                        break;
                    case 19:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அல்பேனியாவில் அன்னை தெரசா தினம்");
                        arrayList.add("1910 - இந்திய இயற்பியலாளர் சுப்பிரமணியன் சந்திரசேகர் பிறந்த தினம்");
                        arrayList.add("1954 - சோ ஓயு மலையின் உச்சி முதன் முறையாக எட்டப்பட்டது");
                        arrayList.add("1976 - சிம்பன்சி, உலகின் அரிய வகை விலங்கினமாக அறிவிக்கப்பட்டது");
                        arrayList.add("1943 - காசநோய்க்கான நுண்மஎதிரி மருந்து ரட்கஸ் பல்கலைக்கழகத்தில் பிரித்தெடுக்கப்பட்டது");
                        break;
                    case 20:
                        arrayList.add("1973 - சிட்னி ஒப்பேரா மாளிகை திறந்து வைக்கப்பட்டது");
                        arrayList.add("2004 - முதலாவது உபுண்டு லினக்ஸ் வெளியிடப்பட்டது");
                        arrayList.add("1923 - கேரள முதல்வர் வி.எஸ்.அச்சுதானந்தன் பிறந்த தினம்");
                        arrayList.add("1982 - இலங்கையில் முதன் முதலில் ஜனாதிபதித் தேர்தல் நடைபெற்றது");
                        arrayList.add("1955 - தி லோட் ஒவ் த ரிங்ஸ் என்ற நூலின் கடைசிப் பாகமான ரிட்டர்ன் ஆஃப் த கிங் வெளியிடப்பட்டது");
                        break;
                    case 21:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச ஆப்பிள் தினம்");
                        arrayList.add("1833 - நோபல் பரிசை ஆரம்பித்த ஆல்பிரட் நோபல் பிறந்த தினம்");
                        arrayList.add("1835 - கர்நாடக இசை மும்மூர்த்திகளில் ஒருவரான முத்துசுவாமி தீட்சிதர் இறந்த தினம்");
                        arrayList.add("1945 - பிரான்சில் முதல் முறையாக பெண்களுக்கு வாக்குரிமை வழங்கப்பட்டது");
                        arrayList.add("2003 - குறுங்கோள் ஏரிசின் படங்கள் எடுக்கப்பட்டன");
                        break;
                    case 22:
                        arrayList.add("1828 - இந்திய விடுதலை போராட்ட வீராங்கனை ஜான்சிராணி லட்சுமிபாய் பிறந்த தினம்");
                        arrayList.add("1925 - தமிழக எழுத்தாளர் அ.மாதவையா இறந்த தினம்");
                        arrayList.add("1965 - இந்தியா, பாகிஸ்தான் இடையேயான 2ம் காஷ்மீர் போர் முடிவுக்கு வந்தது");
                        arrayList.add("1953 - லாவோஸ், பிரான்சிடம் இருந்து விடுதலை அடைந்தது");
                        arrayList.add("1924 - பன்னாட்டு டோஸ்ட்மாஸ்டர்ஸ் நிறுவனம் ஆரம்பிக்கப்பட்டது");
                        break;
                    case 23:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஹங்கேரி தேசிய தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - இயற்பியல், மோல் தினம்");
                        arrayList.add("1946 - ஐ.நா., பொது சபையின் முதலாவது கூட்டத் தொடர் நியூயார்க் நகரில் ஆரம்பமாயிற்று");
                        arrayList.add("2014 - கனடா பார்லிமென்டில் மர்ம நபர்கள் துப்பாக்கிச்சூடு நடத்திய தினம் இன்று");
                        arrayList.add("2011 - துருக்கியில் பயங்கர நிலநடுக்கம் ஏற்பட்டு  ஏரளாமான உயிர்சேதம் ஏற்பட்ட தினம்.");
                        break;
                    case 24:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஐக்கிய நாடுகள் தினம்");
                        arrayList.add("1964 - ஜாம்பியா விடுதலை தினம்");
                        arrayList.add("1945 - ஐக்கிய நாடுகள் நிறுவனம் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1917 - ரஷ்யாவில் அக்டோபர் புரட்சி இடம்பெற்றது");
                        arrayList.add("1857 - உலகின் முதலாவது கால்பந்தாட்ட அணியான ஷெஃபீல்ட் கால்பந்து அணி இங்கிலாந்தில் ஆரம்பிக்கப்பட்டது");
                        break;
                    case 25:
                        arrayList.add("1990 - கசகிஸ்தான் குடியரசு தினம்");
                        arrayList.add("2001 - விண்டோஸ் எக்ஸ்பி வெளியிடப்பட்டது");
                        arrayList.add("2001 - இந்தியாவில் தடா சட்டத்திற்கு பதிலாக பொடா ‌என்ற பயங்கரவாத தடுப்பு சட்டம் கொண்டு வரப்பட்டது");
                        arrayList.add("1924 - இந்தியாவில் சுபாஷ் சந்திர போஸ், பிரிட்டானியர்களால் சிறைப்பிடிக்கப்பட்டார்");
                        arrayList.add("1936 - ஹிட்லர் மற்றும் முசோலினி இணைந்து ரோம்-பெர்லின் அச்சு என்ற கூட்டமைப்பை ஏற்படுத்தினர்");
                        break;
                    case 26:
                        arrayList.add("1955 - ஆஸ்திரியா தேசிய தினம்");
                        arrayList.add("1905 - நார்வே, சுவீடனிடம் இருந்து விடுதலை பெற்றது");
                        arrayList.add("1977 - உலக சுகாதார அமைப்பால் பெரியம்மை கடைசி நாள் என இந்நாள் அறிவிக்கப்பட்டது");
                        arrayList.add("1977 - உலக சுகாதார அமைப்பால் பெரியம்மை கடைசி நாள் என இந்நாள் அறிவிக்கப்பட்டது");
                        arrayList.add("2001 - அமெரிக்கா, அமெரிக்க தேசப் பற்று சட்டத்தை நிறைவேற்றியது");
                        break;
                    case 27:
                        arrayList.add("1920 - இந்தியாவின் 10வது குடியரசுத் தலைவர் கே.ஆர்.நாராயணன் பிறந்த தினம்");
                        arrayList.add("1977 - இலங்கை கிரிக்கெட் வீரர் குமார சங்ககாரா பிறந்த தினம்");
                        arrayList.add("1682 - பென்சில்வேனியாவின் பிலடெல்பியா நகரம் அமைக்கப்பட்டது");
                        arrayList.add("1961 - நாசா தனது முதலாவது சட்டர்ன் 1 விண்கலத்தை விண்ணுக்கு ஏவியது");
                        arrayList.add("1605 - முகலாய மன்னன் அக்பர் பிறந்த  தினம்");
                        break;
                    case 28:
                        arrayList.add("1918 - செக் குடியரசு தேசிய தினம்");
                        arrayList.add("1955 - மைக்ரோ சாஃப்ட் நிறுவனர் பில் கேட்ஸ் பிறந்த தினம்");
                        arrayList.add("1918 - மேற்கு கலீசியாவில் புதிய போலந்து அரசு அமைக்கப்பட்டது");
                        arrayList.add("1942 - கனடா முதல் அலாஸ்கா வரையிலான அலாஸ்கா நெடுஞ்சாலை அமைக்கப்பட்டது");
                        arrayList.add("1972 - முதலாவது ஏர்பஸ் ஏ300 பறக்க விடப்பட்டது");
                        break;
                    case 29:
                        arrayList.add("1923 - துருக்கி குடியசு தினம்");
                        arrayList.add("1985 - இந்திய குத்துச் சண்டை வீரர் விஜேந்தர் குமார் பிறந்த தினம்");
                        arrayList.add("1863 - சுவிட்சர்லாந்தில் கூடிய 16 நாடுகளின் பிரதிநிதிகள் சர்வதேச செஞ்சிலுவை சங்கத்தை அமைக்க தீர்மானித்தனர்");
                        arrayList.add("1961 - ஐக்கிய அரபுக் குடியரசில் இருந்து சிரியா வெளியேறியது");
                        arrayList.add("1964 - தங்கனிக்கா மற்றும் சன்சிபார் இணைந்து தான்சானியா குடியரசு ஆகியது");
                        break;
                    case 30:
                        arrayList.add("1908 - இந்திய விடுதலை போராட்ட வீரர் முத்துராமலிங்கத் தேவர் பிறந்த தினம்");
                        arrayList.add("1963 - இந்திய விடுதலைப் போராட்ட வீரர் முத்துராமலிங்கத் தேவர் இறந்த தினம்");
                        arrayList.add("1945 - இந்தியா ஐநாவில் இணைந்தது");
                        arrayList.add("1925 - ஜான் லோகி பயர்ட், பிரிட்டானியாவின் முதலாவது தொலைக்காட்சி ஒளிபரப்பியை அமைத்தார்");
                        arrayList.add("1991 - மத்திய கிழக்கு அமைதி மாநாடு மாட்ரிட் நகரில் ஆரம்பமானது");
                        break;
                    case 31:
                        arrayList.add("1875 - இந்திய விடுதலைப் போராட்ட வீரர் வல்லபாய் பட்டேல் பிறந்த தினம்");
                        arrayList.add("1984 - இந்திய முன்னாள் பிரதமர் இந்திரா இறந்த தினம்");
                        arrayList.add("1969 - வோல் மார்ட் தொடங்கப்பட்டது");
                        arrayList.add("1931 - தமிழின் முதல் பேசும் படம் காளிதாஸ் வெளியிடப்பட்டது");
                        arrayList.add("1924 - உலக சேமிப்பு நாள், இத்தாலியின் மிலானோ நகரில் சேமிப்பு வங்கிகளின் உலக அமைப்பினால் அறிவிக்கப்பட்டது");
                        break;
                }
                break;
            case 10:
                switch (i2) {
                    case 1:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அல்ஜிரியா தேசிய நாள்");
                        arrayList.add("1998 - மனித உரிமைகளுக்கான ஐரோப்பிய நீதிமன்றம் அமைக்கப்பட்டது");
                        arrayList.add("1956 - இந்தியாவில் மைசூர், கேரளம், மதராஸ் ஆகிய மாநிலங்கள் உருவாக்கப்பட்டன");
                        arrayList.add("1954 - புதுச்சேரி, பிரெஞ்சு ஆதிக்கத்திலிருந்து விடுதலை பெற்று இந்தியாவுடன் இணைந்தது");
                        arrayList.add("2011 - யுனெஸ்கோவில் பாலஸ்தீனம் முழு நேர உறுப்பினராக தேர்வு செய்யப்பட்டதற்கு அமெரிக்கா மற்றும் இஸ்ரேல் ஆகிய நாடுகள்  கடும் எதிர்ப்பு தெரிவித்த தினம் இன்று");
                        break;
                    case 2:
                        arrayList.add("1936 - பிபிசி நிறுவனம் தொலைக்காட்சி சேவையை ஆரம்பித்தது");
                        arrayList.add("1936 - கனடிய ஒலிபரப்பு கூட்டுத்தாபனம் நிறுவப்பட்டது");
                        arrayList.add("1868 - நியூசிலாந்து, சீர் நேரத்தை நாடு முழுவதும் அறிமுகப்படுத்தியது");
                        arrayList.add("2013 - பாகிஸ்தான், ஆப்கன் , அமெரிக்கா உள்ளிட்ட பல்வேறு இடங்களில் குண்டு வெடிப்புகளை நடத்தியதில் பங்கு கொண்ட பாக்., தலிபான் பயங்கரவாதி ஹக்கிமுல்லா மசூத் அமெரிக்க படையினரின் குண்டு மழையில் கொல்லப்பட்டான்.");
                        arrayList.add("2012 - ஆந்திர மாநில தெலுங்கு தேச கட்சியின் மூத்த தலைவரான எர்ரான்நாயுடு ( வயது 55) இன்று அகால மரணமடைந்தார்.");
                        break;
                    case 3:
                        arrayList.add("1903 - பனாமா விடுதலை நாள்");
                        arrayList.add("1933 - இந்திய பொருளாதார நிபுணர் அமர்த்தியா சென் பிறந்த தினம்");
                        arrayList.add("1911 - தமிழில் பயண இலக்கியத்தின் முன்னோடி ஏ.கே.செட்டியார் பிறந்த தினம்");
                        arrayList.add("1913 - அமெரிக்கா, வருமான வரியை அறிமுகப்படுத்தியது");
                        arrayList.add("1838 - பாம்பே டைம்ஸ் பத்திரிக்கை முதன் முதலில் வெளியிடப்பட்டது");
                        break;
                    case 4:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பனாமா கொடி நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ரஷ்யா, மக்கள் ஒற்றுமை தினம்");
                        arrayList.add("1861 - வாஷிங்டன் பல்கலைக்கழகம் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1869 - அறிவியல் இதழான நேச்சர் முதல் முறையாக வெளியிடப்பட்டது");
                        arrayList.add("1914 - பிரிட்டனும் பிரான்சும் துருக்கியுடன் போரை அறிவித்தன");
                        break;
                    case 5:
                        arrayList.add("1870 - இந்திய விடுதலைப் போராட்ட வீரர் சித்ரஞ்சன் தாஸ் பிறந்த தினம்");
                        arrayList.add("1971 - இன்ரெல் நிறுவனம், உலகின் முதல் நுண்செயலியான 4004 இனை வெளியிட்டது");
                        arrayList.add("1895 - தானுந்தின் முதலாவது அமெரிக்க காப்புரிமத்தை ஜார்ஜ் செல்டன் பெற்றார்");
                        arrayList.add("1913 - ஐக்கிய ராஜ்ஜியம், சைப்பிரசை ‌தன்னுடன் இணைத்துக் கொண்டது");
                        arrayList.add("2013 - மங்கள்யான் செயற்கைகோள் சரியாக 2. 38 மணிக்கு , ஸ்ரீஹரிகோட்டாவில் இருந்து பி,எஸ்.எல்.வி., ராக்கெட் மூலம் ஏவப்பட்டது.");
                        break;
                    case 6:
                        arrayList.add("1994 - தஜிகிஸ்தான் அரசியலமைப்பு தினம்");
                        arrayList.add("1844 - டொமினிக்கன் குடியரசின் முதலாவது அரசியலமைப்பு கொண்டு வரப்பட்டது");
                        arrayList.add("1935 - எட்வின் ஆம்ஸ்ட்ராங், பண்பலை ஒலிபரப்பு பற்றிய ஆய்வை வெளியிட்டார்");
                        arrayList.add("1944 - புளூட்டோனியம் முதல் முறையாக உருவாக்கப்பட்டது");
                        arrayList.add("1913 - தென்னாப்பிரிக்காவில் மகாத்மா காந்தி, இந்திய சுரங்கத் தொழிலாளர்களுடன் சேர்ந்து போராட்டத்தில் ஈடுபட்டபோது கைது செய்யப்பட்டார்");
                        break;
                    case 7:
                        arrayList.add("1867 - போலந்து மற்றும் பிரஞ்சு வேதியியல் அறிஞர் மேரி க்யூரி பிறந்த தினம்");
                        arrayList.add("1993 - ஆன்மிகவாதி கிருபானந்த வாரியார் இறந்த தினம்");
                        arrayList.add("1893 - கொலரடோ மாநிலத்தில் பெண்களுக்கு வாக்குரிமை வழங்கப்பட்டது");
                        arrayList.add("1910 - உலகின் முதலாவது விமானத் தபால் பொதிச் சேவை, ரைட் சகோதரர்களால் ஒகையோவில் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("2002 - அமெரிக்க பொருட்களின் விளம்பரங்களை அறிவிக்க ஈரான் தடை செய்தது");
                        break;
                    case 8:
                        arrayList.add("1680 - இத்தாலிய தமிழறிஞர் வீரமா முனிவர் பிறந்த தினம்");
                        arrayList.add("1927 - இந்திய அரசியல்வாதி லால் கிருஷ்ண அத்வானி பிறந்த தினம்");
                        arrayList.add("1889 - மொன்டானா, அமெரிக்காவின் 41வது மாநிலமாக இணைந்தது");
                        arrayList.add("1895 - வில்ஹெம் ராண்ட்ஜன், எக்ஸ் கதிர்களைக் கண்டுபிடித்தார்");
                        arrayList.add("1965 - பி்ரிட்டானிய இந்தியப் பெருங்கடல் மண்டலம் அமைக்கப்பட்டது");
                        break;
                    case 9:
                        arrayList.add("1953 - கம்போடியா விடுதலை தினம்");
                        arrayList.add("2005 - இந்திய முன்னாள் ஜனாதிபதி கே.ஆர்.நாராயணன் இறந்த தினம்");
                        arrayList.add("2000 - உத்ராஞ்சல் மாநிலம், இந்தியாவின் உத்திர பிரதேச மாநிலத்தில் இருந்து பிரிக்கப்பட்டது");
                        arrayList.add("2014 - 2000 கி.மீ.,க்கும் அதிகமான தூரத்தை கடந்து சென்று தாக்கும் திறன் கொண்ட அதிநவீன ஏவுகணையான அக்னி 2 ஏவுகணையை இந்திய ராணுவம் இன்று வெற்றிகரமாக சோதனை செய்தது.");
                        arrayList.add("2010 - கோவை நகரில் ஒரே குடும்பத்தைச் சேர்ந்த தனியார் பள்ளி குழந்தைகள் இருவரை கடத்தி, பாலியல் பலாத்காரத்துக்கு பின் வாய்க்காலில் தள்ளி ஈவு இரக்கமின்றி கொன்ற கொடூர கொலைகாரன் மோகன்ராஜ் என்ற மோகனகிருஷ்ணன்  என்கவுன்டரில் சுட்டுக் கொல்லப்பட்டான்.");
                        break;
                    case 10:
                        arrayList.add("1483 - புரட்டஸ்தாந்த் மதகுரு மார்ட்டின் லூதர் பிறந்த தினம்");
                        arrayList.add("2006 - தமிழ்த் தேசியக் கூட்டமைப்பு பாராளுமன்ற உறுப்பினர் நடராஜா ரவிராஜ் இறந்த தினம்");
                        arrayList.add("1674 - வெஸ்ட்மின்ஸ்டர் உடன்பாட்டின்படி நெதர்லாந்து இங்கிலாந்திடம் ஒப்படைக்கப்பட்டது");
                        arrayList.add("1674 - வெஸ்ட்மின்ஸ்டர் உடன்பாட்டின்படி நெதர்லாந்து இங்கிலாந்திடம் ஒப்படைக்கப்பட்டது");
                        arrayList.add("1970 - சோவியத்தின் லூனா 17 விண்கப்பல் சந்திரனுக்கு 'லூனாகோட்' எனப்பட்டும் தானியங்கி ஊர்தியை கொண்டு சென்றது");
                        break;
                    case 11:
                        arrayList.add("1918 - போலந்து விடுதலை தினம்");
                        arrayList.add("1975 - அங்கோலா விடுதலை தினம்");
                        arrayList.add("1966 - நாசா, ஜெமினி 12 கப்பலை விண்ணுக்கு அனுப்பியது");
                        arrayList.add("1889 - வாஷிங்டன், அமெரிக்காவின் 42வது மாநிலமாக இணைக்கப்பட்டது");
                        arrayList.add("1930 - ஆல்பர்ட் ஐன்ஸ்டீன், லியோ சிலார்ட் ஆகியோர் தமது கண்டுபிடிப்பான குளிர்சாதனப் பெட்டிக்கான காப்புரிமத்தை பெற்றனர்");
                        break;
                    case 12:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அஸர்பைஜான் அரசியலமைப்பு தினம்");
                        arrayList.add("1918 - ஆஸ்திரியா குடியரசு தினம்");
                        arrayList.add("1927 - மகாத்மா காந்தி தனது முதல் இலங்கை பயணத்தை மேற்கொண்டார்");
                        arrayList.add("1990 - இணைய வலை பற்றிய தனது முதலாவது திட்டத்தை ரிம் பேர்னேர்ஸ்-லீ அறிவித்தார்");
                        arrayList.add("1980 - நாசாவின் விண்கப்பல் வொயேஜர் 1 சனிக் ‌கோளுக்கு மிக அருகில் சென்று அதன் வளையங்களின் படங்களை பூமிக்கு அனுப்பியது");
                        break;
                    case 13:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச இரக்கம் உடையோர் தினம்");
                        arrayList.add("1990 - உலக வலைப் பின்னல்(WWW) ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1994 - ஐரோப்பிய ஒன்றியத்தில் இணைய ஸ்வீடன் மக்கள் முடிவு செய்தனர்");
                        arrayList.add("1864 - க்ரீசின் புதிய அரசியலமைப்பு பெறப்பட்டது");
                        arrayList.add("1947 - ரஷ்யா முதல்முறையாக ஏ.கே.47 ரக துப்பாக்கிகளை வடிவமைத்தது");
                        break;
                    case 14:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக நீரிழிவு நோய் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - இந்தியா குழந்தைகள் தினம்");
                        arrayList.add("1996 - டாக்டர் அம்பேத்கார் சட்டப் பல்கலைக்கழகம் அமைக்கப்பட்டது");
                        arrayList.add("1918 - செக்கோஸ்லாவாக்கியா குடியரசானது");
                        arrayList.add("1922 - பிபிசி தனது வானொலி சேவையை ஐக்கிய ராஜ்யத்தில் தொடங்கியது");
                        break;
                    case 15:
                        arrayList.add("1889 - பிரேசில் குடியரசு தினம்");
                        arrayList.add("1988 - பாலஸ்தீன விடுதலை தினம்");
                        arrayList.add("1982 - இந்திய சுதந்திர போராட்ட தியாகி வினோபா பாவே இறந்த தினம்");
                        arrayList.add("2000 - இந்தியாவில் ஜார்க்கண்ட் தனிமாநிலமாக உருவாக்கப்பட்டது");
                        arrayList.add("1971 - இண்டெல் நிறுவனம் உலகின் வர்த்தகரீதியிலான முதலாவது 4004 என்ற சிங்கிள் சிப் மைக்ரோ புரோசாஷரை வெளியிட்டது");
                        break;
                    case 16:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக சகிப்புத் தன்மை தினம்");
                        arrayList.add("1945 - யுனெஸ்கோ நிறுவனம் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1846 - இலங்கையில் விதவைகள் மற்றும் அனாதைகள் ஓய்வூதியத் திட்டம் அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("2013 - கிரிக்கெட்டில் இருந்து ஓய்வு பெற்ற நட்சத்திர கிரிக்கெட் வீரர் சச்சினுக்கு மத்திய அரசு இன்று மாலை பாரதரத்னா விருதை வழங்கி கவுவரவித்தது.");
                        arrayList.add("2014 - இலங்கைக்கு எதிரான ஐந்தாவது ஒருநாள் போட்டியில் கேப்டன் விராத் கோஹ்லி சதம் அடித்து கைகொடுக்க, இந்திய அணி 3 விக்கெட் வித்தியாசத்தில் வெற்றி பெற்ற தினம்");
                        break;
                    case 17:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச மாணவர் தினம்");
                        arrayList.add("1869 - எகிப்தில் சூயஸ் கால்வாய் திறக்கப்பட்டது");
                        arrayList.add("1970 - டக்லஸ் ஏங்கெல்பேர்ட் முதலாவது கணினி மவுஸ்க்கான காப்புரிமம் பெற்றார்");
                        arrayList.add("1873 - பெஸ்ட், பூடா மற்றும் ஓபுடா ஆகிய நகரங்கள் இணைக்கப்பட்ட புடாபெஸ்ட் நகரம் ஹங்கேரியின் தலைநகராக்கப்பட்டது");
                        arrayList.add("1933 - அமெரிக்கா சோவியத் ஒன்றியத்தை அங்கீகரித்தது");
                        break;
                    case 18:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஏமன் தேசிய தினம்");
                        arrayList.add("1918 - லாத்வியா விடுதலை தினம்");
                        arrayList.add("1936 - தமிழக சுதந்திர போராட்ட தியாகி வ.உ.சிதம்பரம்பி்ள்ளை இறந்த தினம்");
                        arrayList.add("2014 - தெலுங்கானாவில், வறட்சி யால், விவசாயிகள் தற்கொலை அதிகரித்து வரும் நிலையில், மாநில முதல்வர் சந்திரசேகர ராவ், எம்.எல்.ஏ.,க்களுக்கு 100 சதவீத சம்பள உயர்வை அறிவித்ததர்க்குக்  கடும் கண்டனம் தெரிவிக்கப்பட்ட தினம்.");
                        arrayList.add("2014 - ஊதியம் ஒத்து வராத காரணத்தினால் இந்திய ஹாக்கி அணி பயிற்சியாளர் பதவியிலிருந்து டெர்ரி வால்ஷ் திடீரென விலகினார்.");
                        break;
                    case 19:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச ஆண்கள் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - மாலி விடுதலை நாள்");
                        arrayList.add("1917 - இந்திய முன்னாள் பிரதமர் இந்திரா பிறந்த தினம்");
                        arrayList.add("1816 - வார்சா பல்கலைக்கழகம் அமைக்கப்பட்டது");
                        arrayList.add("1946 - ஆப்கானிஸ்தான், ஐஸ்லாந்து, ஸ்வீடன் ஆகியன ஐ.நா.,வில் இணைந்தன");
                        break;
                    case 20:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - யுனிசெஃப் குழந்தைகள் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - வியட்நாம் ஆசிரியர் தினம்");
                        arrayList.add("1985 - மைக்ரோ சாப்டின் விண்டோஸ் 1.0 வெளியிடப்பட்டது");
                        arrayList.add("1917 - உக்ரன் குடியரசாக அறிவிக்கப்பட்டது");
                        arrayList.add("1923 - ஜெர்மனியின் நாணயம் பேப்ரியர்மார்க், ரெண்டென்மார்க் ஆக மாற்றப்பட்டது");
                        break;
                    case 21:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - உலக தொலைக்காட்சி தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - வங்காள தேசம் ராணுவத்தினர் தினம்");
                        arrayList.add("1942 - அலாஸ்கா நெடுஞ்சாலை திறக்கப்பட்டது");
                        arrayList.add("1963 - பாரதத்தின் முதல் ஈரடுக்கு உளவு ஏவுகணை நைக்-அபாச்சி ஏவப்பட்டது");
                        arrayList.add("1969 - முதலாவது ஆர்ப்ப‌நெட் தொடர்பு ஏற்படுத்தப்பட்டது");
                        break;
                    case 22:
                        arrayList.add("1943 - லெபனான் விடுதலை நாள்");
                        arrayList.add("1939 - இந்திய அரசியல் தலைவர் முலாயம் சிங் யாதவ் பிறந்த தினம்");
                        arrayList.add("2005 - எக்ஸ் பாக்ஸ் 360 நிகழ்பட விளையாட்டு இயந்திரம் வெளியிடப்பட்டது");
                        arrayList.add("1908 - அல்பேனிய எழுத்துக்கள் அறிமுகப்படுத்தப்பட்டது");
                        arrayList.add("1574 - சிலியின் ஜூவான் பெர்னாண்டஸ் தீவுகள் கண்டுபிடிக்கப்பட்டன");
                        break;
                    case 23:
                        arrayList.add("1926 - இந்திய ஆன்மிகவாதி சத்திய சாய்பாபா பிறந்த தினம்");
                        arrayList.add("1921 - கவிஞர் சுரதா பிறந்த தினம்");
                        arrayList.add("2007 - தமிழகத்தில் அரியலூர் மாவட்டம் உருவாக்கப்பட்டது");
                        arrayList.add("1936 - முதலாவது லைஃப் இதழ் வெளியிடப்பட்டது");
                        arrayList.add("1955 - கொக்கோஸ் தீவுகள் ஐக்கிய ராஜ்யத்திடம் இருந்து ஆஸ்திரேலியாவுக்கு கைமாறியது");
                        break;
                    case 24:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - துருக்கி ஆசிரியர் தினம்");
                        arrayList.add("1961 - இந்திய பெண் எழுத்தாளர் அருந்ததி ராய் பிறந்த தினம்");
                        arrayList.add("1859 - சார்லஸ் டார்வினின் உயிரினங்களின் தோற்றம் என்ற நூல் வெளியிடப்பட்டது");
                        arrayList.add("1914 - முசோலினி இத்தாலிய சோசலிசக் கட்சியில் இருந்து விலக்கப்பட்டார்");
                        arrayList.add("1642 - ஏபல் டாஸ்மான் வான், டீமனின் நிலம் என்ற தீவைக் கண்டுபிடித்தார். இது பின்னர் தாஸ்மானியா எனப் பெயர் பெற்றது");
                        break;
                    case 25:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச பெண்களுக்கு எதிரான வன்கொடுமை எதிர்ப்பு தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - இந்தோனேஷியா ஆசிரியர் தினம்");
                        arrayList.add("1975 - சுரிநாம் விடுதலை நாள்");
                        arrayList.add("1867 - ஆல்பிரட் நோபல் டைனமைட்டுக்கு காப்புரிமம் பெற்றார்");
                        arrayList.add("1952 - அகதா கிறிஸ்டியின் மேடை நாடகமான தி மெளஸ்ட்றப் திரைப்படமாக வெளிவந்தது");
                        break;
                    case 26:
                        arrayList.add("1949 - இந்தியாவின் அரசியலமைப்புச் சட்டம் நடைமுறைக்கு வந்தது");
                        arrayList.add("1842 - நோட்ரெ டேம் பல்கலைக்கழகம் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("2002 - இந்தியாவின் நாகாலாந்து மாநிலத்தில் தனிநாடு ‌கோரும் அமைப்புக்களின் மீதான தடை நீக்கப்பட்டது");
                        arrayList.add("2001 - நேபாளத்தில் மன்னர் கயனேந்திரா அவசரகாலச் சட்டத்தை பிறப்பித்தார்");
                        arrayList.add("1957 - ஜாதியை பாதுகாக்கும் இந்திய அரசியல் சட்டப் பிரிவுகளைத் தீயிடும் போராட்டத்தை தந்தை பெரியார் ஆரம்பித்து வைத்தார்");
                        break;
                    case 27:
                        arrayList.add("1940 - தற்காப்புக்கலை நிபுணரும், நடிகருமான புரூஸ் லீ பிறந்த தினம்");
                        arrayList.add("2008 - இந்திய முன்னாள் பிரதமர் வி.பி.சிங் இறந்த தினம்");
                        arrayList.add("1815 - போலந்து அரசியலமைப்பு சட்டம் பெறப்பட்டது");
                        arrayList.add("1901 - அமெரிக்க ராணுவ போர் கல்லூரி துவங்கப்பட்டது");
                        arrayList.add("2001 - ஹபிள் விண்வெளித் தொலைநோக்கி மூலம் ஓசிரிஸ் கோளில் ஆவியாகக்கூடிய நிலையில் ஐதரசன் மண்டலம் கண்டுபிடிக்கப்பட்டது");
                        break;
                    case 28:
                        arrayList.add("1912 - அல்பேனியா விடுதலை தினம்");
                        arrayList.add("1960 - மவுரித்தேனியா விடுதலை நாள்");
                        arrayList.add("1939 - கூடைப்பந்து கண்டுபிடிப்பாளர் ஜேம்ஸ் நெய்ஸ்மித் இறந்த தினம்");
                        arrayList.add("1821 - பனாமா ஸ்பெயினிடம் இருந்து பிரிந்து பாரிய கொலம்பியாவுடன் இணைந்தது");
                        arrayList.add("2006 - நாசாவின் நியூ ஹரைசன்ஸ் தானியங்கி விண்கலம் புளூட்டோவின் முதலாவது படத்தை அனுப்பியது");
                        break;
                    case 29:
                        arrayList.add("1855 - துருக்கியில் தாதியர் பயிற்சிக்காக புளோரன்ஸ் நைட்டிங்கேல் நிதியம் நிறுவப்பட்டது");
                        arrayList.add("1993 - இந்தியாவின் பிரபல தொழிலதிபர் ஜே.ஆர்.டி.டாடா இறந்த தினம்");
                        arrayList.add("1947 - பாலஸ்தீனத்தை பிரிப்பதென ஐநா பொதுச் சபை முடிவு செய்தது");
                        arrayList.add("1945 - யுகொஸ்லாவிய சமஷ்டி மக்கள் குடியரசு அமைக்கப்பட்டது");
                        arrayList.add("1945 - யுகொஸ்லாவிய சமஷ்டி மக்கள் குடியரசு அமைக்கப்பட்டது");
                        break;
                    case 30:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஸ்காட்லாந்து தேசிய தினம்");
                        arrayList.add("1966 - பார்போடஸ் விடுதலை தினம்");
                        arrayList.add("1858 - இந்தியாவின் முதல் விண்ணலை அறிவியலாளர் ஜகதிஷ் சந்திர போஸ் பிறந்த தினம்");
                        arrayList.add("1995 - வளைகுடா போர் முடிவுக்கு வந்தது");
                        arrayList.add("1872 - உலகின் முதலாவது சர்வதேச கால்பந்து போட்டி கிளாஸ்கோவில் நடைபெற்றது");
                        break;
                }
                break;
            case 11:
                switch (i2) {
                    case 1:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச எய்ட்ஸ் தினம்");
                        arrayList.add("1965 - இந்தியாவில் எல்லைக் காவல்படை அமைக்கப்பட்டது");
                        arrayList.add("1963 - நாகாலாந்து இந்தியாவின் 16வது மாநிலமானது");
                        arrayList.add("1990 - இந்திய பெண் சுதந்திர போராட்ட தியாகி விஜயலட்சுமி பண்டிட் இறந்த தினம்");
                        arrayList.add("1958 - பிரான்சிடம் இருந்து மத்திய ஆப்பிரிக்க குடியரசு விடுதலை பெற்றது");
                        break;
                    case 2:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - லாவோஸ் தேசிய தினம்");
                        arrayList.add("1971 - ஐக்கிய அரபு அமீரகத்தின் தேசிய தினம்");
                        arrayList.add("1910 - இந்தியாவின் 8வது ஜனாதிபதி ரா.வெங்கட்ராமன் பிறந்த தினம்");
                        arrayList.add("2014 - அணு ஆயுதத்தை சுமந்து சென்று இலக்கை தாக்கும் திறன் உடைய அக்னி - 4 ஏவுகணை சோதனை, மீண்டும் இன்று  வெற்றி கரமாக நடந்தது.");
                        arrayList.add("2010 - பிரமோஸ் சூப்பர்சோனிக் ஏவுகணை ஒரிசா மாநிலம் சந்திப்பூரில் இருந்து வெற்றிகரமாக ஏவி சோதனை செய்யப்பட்டது.");
                        break;
                    case 3:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச மாற்றுதிறனாளிகள் தினம்");
                        arrayList.add("1884 - இந்தியாவின் முதலாவது ஜனாதிபதி ராஜேந்திர பிரசாத் பிறந்த தினம்");
                        arrayList.add("1795 - நவீன அஞ்சல் சேவையை கண்டுபிடித்த ரோலண்ட் ஹில் பிறந்த தினம்");
                        arrayList.add("1984 - இந்தியாவின் போபால் நகரில் விஷவாயு விபத்து நடைபெற்ற தினம்");
                        arrayList.add("1818 - இலினோய் அமெரிக்காவின் 21வது மாநிலமானது");
                        break;
                    case 4:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - இந்திய கடற்படை தினம்");
                        arrayList.add("1919 - இந்தியாவின் 15வது பிரதமர் ஐ.கே.குஜ்ரால் பிறந்த தினம்");
                        arrayList.add("1791 - உலகின் முதலாவது ஞாயிறு இதழான தி ஒப்சேர்வரினின் முதலாவது இதழ் வெளிவந்தது");
                        arrayList.add("2013 - காஷ்மீர் பிரச்னையால், இந்தியாவுக்கும், பாகிஸ்தானுக்கும் இடையே, எந்த நேரத்தில் வேண்டுமானாலும், போர் நடக்க வாய்ப்புள்ளது' என, பாகிஸ்தான் பிரதமர், நவாஸ் ஷெரீப் 'டான்' பத்திரிக்கையில் தெரிவித்த தினம்.");
                        arrayList.add("2011 - இந்தியாவுக்கு யுரேனியம் வழங்குவது தொடர்பாக ஆஸ்திரேலியா ஆளும் கட்சியில் நடந்த ஒட்டெடுப்பில் இந்தியாவுக்கு ஆதரவாக ஒட்டளிக்கப்பட்டது.");
                        break;
                    case 5:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - தாய்லாந்தில் தேசிய தினம் மற்றும் தந்தையர் தினம்");
                        arrayList.add("1901 - உலகப் புகழ் பெற்ற ஓவியர் வால்ட் டிஸ்னி பிறந்த தினம்");
                        arrayList.add("1954 - தமிழ் எழுத்தாளர் கல்வி கிருஷ்ணமூர்த்தி இறந்த தினம்");
                        arrayList.add("1893 - மின்சாரத்தில் இயங்கும் தானுந்து அறிமுகமானது");
                        arrayList.add("1896 - சென்னை கன்னிமாரா பொது நூலகம் மக்களுக்காகத் திறந்து விடப்பட்டது");
                        break;
                    case 6:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஸ்பெயின் அரசியல் சாசன தினம்");
                        arrayList.add("1917 - பின்லாந்து விடுதலை தினம்");
                        arrayList.add("1922 - ஐரிய சுதந்திர நாடு உருவானது");
                        arrayList.add("1897 - வாடகை வாகனம் உலகில் முதல் முறையாக லண்டனில் சேவைக்கு விடப்பட்டது");
                        arrayList.add("2011 - உலகம் முழுவதும் இன்று மொகரம் பண்டிகை கொண்டாடப்பட்ட நாளில் ஆப்கனில் நடந்த குண்டு வெடிப்பில் சிக்கி 54 பேர் பலியாயினர்.");
                        break;
                    case 7:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - இந்தியா கொடி நாள்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஈரான் மாணவர்கள் தினம்");
                        arrayList.add("1787 - டெலவெயர் அமெரிக்காவின் முதல் மாநிலமாக இணைந்தது");
                        arrayList.add("2014 - பிரெஞ்ச் கயானாவிலிருந்து ஏவப்பட்ட ஜிசாட் 16 செயற்கைகோள் விண்ணில் வெற்றிகரமாக சீறிப் பாய்ந்தது.");
                        arrayList.add("2012 - காவிரியில் தண்ணீர் தர மறுக்கும், கர்நாடக அரசை கண்டித்தும், கர்நாடகத்திடம் இருந்து தண்ணீர் பெற்றுத்தர மத்திய அரசை வலியுறுத்தியும், டெல்டா மாவட்டங்களில், முழு கடையடைப்பு மற்றும் ரயில், பஸ் மறியல் போராட்டம் நடந்தது.");
                        break;
                    case 8:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பனாமா அன்னையர் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பல்கேரியா மாணவர் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ருமேனியா அரசியல் சாசன தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஸ்பெயின் தேசிய ராணுவ தினம்");
                        arrayList.add("1864 - இங்கிலாந்தில் கிளிஃப்டன் தொங்கு பாலம் திறக்கப்பட்டது");
                        break;
                    case 9:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - ஐ.நா., சபையின் சர்வதேச ஊழல் எதிர்ப்பு தினம்");
                        arrayList.add("1961 - தான்சானியா விடுதலை தினம்");
                        arrayList.add("1946 - இந்திய காங்கிரஸ் தலைவர் சோனியா பிறந்த தினம்");
                        arrayList.add("1946 - இந்திய சட்டசபை, ராஜேந்திர பிரசாத் தலைமையில் அமைக்கப்பட்டது");
                        arrayList.add("1793 - நியூயார்க் நகரின் முதலாவது நாளிதழ் தி அமெரிக்கன் மினேர்வா வெளியிடப்பட்டது");
                        break;
                    case 10:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - மனித உரிமைகள் தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - நோபல் பரிசு வழங்கும் தினம்");
                        arrayList.add("1878 - சுதந்திர இந்தியாவின் முதல் கவர்னர் ராஜாஜி பிறந்த தினம்");
                        arrayList.add("1896 - சுவீடன் கண்டுபிடிப்பாளர் ஆல்பிரட் நோபல் இறந்த தினம்");
                        arrayList.add("1902 - தாஸ்மேனியாவில் பெண்களுக்கு வாக்குரிமை வழங்கப்பட்டது");
                        break;
                    case 11:
                        arrayList.add("1882 - கவிஞர் சுப்பிரமணிய பாரதி பிறந்த தினம்");
                        arrayList.add("1931 - இந்திய ஆன்மிக தலைவர் ஓஷோ பிறந்த தினம்");
                        arrayList.add("2004 - கர்நாடக இசைக் கலைஞர் எம்.எஸ்.சுப்புலட்சுமி இறந்த தினம்");
                        arrayList.add("1816 - இந்தியானா அமெரிக்காவின் 19வது மாநிலமானது");
                        arrayList.add("2014 - ஸ்ரீபெரும்புதூர் சிறப்பு பொருளாதார மண்டலத்தில், நோக்கியா மொபைல் போன் ஆலையைத் தொடர்ந்து, 'பாக்ஸ்கான்' என்ற ஆலையும் இன்று மூடப்பட்டது . இதனால், இந்நிறுவனத்தின், 1,500 நேரடி தொழிலாளர்கள் வேலை இழக்கின்றனர்.");
                        break;
                    case 12:
                        arrayList.add("1963 - கென்யா விடுதலை தினம்");
                        arrayList.add("1981 - இந்திய கிரிக்கெட் வீரர் யுவராஜ் சிங் பிறந்த தினம்");
                        arrayList.add("1911 - இந்தியாவின் தலைநகரம் கல்கத்தாவில் இருந்து டெல்லிக்கு மாற்றப்பட்டது");
                        arrayList.add("1979 - ரொடீசியா, ஜிம்பாப்வே எனப் பெயர் மாற்றம் செய்யப்பட்டது");
                        arrayList.add("1787 - பென்சில்வேனியா, அமெரிக்காவின் 2வது மாநிலமானது");
                        break;
                    case 13:
                        arrayList.add("1974 - மோல்ட்டா குடியரசு தினம்");
                        arrayList.add("1987 - எழுத்தாளர் நா.பார்த்தசாரதி இறந்த தினம்");
                        arrayList.add("2006 - டால்ஃபின் அரிய வகை கடல் இனமாக அறிவிக்கப்பட்டது");
                        arrayList.add("1949 - இஸ்ரேல் சட்டசபையில் நாட்டின் தலைநகரை ஜெருசலேம் நகருக்கு மாற்ற முடிவெடுத்தது");
                        arrayList.add("2014 - கடந்த 2001 ல் பார்லி., மீது பயங்கரவாதிகள் தாக்குதல் நடத்திய 13 வது ஆண்டு நினைவு நாள் இன்று அனுஷ்டிக்கப்பட்டது.");
                        break;
                    case 14:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - இந்திய எரிபொருள் சேமிப்பு தினம்");
                        arrayList.add("1953 - இந்திய டென்னிஸ் வீரர் விஜய் அமிர்தராஜ் பிறந்த தினம்");
                        arrayList.add("1799 - அமெரிக்காவின் முதல் அரசு தலைவர் ஜார்ஜ் வாஷிங்டன் இறந்த தினம்");
                        arrayList.add("1946 - ஐ.நா.,வின் தலைமையகத்தை நியூயார்க் நகரில் அமைக்க முடிவு செய்யப்பட்டது");
                        arrayList.add("1819 - அலபாமா அமெரிக்காவின் 22வது மாநிலமானது");
                        break;
                    case 15:
                        arrayList.add("1891 - ஜேம்ஸ் நெய்ஸ்மித், கூடைபந்தாட்டத்தை முதன் முதலாக அறிமுகப்படுத்தினார்");
                        arrayList.add("1971 - இந்திய கோல்ஃப் விளையாட்டு வீரர் ஜீவ் மில்க்கா சிங் பிறந்த தினம்");
                        arrayList.add("1950 - இந்திய அரசியல் தலைவர் சர்தார் வல்லபாய் பட்டேல் இறந்த தினம்");
                        arrayList.add("1966 - பிரபல கார்ட்டூன் ஓவியர் வால்ட் டிஸ்னி இறந்த தினம்");
                        arrayList.add("1994 - இணைய உலாவி நெட்ஸ்கேப் நவிகேட்டர் 1.0 வெளியிடப்பட்டது");
                        break;
                    case 16:
                        arrayList.add("1971 - பக்ரைன் தேசிய தினம்");
                        arrayList.add("1991 - கசகிஸ்தான் விடுதலை நாள்");
                        arrayList.add("1971 - வங்காள தேசம் வெற்றி நாள்");
                        arrayList.add("2014 - காஷ்மீர் அணிக்கு எதிரான ரஞ்சி கோப்பை லீக் போட்டியில், தமிழக அணி 277 ரன்கள் வித்தியாசத்தில் வெற்றி பெற்றது.");
                        arrayList.add("2014 - பாகிஸ்தான் ராணுவ பள்ளியில் பயங்கரவாதிகள் பயங்கர ஆயுதங்களுடன் நுழைந்து சரமாரியாக சுட்டனர். இதில் 132 மாணவர்கள் உட்பட 141 பேர் சுட்டுக்கொல்லப்பட்டனர்.");
                        break;
                    case 17:
                        arrayList.add("1907 - பூட்டான் தேசிய தினம்");
                        arrayList.add("இன்றைய  முக்கியத்துவம் - அமெரிக்காவில் ரைட் சகோதரர்கள் தினம்");
                        arrayList.add("1834 - அயர்லாந்தின் முதலாவது தொடருந்து சேவை ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1989 - 25 ஆண்டுகளுக்கு பின் பிரேசிலில் முதலாவது பொதுத் தேர்தல் இடம்பெற்றது");
                        arrayList.add("1961 - கோவாவை இந்தியா, போர்ச்சுக்கலிடம் இருந்து கைப்பற்றியது");
                        break;
                    case 18:
                        arrayList.add("1997 - ஹச்.டி.எம்.‌எல் 4.0 வெளியிடப்பட்டது");
                        arrayList.add("1966 - சனி கோளின் சந்திரனான எப்பிமேத்தியஸ் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1787 - நியூஜெர்சி அமெரிக்காவின் 3வது மாநிலமாக இணைந்தது");
                        arrayList.add("1961 - இந்தோனேஷியா, டச்சு நியூ கினியை ஆக்கிரமித்தது");
                        arrayList.add("2014 - இந்தியாவின் அதிநவீன தொழில்நுட்ப திறன் வாய்ந்த ஜிஎஸ்எல்வி-மார்க் 3 ராக்கெட் இன்று காலை 9.30 மணிக்கு ஸ்ரீஹரிகோட்டாவில் இருந்து விண்ணில் வெற்றிகரமாக ஏவப்பட்டது.");
                        break;
                    case 19:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - கோவா விடுதலை தினம்");
                        arrayList.add("1934 - இந்திய ஜனாதிபதி பிரதிபா பாட்டீல் பிறந்த தினம்");
                        arrayList.add("1922 - தமிழக அரசியல் தலைவர் கே.அன்பழகன் பிறந்த தினம்");
                        arrayList.add("1997 - டைட்டானிக் திரைப்படம் வெளியிடப்பட்டது");
                        arrayList.add("1961 - டாமன்,டையூ பகுதிகளை இந்தியா தன்னுடன் இணைத்துக் கொண்டது");
                        break;
                    case 20:
                        arrayList.add("1943 - பொலிவியாவில் ராணுவப் புரட்சி நடந்தது");
                        arrayList.add("1955 - கார்டிஃப், வேல்சின் தலைநகரமாக அறிவிக்கப்பட்டது");
                        arrayList.add("1988 - போதைப் பொருள் கடத்தலுக்கெதிரான ஐநா சாசனம் வியன்னாவில் கையெழுத்தானது");
                        arrayList.add("1960 - வியட்நாம் விடுதலைக்கான தேசிய முன்னணி அமைக்கப்பட்டது");
                        arrayList.add("2012 - இசையின் லாவகத்தினால் கோடிக்கணக்கானவர் உள்ளத்தை கொள்ளை கொண்ட பிரபல கர்நாடக இசை பாடகி நித்யஸ்ரீயின் கணவர் மகாதேவன் இன்று அடையாறு ஆற்றில் விழுந்து தற்கொலை செய்து கொண்டார்.");
                        break;
                    case 21:
                        arrayList.add("1913 - உலகின் முதலாவது குறுக்கெழுத்துப் போட்டி நியூயார்க் வேர்ல்ட் பத்திரிகையில் வெளியானது");
                        arrayList.add("1967 - உலகின் முதலாவது இதய மாற்றுச் சிகிச்சை தென்னாப்பிரிக்காவில் நடத்தப்பட்டது");
                        arrayList.add("1995 - பெத்லஹம் நகரம் இஸ்ரேலின் பொறுப்பிலிருந்து பாலஸ்தீனத்தின் வசம் சென்றது");
                        arrayList.add("1962 - நார்வேயின் முதல் தேசியப் பூங்காவான ரோன்டன் நேஷனல் பார்க் உருவாக்கப்பட்டது");
                        arrayList.add("2014 - குஜராத்தில், விஷ்வ இந்து பரிஷத் சார்பில் நடத்தப்பட்ட, மீள் மதமாற்ற நிகழ்ச்சியில், 225 கிறிஸ்தவர்கள், இந்து மதம் திரும்பின தினம் . தாய் மதம் திரும்பிய அனைவருக்கும், இந்துக்களின் புனித நுாலான பகவத் கீதை வழங்கப்பட்டது.");
                        break;
                    case 22:
                        arrayList.add("1853 - இந்திய ஆன்மிகவாதி அன்னை சாரதா தேவி பிறந்த தினம்");
                        arrayList.add("1666 - சீக்கிய மத குருவான குரு கோவிந்த் சிங் பிறந்த தினம்");
                        arrayList.add("1851 - இந்தியாவின் முதல் சரக்கு ரயில் உத்ராஞ்சல் மாநிலத்தில் ஓடவிடப்பட்டது");
                        arrayList.add("1937 - லிங்கன் சுரங்கம் நியூயார்க்கில் பொதுமக்களுக்காக திறந்துவிடப்பட்டது");
                        arrayList.add("2010 - இந்திய ராணுவத்திற்காக தயாரிக்கப்பட்டஏவுகணையான பிரித்வி-2 சோதனை ஒரிசா மாநிலம் சந்திப்பூர் ஏவுதளத்தில் வெற்றி கரமாக நடத்தப்பட்டது.");
                        break;
                    case 23:
                        arrayList.add("1947 - முதலாவது டிரான்சிஸ்டர், பெல் ஆய்வுக் கூடத்தில் வெற்றிகரமாக பரிசோதிக்கப்பட்டது");
                        arrayList.add("1954 - முதலாவது மனித சிறுநீரக மாற்று அறுவை சிகிச்சை அமெரிக்காவின் பாஸ்டன் நகரில் நடத்தப்பட்டது");
                        arrayList.add("1902 - இந்தியாவின் 7வது பிரதமர் சரண் சிங் பிறந்த தினம்");
                        arrayList.add("2004 - இந்தியாவின் 9வது பிரதமர் பி.வி.நரசிம்மராவ் இறந்த தினம்");
                        arrayList.add("1964 - புரட்டிப்போட்ட புயலால் தனுஷ்கோடி அழிந்த தினம்");
                        break;
                    case 24:
                        arrayList.add("1951 - லிபியா விடுதலை நாள்");
                        arrayList.add("1973 - திராவிடர் கழகத்தை தோற்றுவித்த ஈ.வெ.ராமசாமி இறந்த தினம்");
                        arrayList.add("1987 - தமிழக முன்னாள் முதல்வர் எம்.ஜி.ராமச்சந்திரன் இறந்த தினம்");
                        arrayList.add("1924 - அல்பேனியா குடியரசானது");
                        arrayList.add("1906 - ரெஜினால்ட் ஃபெசெண்டென் உலகின் முதலாவது வானொலி நிகழ்ச்சியைத் தயாரித்து வழங்கினார்");
                        break;
                    case 25:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - இயேசு கிறிஸ்து பிறந்த தினம்");
                        arrayList.add("1876 - பாகிஸ்தானை தோற்றுவித்த முகமது அலி ஜின்னா பிறந்த தினம்");
                        arrayList.add("1990 - உலகளாவிய வலைத் திட்டம் வெற்றிகரமாக சோதிக்கப்பட்டது");
                        arrayList.add("1741 - ஆண்டர்ஸ் செல்சியஸ் தனது செல்சியஸ் வெப்பமானியை கண்டுபிடித்தார்");
                        arrayList.add("2010 - பாகிஸ்தானில் உணவு விநியோக மையத்தில் நடத்தப்பட்ட தற்கொலை படை தாக்குதலில் 41 பேர் உயிரிழந்தனர். 70 க்கும் மேற்பட்டோர் காயமுற்றனர்.");
                        break;
                    case 26:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - பொதுநல வாரிய நாடுகள் (பொக்சிங்)தினம்");
                        arrayList.add("1791 - ஆங்கில கணிதவியலாளர் சார்லஸ் பாபேஜ் பிறந்த தினம்");
                        arrayList.add("1898 - ரேடியம் கண்டுபிடிக்கப்பட்டது");
                        arrayList.add("1933 - பண்பலை வானொலி காப்புரிமம் பெற்றது");
                        arrayList.add("1944 - ஆங் சான், பர்மாவின் நவீன ராணுவத்தை உருவாக்கினார்");
                        break;
                    case 27:
                        arrayList.add("1945 - உலக வங்கி உருவாக்கப்பட்டது");
                        arrayList.add("1934 - பேர்சியா, ஈரான் என்ற பெயரை பெற்றது");
                        arrayList.add("1956 - தமிழகத்தில் தமிழ் ஆட்சி மொழிச் சட்டம் ஒருமனதாக நிறைவேற்றப்பட்டது");
                        arrayList.add("1978 - ஸ்பெயின் ஜனநாயக நாடானது");
                        arrayList.add("1922 - ஜப்பானின் ஹோஷோ, உலகின் முதலாவது விமானம் தாங்கி கப்பலாக கருதப்பட்டது");
                        break;
                    case 28:
                        arrayList.add("1932 - இந்திய தொழிலதிபர் திருபாய் அம்பானி பிறந்த தினம்");
                        arrayList.add("1937 - இந்திய டாடா குழும தலைவர் ரத்தன் டாடா பிறந்த தினம்");
                        arrayList.add("1940 - இந்திய அரசியல் தலைவர் ஏ.கே.அந்தோணி பிறந்த தினம்");
                        arrayList.add("1612 - கலிலியோ கலிலி, நெப்டியூன் கோளைக் கண்டுபிடித்தார்");
                        arrayList.add("1065 - லண்டனில் வெஸ்ட்மின்ஸ்டர் தேவாலயம் திறந்து வைக்கப்பட்டது");
                        break;
                    case 29:
                        arrayList.add("இன்றைய  முக்கியத்துவம் - சர்வதேச பல்லுயிர் பெருக்க தினம்");
                        arrayList.add("1845 - டெக்சாஸ் அமெரிக்காவின் 28வது மாநிலமாக இணைந்தது");
                        arrayList.add("1891 - தாமஸ் ஆல்வா எடிசன், வானொலிக்கான காப்புரிமம் பெற்றார்");
                        arrayList.add("1937 - ஐரிய சுதந்திர நாடு, புதிய அரசியலமைப்பை அறிமுகம் செய்து, அயர்லாந்து குடியரசு எனப் பெயர் மாறியது");
                        arrayList.add("2014 - போக்குவரத்துத் துறை ஊழியர்கள் வேலைநிறுத்தத்தால் தமிழகம் முழுவதும் வரலாறு காணாத அளவில்  அரசு பஸ் போக்குவரத்து ஸ்தம்பித்தது.");
                        break;
                    case 30:
                        arrayList.add("1879 - தமிழக ஆன்மிவாதி ரமண மகரிஷி பிறந்த தினம்");
                        arrayList.add("1906 - அகில இந்திய முஸ்லிம் லீக் டாக்காவில் ஆரம்பிக்கப்பட்டது");
                        arrayList.add("1943 - சுபாஷ் சந்திர போஸ், அந்தமான் தீவுகளில் இந்திய விடுதலைக் கொடியை ஏற்றினார்");
                        arrayList.add("1880 - டிரான்ஸ்லாம் குடியரசு ஆனது");
                        arrayList.add("2014 - கொடிய நோயான எபோலா நோய் பாதிக்கப்பட்டதால் மேற்கு ஆப்ரிக்க நாடுகளில் இறந்தவர்கள் எண்ணிக்கை 7 ஆயிரத்து 842 பேர் என அதிகாரப்பூர்வமாக அறிவிக்கப்பட்ட தினம்");
                        break;
                    case 31:
                        arrayList.add("1879 - வெள்ளொளிர்வு விளக்கு முதல் முறையாக தாமஸ் எடிசனால் காட்சிப்படுத்தப்பட்டது");
                        arrayList.add("1909 - மான்ஹட்டன் பாலம் திறக்கப்பட்டது");
                        arrayList.add("1923 - லண்டன் பிக் பென் மணிக்கூண்டின் மணியொலி மணிக்கொரு முறை பிபிசியில் ஒலிபரப்பு செய்ய துவங்கப்பட்டது");
                        arrayList.add("2004 - உலகின் மிக உயரமான வானளாவியான தாய்வானின் தாய்ப்பே 101 அதிகாரபூர்வமாக திறக்கப்பட்டது");
                        arrayList.add("2011 - அமெரிக்க இந்தியரும், 2009ல் வேதியியல் பிரிவில் நோபல் பரிசு பெற்றவருமான வெங்கட்ராமன் ராமகிருஷ்ணனுக்கு,58, பிரிட்டன் அரசு 'நைட்ஹூட்' விருது அறிவித்தது");
                        break;
                }
                break;
        }
        return arrayList;
    }

    public static List<String> getLeaderDays() {
        List<String> arrayList = new ArrayList();
        arrayList.add("ஜனவரி, 3, வீர பாண்டிய கட்டபொம்மன் பிறந்த நாள்");
        arrayList.add("ஜனவரி, 12, சுவாமி விவேகானந்தர் பிறந்த தினம். தேசிய இளைஞர் தினம்.");
        arrayList.add("ஜனவரி, 17, எம்.ஜி.ஆர். பிறந்த தினம்.");
        arrayList.add("ஜனவரி, 23, நேதாஜி பிறந்த தினம்.");
        arrayList.add("ஜனவரி, 30, காந்திஜி அமரத்துவ தினம்.");
        arrayList.add("பிப்ரவரி, 12, ஆபிரஹாம் லிங்கன் பிறந்த நாள்.");
        arrayList.add("பிப்ரவரி, 24, செல்வி ஜெ. ஜெயலிதா பிறந்த நாள்.");
        arrayList.add("ஏப்ரல், 14, டாக்டர். அம்பேத்கார் பிறந்த நாள்.");
        arrayList.add("ஏப்ரல், 15, ஆபிரகாம் லிங்கன் நினைவு நாள்");
        arrayList.add("ஜூன், 17, வீரவாஞ்சிநாதன் நினைவு நாள்.");
        arrayList.add("ஜூன், 18, தியாகி கக்கன் பிறந்த நாள்.");
        arrayList.add("ஜூலை, 4, சுவாமி விவேகானந்தர்  நினைவு  நாள்.");
        arrayList.add("ஜூலை, 21, தினமலர் நிறுவனர் டி.வி. இராமசுப்பைய்யர் நினைவு நாள்.");
        arrayList.add("ஆகஸ்ட், 8, தாகூர் நினைவு நாள்.");
        arrayList.add("ஆகஸ்ட், 15, அரவிந்தர் தினம்.");
        arrayList.add("ஆகஸ்ட், 21, திரு. ராஜீவ் காந்தி பிறந்த நாள்.");
        arrayList.add("ஆகஸ்ட், 30, கலைவாணர் என். எஸ். கே. நினைவு நாள்.");
        arrayList.add("செப்டம்பர், 5, அன்னை தெரசா நினைவு நாள், டாக்டர் ராதாகிருஷ்ணன் பிறந்த நாள்.");
        arrayList.add("செப்டம்பர், 12, மகாகவி பாரதியார் நினைவு நாள்.");
        arrayList.add("செப்டம்பர், 17, தந்தை பெரியார் பிறந்த நாள்.");
        arrayList.add("அக்டோபர், 2, திரு. லால்பகதூர் சாஸ்த்திரி பிறந்த நாள். காந்திஜி பிறந்த நாள். பெருந்தலைவர் காமராஜர் நினைவு நாள். தினமலர் நிறுவனர். டி.வி. ராமசுப்பு அய்யர் பிறந்த நாள்.");
        arrayList.add("அக்டோபர், 15, திரு.அப்துல் கலாம் பிறந்த நாள்");
        arrayList.add("நவம்பர், 7, சர். சி.வி. ராமன் பிறந்த நாள்");
        arrayList.add("நவம்பர், 8, வீரமாமுனிவர் பிறந்த நாள்.");
        arrayList.add("நவம்பர், 14, பண்டித நேருஜி பிறந்த நாள் குழந்தைகள் தினம். குருநானக் ஜெயந்தி.");
        arrayList.add("நவம்பர், 18, வ.உ. சிதம்பரம் பிள்ளை நினைவு நாள்");
        arrayList.add("நவம்பர், 19, அன்னை இந்திரா காந்தி பிறந்த நாள்.");
        arrayList.add("நவம்பர், 23, புட்டபர்த்தி சாய் பாபா பிறந்த நாள்.");
        arrayList.add("டிசம்பர், 6, டாக்டர் அம்பேத்கர் நினைவு நாள்.");
        arrayList.add("டிசம்பர், 22, கணித மேதை இராமானுஜர் பிறந்த நாள்.");
        arrayList.add("டிசம்பர், 24, எம்.ஜி.ஆர், ஈ.வே.ரா பிறந்த நாள்");
        arrayList.add("டிசம்பர், 25, மூதறிஞர் இராஜாஜி நினைவு நாள்");
        return arrayList;
    }

    public static String[] getHooraiMorningData(int i) {
        String[] strArr = new String[12];
        switch (i) {
            case 1:
                return new String[]{"சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி"};
            case 2:
                return new String[]{"சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்"};
            case 3:
                return new String[]{"செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்"};
            case 4:
                return new String[]{"புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்"};
            case 5:
                return new String[]{"குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்"};
            case 6:
                return new String[]{"சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு"};
            case 7:
                return new String[]{"சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்"};
            default:
                return strArr;
        }
    }

    public static String[] getHooraiNightData(int i) {
        String[] strArr = new String[12];
        switch (i) {
            case 1:
                return new String[]{"குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்"};
            case 2:
                return new String[]{"சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு"};
            case 3:
                return new String[]{"சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்"};
            case 4:
                return new String[]{"சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி"};
            case 5:
                return new String[]{"சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்"};
            case 6:
                return new String[]{"செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்"};
            case 7:
                return new String[]{"புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்", "சூரியன்", "சுக்கிரன்", "புதன்", "சந்திரன்", "சனி", "குரு", "செவ்வாய்"};
            default:
                return strArr;
        }
    }

    public static String[] getHooraiMorningThanglishData(int i) {
        String[] strArr = new String[12];
        switch (i) {
            case 1:
                return new String[]{"Suriyan", "Sukiran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani"};
            case 2:
                return new String[]{"Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan"};
            case 3:
                return new String[]{"Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Sani"};
            case 4:
                return new String[]{"Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai"};
            case 5:
                return new String[]{"Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan"};
            case 6:
                return new String[]{"Sukran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani", "Guru"};
            case 7:
                return new String[]{"Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran"};
            default:
                return strArr;
        }
    }

    public static String[] getHooraiNightThanglishData(int i) {
        String[] strArr = new String[12];
        switch (i) {
            case 1:
                return new String[]{"Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan"};
            case 2:
                return new String[]{"Sukran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani", "Guru"};
            case 3:
                return new String[]{"Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran"};
            case 4:
                return new String[]{"Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani"};
            case 5:
                return new String[]{"Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan"};
            case 6:
                return new String[]{"Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran"};
            case 7:
                return new String[]{"Bhuthan", "Chandran", "Sani", "Guru", "Sevvai", "Suriyan", "Sukran", "Bhuthan", "Chandran", "Sani", "Guru", "Sevvai"};
            default:
                return strArr;
        }
    }

    public static List<String> getFestivalDays(int i, int i2) {
        List<String> arrayList = new ArrayList();
        if (i2 != 2017) {
            if (i2 != 2018) {
                if (i2 == 2019) {
                    switch (i) {
                        case 0:
                            arrayList.add("இந்துக்கள் பண்டிகை நாட்கள் 2019");
                            arrayList.add("ஜனவரி,வெள்ளி 11 கெர்போட்ட நிவர்த்தி");
                            arrayList.add("ஜனவரி,திங்கள்\t14 போகிப் பண்டிகை");
                            arrayList.add("ஜனவரி,செவ்வாய் 15 தைப்பொங்கல்");
                            arrayList.add("ஜனவரி,புதன் 16 கனு மாட்டுப் பொங்கல், திருவள்ளுவர் தினம்");
                            arrayList.add("ஜனவரி,வியாழன் 17 உழவர் திருநாள்");
                            arrayList.add("ஜனவரி,திங்கள்\t21 தைப்பூசம்");
                            arrayList.add("ஜனவரி,வெள்ளி 25 தியாக பிரம்ம ஆராதனை");
                            arrayList.add("பிப்ரவரி,திங்கள் 4 தை அமாவாசை");
                            arrayList.add("பிப்ரவரி,புதன் 6 வாசவி அக்னிப் பிரவேசம்");
                            arrayList.add("பிப்ரவரி,செவ்வாய் 12 ரத சப்தமி");
                            arrayList.add("பிப்ரவரி,செவ்வாய் 19 மாசி மகம்");
                            arrayList.add("மார்ச்,திங்கள் 4 ஸ்ரீ மஹா சிவராத்திரி");
                            arrayList.add("மார்ச்,வெள்ளி 15 காரடையான் நோன்பு");
                            arrayList.add("மார்ச்,புதன்\t20 காம தகனம், ஹோலிப் பண்டிகை");
                            arrayList.add("மார்ச்,வியாழன்\t21 பங்குனி உத்திரம்");
                            arrayList.add("ஏப்ரல்,சனி\t6 தெலுங்கு வருடப் பிறப்பு");
                            arrayList.add("ஏப்ரல்,சனி\t13 ஸ்ரீ ராம நவமி");
                            arrayList.add("ஏப்ரல்,ஞாயிறு 14 தமிழ் வருடப் பிறப்பு");
                            arrayList.add("ஏப்ரல்,புதன் 17 ஸ்ரீ மீனாக்ஷி திருக்கல்யாணம்");
                            arrayList.add("ஏப்ரல்,வியாழன் 18 ஸ்ரீ கள்ளழகர் எதிர்சேவை");
                            arrayList.add("ஏப்ரல்,வெள்ளி 19 கள்ளழகர் வைகை எழுந்தருளல்");
                            arrayList.add("மே, சனி 4 அக்கினி நக்ஷத்திரம் ஆரம்பம்");
                            arrayList.add("மே, செவ்வாய்\t7 அக்ஷய திரிதியை");
                            arrayList.add("மே, வியாழன்\t9 ஸ்ரீ மத் சங்கர ஜெயந்தி");
                            arrayList.add("மே, செவ்வாய்\t14 ஸ்ரீ வாசவி ஜெயந்தி");
                            arrayList.add("மே, சனி\t18 வைகாசி விசாகம்");
                            arrayList.add("மே, புதன்\t29 அக்கினி நக்ஷத்திரம் முடிவு");
                            arrayList.add("ஜூலை, திங்கள் 8 ஆனி உத்திர தரிசனம்");
                            arrayList.add("ஆகஸ்ட்,சனி 3 ஆடிப் பெருக்கு விழா");
                            arrayList.add("ஆகஸ்ட்,ஞாயிறு 4 ஆடிப்பூரம்");
                            arrayList.add("ஆகஸ்ட்,திங்கள்\t5 ஸ்ரீ கெருட பஞ்சமி");
                            arrayList.add("ஆகஸ்ட்,வெள்ளி 9 ஸ்ரீ வரலக்ஷ்மி விரதம்");
                            arrayList.add("ஆகஸ்ட்,செவ்வாய் 13 சங்கரன் கோயில் தபசு");
                            arrayList.add("ஆகஸ்ட்,வியாழன் 15 ஆவணி அவிட்டம்");
                            arrayList.add("ஆகஸ்ட்,வெள்ளி 16 காயத்திரி ஜெபம்");
                            arrayList.add("ஆகஸ்ட்,திங்கள்\t19 ஸ்ரீ மஹா சங்கடஹர சதுர்த்தி");
                            arrayList.add("ஆகஸ்ட்,வெள்ளி 23 ஸ்ரீ கோகுலாஷ்டமி");
                            arrayList.add("ஆகஸ்ட்,சனி 24 ஸ்ரீ பாஞ்சராத்திர ஜெயந்தி");
                            arrayList.add("செப்டம்பர், திங்கள்\t2 ஸ்ரீ விநாயகர் சதுர்த்தி");
                            arrayList.add("செப்டம்பர், புதன் 11 ஓணம் பண்டிகை");
                            arrayList.add("செப்டம்பர், ஞாயிறு\t15 மஹாளய பக்ஷ ஆரம்பம்");
                            arrayList.add("செப்டம்பர், புதன் 18 மஹா பரணி");
                            arrayList.add("செப்டம்பர், சனி 28 சர்வ மஹாளய அமாவாஸ்யை");
                            arrayList.add("செப்டம்பர், ஞாயிறு 29 நவராத்திரி ஆரம்பம்");
                            arrayList.add("அக்டோபர், திங்கள்\t7 சரஸ்வதி பூஜை, ஆயுத பூஜை");
                            arrayList.add("அக்டோபர், செவ்வாய் 8 விஜய தசமி");
                            arrayList.add("அக்டோபர், ஞாயிறு\t27 தீபாவளிப் பண்டிகை");
                            arrayList.add("அக்டோபர், திங்கள்\t28 கந்த சஷ்டி ஆரம்பம்");
                            arrayList.add("நவம்பர், சனி 2 கந்த சஷ்டி சூரசம்ஹாரம்");
                            arrayList.add("டிசம்பர், செவ்வாய்\t10 திருக்கார்த்திகை தீபம்");
                            arrayList.add("டிசம்பர், வியாழன் 12 ஸ்ரீ பாஞ்சராத்திர தீபம்");
                            arrayList.add("டிசம்பர், ஞாயிறு 29\tகெர்போட்ட ஆரம்பம்");
                            break;
                        case 1:
                            arrayList.add("கிறிஸ்துவர்கள் பண்டிகை நாட்கள் 2019");
                            arrayList.add("ஜனவரி, செவ்வாய்\t1 ஆங்கில வருடப் பிறப்பு");
                            arrayList.add("ஜனவரி, ஞாயிறு 6 எபி பனிடே");
                            arrayList.add("பிப்ரவரி, சனி\t2 தேவமாதா பரிசுத்தரான திருநாள்");
                            arrayList.add("பிப்ரவரி, ஞாயிறு 17 செப்த கெசிமா");
                            arrayList.add("பிப்ரவரி, ஞாயிறு 24 செக்க்ஷ கெசிமா");
                            arrayList.add("மார்ச், ஞாயிறு 3 குயின் குவ கெசிமா");
                            arrayList.add("மார்ச், புதன் 6 ஆஷ் வெட்னஸ் டேட்");
                            arrayList.add("மார்ச், ஞாயிறு \t10 பஸ்ட் சண்டே");
                            arrayList.add("ஏப்ரல், வியாழன் 18 பெரிய வியாழன்");
                            arrayList.add("ஏப்ரல், வெள்ளி 19\tபுனித வெள்ளி");
                            arrayList.add("ஏப்ரல், சனி 20\tஹோலி சாட்டர்டே");
                            arrayList.add("ஏப்ரல், ஞாயிறு\t21 ஈஸ்டர் டே");
                            arrayList.add("ஜூன், ஞாயிறு\t16 திருத்துவ ஞாயிறு");
                            arrayList.add("ஜூன், வியாழன் 20\tகார்பஸ் கிறிஸ்டி");
                            arrayList.add("ஜூன், சனி\t 29 அர்ச் பீட்டர் அன்பால்");
                            arrayList.add("ஜூலை, செவ்வாய் 2 தேவமாதா காட்சி அருளிய நாள்");
                            arrayList.add("ஆகஸ்ட், செவ்வாய் 6 கர்த்தர் ரூபம் மாறிய தினம்");
                            arrayList.add("ஆகஸ்ட், வியாழன் 15 தேவமாதா மோட்சத்திற்கான நாள்");
                            arrayList.add("செப்டம்பர், ஞாயிறு 8 தேவமாதா பிறந்த நாள்");
                            arrayList.add("அக்டோபர், திங்கள் 22 அர்ச் சைமன் அன்ஜூட்");
                            arrayList.add("நவம்பர், ஞாயிறு 24 அட்வண்டு முதல் ஞாயிறு");
                            arrayList.add("டிசம்பர், ஞாயிறு 8 தேவமாதா கருவுற்ற திருநாள்");
                            arrayList.add("டிசம்பர், செவ்வாய் 2 கிறிஸ்துமஸ் ஈவ்");
                            arrayList.add("டிசம்பர், புதன்\t25\tகிறிஸ்துமஸ் பண்டிகை");
                            arrayList.add("டிசம்பர், சனி 28 மாசற்ற குழந்தைகள் தினம்");
                            arrayList.add("டிசம்பர், செவ்வாய் 31 நியூ இயர்ஸ் ஈவ்");
                            break;
                        case 2:
                            arrayList.add("முஸ்லிம்கள் பண்டிகை நாட்கள் 2019");
                            arrayList.add("ஜனவரி, செவ்வாய் 8 ஹஸரத் உமார் பிறந்த நாள்");
                            arrayList.add("ஜனவரி, வியாழன் 31 சென்னை ஹஸரத் பத்தாஷா உரூஸ்");
                            arrayList.add("பிப்ரவரி, சனி 16 நாகூர் மீரான் சாஹிப் உரூஸ்");
                            arrayList.add("பிப்ரவரி, திங்கள் 18 சென்னை பப்பு மஸ்தான் சாஹிப் உரூஸ் ");
                            arrayList.add("மார்ச்,ஞாயிறு 24சிக்கந்தர் பாஷாமலை சந்தனக் கூடு");
                            arrayList.add("ஏப்ரல்,புதன் 3 ஷபே மேராஜ்");
                            arrayList.add("ஏப்ரல், சனி 20 ஷபே பாரத்");
                            arrayList.add("மே, செவ்வாய் 7 ரம்ஜான் முதல் தேதி");
                            arrayList.add("மே, ஞாயிறு 26 மவுலா அலி உரூஸ்");
                            arrayList.add("ஜூன்,செவ்வாய் 5 மவுலா அலி உரூஸ்");
                            arrayList.add("ஜூன்,புதன் 5 ரம்ஜான் பண்டிகை");
                            arrayList.add("ஜூலை, சனி 20 காஜா பந்தே நவாஸ் உரூஸ்");
                            arrayList.add("ஆகஸ்ட், ஞாயிறு 11 அரபா மெக்காவுக்கு ஹஜ் யாத்திரை செய்த நாள்");
                            arrayList.add("ஆகஸ்ட், திங்கள் 12 பக்ரீத் பண்டிகை");
                            arrayList.add("ஆகஸ்ட், வெள்ளி 16 சென்னை தாதேஷா உரூஸ்");
                            arrayList.add("செப்டம்பர், ஞாயிறு 1 ஹிஜிரி வருடப் பிறப்பு");
                            arrayList.add("செப்டம்பர், செவ்வாய் 10 மொஹரம் பண்டிகை");
                            arrayList.add("செப்டம்பர், திங்கள் 16 ஹஸரத் உமார் பரூகி ஆஜம்");
                            arrayList.add("அக்டோபர், புதன் 23 அகீர்ஷா ஷம்பா");
                            arrayList.add("நவம்பர், ஞாயிறு 10 மீலாடி நபி ");
                            arrayList.add("நவம்பர், புதன்\t27 மதுரை தெற்குவாசல் முகையதீன் ஆண்டவர் கொடியேற்றம்");
                            arrayList.add("நவம்பர், சனி 30 மேலக்கால் சையது இப்ராஹீம் உரூஸ்");
                            arrayList.add("டிசம்பர், சனி 14 திருமயம் காட்டு பாவா உரூஸ் ");
                            arrayList.add("சனி 28 ஹஸரத் உமார் பிறந்த நாள்");
                            break;
                    }
                }
            }
            switch (i) {
                case 0:
                    arrayList.add("இந்துக்கள் பண்டிகை நாட்கள் 2018");
                    arrayList.add("ஜனவரி, செவ்வாய் 2 ஸ்ரீ இன்று ஆருத்ரா தரிசனம்");
                    arrayList.add("ஜனவரி, சனி 6 இன்று தியாக பிரம்ம ஆராதனை");
                    arrayList.add("ஜனவரி, வியாழன் 11 கெர் போட்ட நிவர்த்தி");
                    arrayList.add("ஜனவரி, சனி 13 போகிப் பண்டிகை");
                    arrayList.add("ஜனவரி, ஞாயிறு 14 தைப் பொங்கல்");
                    arrayList.add("ஜனவரி, திங்கள் 15  கனு மாட்டுப் பொங்கல், திருவள்ளுவர் தினம்");
                    arrayList.add("ஜனவரி, செவ்வாய் 16 உழவர் திருநாள்");
                    arrayList.add("ஜனவரி, புதன் 24 ரத சப்தமி");
                    arrayList.add("ஜனவரி, வெள்ளி 31 தைப்பூசம்");
                    arrayList.add("பிப்ரவரி, செவ்வாய் 13 ஸ்ரீ மஹா சிவராத்திரி");
                    arrayList.add("மார்ச், வியாழன் 1 மாசி மகம்");
                    arrayList.add("மார்ச், புதன் 14 காரடையான் நோன்பு");
                    arrayList.add("மார்ச், ஞாயிறு 18 தெலுங்கு வருடப் பிறப்பு");
                    arrayList.add("மார்ச், ஞாயிறு 25 ஸ்ரீ இராம நவமி");
                    arrayList.add("மார்ச், வெள்ளி 30 பங்குனி உத்திரம்");
                    arrayList.add("ஏப்ரல், சனி 14 தமிழ் வருடப் பிறப்பு");
                    arrayList.add("ஏப்ரல், புதன் 18 அக்ஷய திருதியை");
                    arrayList.add("ஏப்ரல், வெள்ளி 20 ஸ்ரீ மத் சங்கர ஜெயந்தி ");
                    arrayList.add("ஏப்ரல், புதன் 25 ஸ்ரீ வாசவி ஜெயந்தி");
                    arrayList.add("ஏப்ரல், வெள்ளி 27 ஸ்ரீ மீனாட்சி திருக்கல்யாணம்");
                    arrayList.add("ஏப்ரல், சனி 28 ஸ்ரீ கள்ளழகர் எதிர் சேவை");
                    arrayList.add("ஏப்ரல், ஞாயிறு 29 ஸ்ரீ கள்ளழகர் வைகை எழுந்தருளல்");
                    arrayList.add("மே, வெள்ளி 4 அக்னி நக்ஷத்திர ஆரம்பம்");
                    arrayList.add("மே, திங்கள் 28 அக்னி நக்ஷத்திர முடிவு, வைகாசி விசாகம் ");
                    arrayList.add("ஜூன், வியாழன் 21 ஆனி உத்திர தரிசனம்");
                    arrayList.add("ஜூலை, வெள்ளி 27 சங்கரன் கோயில் தபசு");
                    arrayList.add("ஆகஸ்ட், வெள்ளி 3 ஆடிப் பெருக்கு விழா");
                    arrayList.add("ஆகஸ்ட், திங்கள் 13 ஆடிப்பூரம் ");
                    arrayList.add("ஆகஸ்ட், புதன் 15 கெருட பஞ்சமி");
                    arrayList.add("ஆகஸ்ட், வெள்ளி 24 வரலக்ஷ்மி விரதம் ");
                    arrayList.add("ஆகஸ்ட், சனி 25 ஓணம் பண்டிகை");
                    arrayList.add("ஆகஸ்ட், ஞாயிறு 26 ஆவணி அவிட்டம்");
                    arrayList.add("ஆகஸ்ட், திங்கள் 27 காயத்திரி ஜெபம்");
                    arrayList.add("ஆகஸ்ட், வியாழன் 28 ஸ்ரீ மஹா சங்கடஹர சதுர்த்தி");
                    arrayList.add("செப்டம்பர், ஞாயிறு 2 ஸ்ரீ கோகுலாஷ்டமி");
                    arrayList.add("செப்டம்பர், திங்கள் 3 ஸ்ரீ பாஞ்சராத்திர ஜெயந்தி ");
                    arrayList.add("செப்டம்பர், வியாழன் 13 ஸ்ரீ விநாயகர் சதுர்த்தி");
                    arrayList.add("செப்டம்பர், செவ்வாய் 25 ஸ்ரீ மஹாளய பக்ஷம் ஆரம்பம்");
                    arrayList.add("செப்டம்பர், வெள்ளி 28 ஸ்ரீ மஹா பரணி ");
                    arrayList.add("அக்டோபர், திங்கள் 8 சர்வ மஹாளய அமாவாஸ்யை ");
                    arrayList.add("அக்டோபர், புதன் 10 நவராத்திரி ஆரம்பம் ");
                    arrayList.add("அக்டோபர், ஞாயிறு 18 சரஸ்வதி பூஜை, ஆயுத பூஜை");
                    arrayList.add("அக்டோபர், திங்கள் 19 விஜயதசமி");
                    arrayList.add("நவம்பர், செவ்வாய் 6 தீபாவளிப் பண்டிகை");
                    arrayList.add("நவம்பர், வியாழன் 8 கந்த சஷ்டி ஆரம்பம்");
                    arrayList.add("நவம்பர், செவ்வாய் 13 கந்த சஷ்டி சூர சம்ஹாரம்");
                    arrayList.add("நவம்பர், வெள்ளி 23 திருக்கார்த்திகை தீபம்");
                    arrayList.add("நவம்பர், சனி 24 ஸ்ரீ பாஞ்சராத்திர தீபம்");
                    arrayList.add("டிசம்பர், செவ்வாய் 18 ஸ்ரீ வைகுண்ட ஏகாதசி ");
                    arrayList.add("டிசம்பர், ஞாயிறு 23 ஆருத்ரா தரிசனம் ");
                    arrayList.add("டிசம்பர், சனி 29 கெர்போட்ட ஆரம்பம்");
                    break;
                case 1:
                    arrayList.add("கிறிஸ்துவர்கள் பண்டிகை நாட்கள் 2018");
                    arrayList.add("ஜனவரி, திங்கள் 1 ஆங்கில வருடப் பிறப்பு");
                    arrayList.add("ஜனவரி, சனி 6 எபி பனிட");
                    arrayList.add("ஜனவரி, ஞாயிறு 28 செப்த கெஸிமா");
                    arrayList.add("பிப்ரவரி, வெள்ளி 2 தேவமாதா பரிசுத்தரான நாள்");
                    arrayList.add("பிப்ரவரி, ஞாயிறு 4 செக்ஷ கெஸிமா");
                    arrayList.add("பிப்ரவரி, ஞாயிறு 11 குயின் குவ கெஸிமா");
                    arrayList.add("பிப்ரவரி, புதன் 14 ஆஷ்வெட்னெஸ் டே");
                    arrayList.add("பிப்ரவரி, ஞாயிறு 18 பஸ்ட் சண்டே");
                    arrayList.add("மார்ச், ஞாயிறு 25 குருத்தோலை ஞாயிறு");
                    arrayList.add("மார்ச், வியாழன் 29 பெரிய வியாழன்");
                    arrayList.add("மார்ச், வெள்ளி 30 புனித வெள்ளி");
                    arrayList.add("மார்ச், சனி 31 ஹோலி சாட்டர்டே");
                    arrayList.add("ஏப்ரல், ஞாயிறு 1 ஈஸ்டர் டே");
                    arrayList.add("ஏப்ரல், ஞாயிறு 8 உலோ சண்டே");
                    arrayList.add("மே, ஞாயிறு 27 திருத்துவ ஞாயிறு");
                    arrayList.add("மே, வியாழன் 31 கார்பஸ் கிறிஸ்டி");
                    arrayList.add("ஜூன், வெள்ளி 29 அர்ச் பீட்டா அன்பால்");
                    arrayList.add("ஜூலை, திங்கள் 2 தேவமாதா காக்ஷி அருளிய நாள்");
                    arrayList.add("ஆகஸ்ட், திங்கள் 6 கர்த்தர் ரூபம் மாறிய தினம்");
                    arrayList.add("ஆகஸ்ட், புதன் 15 தேவமாதா மோக்ஷத்திற்கான நாள்");
                    arrayList.add("செப்டம்பர், சனி 8 தேவமாதா பிறந்த நாள்");
                    arrayList.add("செப்டம்பர், வெள்ளி 14 ஹோலி ரூட் டே");
                    arrayList.add("செப்டம்பர், சனி 29 அர்ச் மிக்கேல் ");
                    arrayList.add("அக்டோபர், ஞாயிறு 28 அர்ச் சைமன் அன் ஜு ட்  ");
                    arrayList.add("நவம்பர், ஞாயிறு 25 அட்வண்டு முதல் ஞாயிறு");
                    arrayList.add("டிசம்பர், சனி 8 தேவமாதா கருவுற்ற நாள்");
                    arrayList.add("டிசம்பர், வெள்ளி 21 அர்ச் தாமஸ்");
                    arrayList.add("டிசம்பர், திங்கள் 24 கிறிஸ்துமஸ் ஈவு");
                    arrayList.add("டிசம்பர், செவ்வாய் 25 கிறிஸ்து ஜெயந்தி");
                    arrayList.add("டிசம்பர், வெள்ளி 28 மாசற்ற குழந்தைகள் தினம்");
                    arrayList.add("டிசம்பர், திங்கள் 31 நியூ ஈயர்ஸ் ஈவ் ");
                    break;
                case 2:
                    arrayList.add("முஸ்லிம்கள் பண்டிகை நாட்கள் 2018");
                    arrayList.add("ஜனவரி, வியாழன் 4 திருமயம் காட்டுபாவா உரூஸ்");
                    arrayList.add("ஜனவரி, வெள்ளி 19 ஹஸரத் உமார் பிறந்த நாள்");
                    arrayList.add("பிப்ரவரி, சனி 11 சென்னை ஹஸரத் பத்தாஷா உரூஸ்");
                    arrayList.add("பிப்ரவரி, செவ்வாய் 27 நாகூர் மீரான் சாஹிப் உரூஸ்");
                    arrayList.add("மார்ச், வியாழன் 1 சென்னை பப்பு மஸ்தான் சாஹிப் உரூஸ்");
                    arrayList.add("ஏப்ரல்,புதன் 4 சிக்கந்தர் பாஷாமலை சந்தனக் கூடு");
                    arrayList.add("ஏப்ரல்,சனி 14 ஷபே மேராஜ்");
                    arrayList.add("மே, செவ்வாய் 1 ஷபே பாரத்");
                    arrayList.add("மே, வியாழன் 17 ரம்ஜான் முதல் தேதி");
                    arrayList.add("ஜூன்,செவ்வாய் 5 மவுலா அலி உரூஸ்");
                    arrayList.add("ஜூன்,திங்கள் 11 லைலத்துல்கதர்");
                    arrayList.add("ஜூன்,சனி 16 ரம்ஜான் பண்டிகை");
                    arrayList.add("ஜூலை, திங்கள் 30 காஜா பந்தே நவாஸ் உரூஸ்");
                    arrayList.add("ஆகஸ்ட், செவ்வாய் 21 அரபா மெக்காவுக்கு ஹஜ் யாத்திரை செய்த நாள்");
                    arrayList.add("ஆகஸ்ட், புதன் 22 பக்ரீத் பண்டிகை");
                    arrayList.add("ஆகஸ்ட், செவ்வாய் 28 கோவளம் தமீம் அன்ஸாரி உரூஸ்");
                    arrayList.add("செப்டம்பர், புதன் 12 ஹிஜிரி வருடப் பிறப்பு");
                    arrayList.add("செப்டம்பர், வெள்ளி 21 மொஹரம் பண்டிகை");
                    arrayList.add("செப்டம்பர், வியாழன் 27 ஹஸரத் உமார் பரூகி ஆஜம்");
                    arrayList.add("அக்டோபர், செவ்வாய் 23 அகீர்ஷா ஷம்பா");
                    arrayList.add("நவம்பர், புதன் 21 மீலாடி நபி ");
                    arrayList.add("டிசம்பர், சனி 8 மதுரை தெற்கு வாசல் முகையதீன் ஆண்டவர் கொடியேற்றம் ");
                    arrayList.add("டிசம்பர், திங்கள் 24 திருமயம் காட்டு பாவா உரூஸ்");
                    break;
            }
        }
        switch (i) {
            case 0:
                arrayList.add("இந்துக்கள் பண்டிகை நாட்கள் 2017");
                arrayList.add("ஜனவரி, ஞாயிறு 8 ஸ்ரீ வைகுண்ட ஏகாதசி");
                arrayList.add("ஜனவரி, புதன் 11 ஆருத்ரா தரிசனம்");
                arrayList.add("ஜனவரி, வெள்ளி 13 போகிப் பண்டிகை");
                arrayList.add("ஜனவரி, சனி 14 தைப் பொங்கல்");
                arrayList.add("ஜனவரி, ஞாயிறு 15  மாட்டுப் பொங்கல்");
                arrayList.add("ஜனவரி, திங்கள் 16 உழவர் திருநாள்");
                arrayList.add("ஜனவரி, செவ்வாய் 17 தியாக பிரம்ம ஆராதனை");
                arrayList.add("ஜனவரி, வெள்ளி 27 தை அமாவாசை");
                arrayList.add("பிப்ரவரி, வெள்ளி 3 ரத சப்தமி");
                arrayList.add("பிப்ரவரி, வியாழன் 9 தைப்பூசம்");
                arrayList.add("பிப்ரவரி, வெள்ளி 24 ஸ்ரீ மகா சிவராத்திர");
                arrayList.add("மார்ச், சனி 11 மாசி மகம்");
                arrayList.add("மார்ச், திங்கள் 13 காம தகனம், ஹோலிப் பண்டிகை");
                arrayList.add("மார்ச், செவ்வாய் 14 காரடையான் நோன்பு");
                arrayList.add("மார்ச், புதன் 29 தெலுங்கு வருடப் பிறப்பு");
                arrayList.add("ஏப்ரல், புதன் 5 ஸ்ரீ இராம நவமி");
                arrayList.add("ஏப்ரல், ஞாயிறு 9 பங்குனி உத்திரம்");
                arrayList.add("ஏப்ரல், வெள்ளி 14 தமிழ் வருடப் பிறப்பு");
                arrayList.add("ஏப்ரல், சனி 29 அக்ஷய திருதியை");
                arrayList.add("ஏப்ரல், ஞாயிறு 30 ஸ்ரீ மத் சங்கர ஜெயந்தி ");
                arrayList.add("மே 9, திங்கள் - அக்ஷய திருதியை (தங்கம் வாங்க சிறந்த நாள்)");
                arrayList.add("மே, வியாழன் 4 அக்னி நக்ஷத்திர தோஷ ஆரம்பம்");
                arrayList.add("மே, வெள்ளி 5 ஸ்ரீ வாசவி ஜெயந்தி");
                arrayList.add("மே, ஞாயிறு 7 ஸ்ரீ மீனாட்சி திருக்கல்யாணம்");
                arrayList.add("மே, செவ்வாய் 9 ஸ்ரீ கள்ளழகர் எதிர் சேவை");
                arrayList.add("மே, புதன் 10 ஸ்ரீ கள்ளழகர் வைகை எழுந்தருளல்");
                arrayList.add("ஜூன், புதன் 7 வைகாசி விசாகம்");
                arrayList.add("ஜூன், வெள்ளி 30 ஆனி உத்திர தரிசனம்");
                arrayList.add("ஜூலை, புதன் 26 ஆடிப் பூரம்");
                arrayList.add("ஜூலை, வெள்ளி 28 கெருட பஞ்சமி");
                arrayList.add("ஆகஸ்ட், வியாழன் 3 ஆடிப் பெருக்கு விழா");
                arrayList.add("ஆகஸ்ட், வெள்ளி 4 வரலட்சுமி விரதம்");
                arrayList.add("ஆகஸ்ட், ஞாயிறு 6 சங்கரன் கோயில் தபசு");
                arrayList.add("ஆகஸ்ட், திங்கள் 7 ஆவணி அவிட்டம்");
                arrayList.add("ஆகஸ்ட், செவ்வாய் 8 காயத்திரி ஜபம்");
                arrayList.add("ஆகஸ்ட், வெள்ளி 11  ஸ்ரீ மகா சங்கடஹர சதுர்த்தி");
                arrayList.add("ஆகஸ்ட், திங்கள் 14 கோகுலாஷ்டமி");
                arrayList.add("ஆகஸ்ட், வெள்ளி 25 ஸ்ரீ விநாயகர் சதுர்த்தி");
                arrayList.add("செப்டம்பர், திங்கள் 4 ஓணம் பண்டிகை");
                arrayList.add("செப்டம்பர், புதன் 6 மஹாளய பக்ஷம் ஆரம்பம்");
                arrayList.add("செப்டம்பர், ஞாயிறு 10 மஹா பரணி");
                arrayList.add("செப்டம்பர், புதன் 13 ஸ்ரீ பாஞ்சராத்திர ஸ்ரீ ஜெயந்தி");
                arrayList.add("செப்டம்பர், செவ்வாய் 19 சர்வ மஹாளய அமாவாசை");
                arrayList.add("செப்டம்பர், வியாழன் 21 நவராத்திரி ஆரம்பம்");
                arrayList.add("செப்டம்பர், வெள்ளி 29 சரஸ்வதி பூஜை, ஆயுத பூஜை");
                arrayList.add("செப்டம்பர், சனி 30 விஜய தசமி");
                arrayList.add("அக்டோபர், புதன் 18 தீபாவளிப் பண்டிகை");
                arrayList.add("அக்டோபர், வெள்ளி 20 கந்த சஷ்டி ஆரம்பம்");
                arrayList.add("அக்டோபர், புதன் 25 கந்த சஷ்டி சூரசம்ஹாரம்");
                arrayList.add("டிசம்பர், சனி 2 திருக்கார்த்திகை தீபம்");
                arrayList.add("டிசம்பர், ஞாயிறு 3 ஸ்ரீ பாஞ்சராத்திர தீபம்");
                arrayList.add("டிசம்பர், ஞாயிறு 17 ஸ்ரீ ஹனுமத் ஜெயந்தி");
                arrayList.add("டிசம்பர், வெள்ளி 29 ஸ்ரீ வைகுண்ட ஏகாதசி/ கெர்ப் போட்ட ஆரம்பம்");
                break;
            case 1:
                arrayList.add("கிறிஸ்துவர்கள் பண்டிகை நாட்கள் 2017");
                arrayList.add("ஜனவரி, ஞாயிறு 1 ஆங்கில வருடப் பிறப்பு");
                arrayList.add("ஜனவரி, வெள்ளி 6 எபி பனிட");
                arrayList.add("பிப்ரவரி, வியாழன் 2 தேவமாதா பரிசுத்தரான நாள்");
                arrayList.add("பிப்ரவரி, ஞாயிறு 12  செப்த கெஸிமா");
                arrayList.add("பிப்ரவரி, ஞாயிறு 19 செக்ஷ கெஸிமா");
                arrayList.add("பிப்ரவரி, ஞாயிறு 26 குயின் குவ கெஸிமா");
                arrayList.add("மார்ச், புதன் 1 ஆஷ்வெட்னெஸ் டே, அர்ச் டேவிட்");
                arrayList.add("ஏப்ரல், வியாழன் 13 பெரிய வியாழன்");
                arrayList.add("ஏப்ரல், வெள்ளி 14 புனித வெள்ளி");
                arrayList.add("ஏப்ரல், சனி 15 ஹோலி சாட்டர்டே");
                arrayList.add("ஏப்ரல், ஞாயிறு 16 ஈஸ்டர் டே");
                arrayList.add("மே, புதன் 3 ஹோலி கிராஸ் டே");
                arrayList.add("ஜூன், ஞாயிறு 11 திருத்துவ ஞாயிறு");
                arrayList.add("ஜூன், வியாழன் 15 கார்பஸ் கிறிஸ்டி");
                arrayList.add("ஜூன், வியாழன் 29 அர்ச் பீட்டா அன்பால்");
                arrayList.add("ஜூலை, ஞாயிறு 2 தேவமாதா காக்ஷி அருளிய நாள்");
                arrayList.add("ஆகஸ்ட், ஞாயிறு 6 கர்த்தர் ரூபம் மாறிய தினம்");
                arrayList.add("ஆகஸ்ட், செவ்வாய் 15 தேவமாதா மோக்ஷத்திற்கான நாள்");
                arrayList.add("செப்டம்பர், வெள்ளி 8 தேவமாதா பிறந்த நாள்");
                arrayList.add("நவம்பர், ஞாயிறு 26 அட்வண்டு முதல் ஞாயிறு ");
                arrayList.add("டிசம்பர், வெள்ளி 8 தேவமாதா கருவுற்ற நாள்");
                arrayList.add("டிசம்பர், ஞாயிறு 24 கிறிஸ்துமஸ் ஈவு");
                arrayList.add("டிசம்பர், திங்கள் 25 கிறிஸ்து ஜெயந்தி");
                arrayList.add("டிசம்பர், வியாழன் 28 மாசற்ற குழந்தைகள் தினம்");
                arrayList.add("டிசம்பர், ஞாயிறு 31 நியூ ஈயர்ஸ் ஈவ் ");
                break;
            case 2:
                arrayList.add("முஸ்லிம்கள் பண்டிகை நாட்கள் 2017");
                arrayList.add("ஜனவரி, ஞாயிறு 1 மேலக்கால் சையது இப்ராஹிம் உரூஸ்");
                arrayList.add("ஜனவரி, ஞாயிறு 15 திருமயம் காட்டுபாவா உரூஸ்");
                arrayList.add("பிப்ரவரி, புதன் 22 சென்னை ஹஸரத் பத்தாஷா உரூஸ்");
                arrayList.add("மார்ச், வெள்ளி 10 நாகூர் மீரான் சாஹிப் உரூஸ்");
                arrayList.add("மார்ச், ஞாயிறு 12 சென்னை பப்பு மஸ்தான் சாஹிப் உரூஸ்");
                arrayList.add("ஏப்ரல்,வெள்ளி 14 சிக்கந்தர் பாஷாமலை சந்தனக் கூடு");
                arrayList.add("ஏப்ரல்,திங்கள் 24 ஷபே மேராஜ்");
                arrayList.add("மே, வியாழன் 11 ஷபே பாரத்");
                arrayList.add("மே, ஞாயிறு 28 ரம்ஜான் முதல் தேதி");
                arrayList.add("ஜூன்,வெள்ளி 16 மவுலா அலி உரூஸ்");
                arrayList.add("ஜூன்,வியாழன் 22 லைலத்துல்கதர்");
                arrayList.add("ஜூன்,திங்கள் 26 ரம்ஜான் பண்டிகை");
                arrayList.add("ஆகஸ்ட், புதன் 9 காஜா பந்தே நவாஸ் உரூஸ்");
                arrayList.add("செப்டம்பர், வெள்ளி 1 அரபா மெக்காவுக்கு ஹஜ் யாத்திரை செய்த நாள்");
                arrayList.add("செப்டம்பர், சனி 2 பக்ரீத் பண்டிகை");
                arrayList.add("செப்டம்பர், வெள்ளி 8 கோவளம் தமீம் அன்ஸாரி உரூஸ்");
                arrayList.add("செப்டம்பர், வெள்ளி 22 ஹிஜிரி வருடப் பிறப்பு");
                arrayList.add("அக்டோபர், ஞாயிறு 1 மொஹரம் பண்டிகை");
                arrayList.add("அக்டோபர், சனி 7 ஹஸரத் உமார் பரூகி ஆஜம்");
                arrayList.add("நவம்பர், வெள்ளி 3 அகீர்ஷா ஷம்பா");
                arrayList.add("டிசம்பர், சனி 2 மீலாடி நபி");
                arrayList.add("டிசம்பர், செவ்வாய் 19 மதுரை தெற்குவாசல் முகையதீன் ஆண்டவர் கொடியேற்றம்");
                break;
        }
        return arrayList;
    }

//    public PranayamamVO getPranayamamData(int i) {
//        PranayamamVO pranayamamVO = new PranayamamVO();
//        switch (i) {
//            case 1:
//                pranayamamVO.title = "அடிப்படை பிராணாயாமம் ";
//                pranayamamVO.procedure = "பிராணாயாமத்தில் ஆரம்ப நிலையில் இருப்பவர்கள் அல்லது பிராணாயாமத்தை பற்றி தெரியாதவர்கள் இந்த அடிப்படைப் பிராணாயாமத்தை பழகுதல் வேண்டும். இதனை எந்த வயதிலும் செய்யலாம். எனினும் மூச்சு சம்மந்தமான பிரச்சனைகள் இருத்தல் கூடாது. அதவாது இருதய கோளாறு, ரத்த கொதிப்பு, அறுவை சிகிச்சைகள் போன்ற பிரச்னையை சந்தித்தவர்கள் மருத்துவரின் அறிவுரைப்படி மூச்சுப் பயிற்சி செய்வது நல்லது.\n\n•அடிப்படை பிராணாயாமத்தை பழகும் சமயத்தில் 2:1:2:1 என்ற சதவிகிதத்தில் மூச்சுப் பயிற்சி செய்ய வேண்டும். இது எப்படி எனில்\n\n•மூச்சை உள் இழுத்தல் -> 1 -2 -3 -4 (என்ற நொடிகளியில் அமைய வேண்டும்)\n\n•மூச்சை உள் வைத்தல் -> 5-6 (என்ற அடுத்த இரு நொடிகள் இருக்க வேண்டும்)\n\n•பின்பு மூச்சை மெல்ல வெளியிடுதல் -> 1-2-3-4  (என்ற நொடிகளியில் அமைய வேண்டும்)\n\n•பின்பு மூச்சை வெளியிட்ட பிறகு -> 5- 6 (என்ற நொடிகளில் இடைவெளி விட்டு. அதாவது இந்த நேரத்தில் காற்றை உள் இழுக்கவோ வெளியிடவோ கூடாது. நிலையாக அப்படியே இருத்தல் வேண்டும். அதாவது மீண்டும் மேற்கண்ட பயிற்சியை செய்ய இது ஒரு இடைவெளி. அவ்வளவு தான்)\n\n•முதன் முதலில் மூச்சு பயிற்சி செய்பவர்கள் மேற்கண்ட நிலையில் தான் மூச்சு பயிற்சியை அதிலும் மேற்கண்ட விகிதத்தில் தான் செய்ய வேண்டும். அதன் பின்னர் போகப் போக தங்களால் இயலும் என்ற தன்னம்பிக்கை வந்த பிறகு மேற்கண்ட விகிதத்தை அவர்கள் விருப்பப்படி அதிகரிக்கலாம். அதில் தவறில்லை.\n\n•அடிப்படை பிராணாயாமம் முழு விவரங்கள்:-\n\n•பத்மாசனத்தில் வெட்டவெளியில். அதாவது காற்றோட்டம் உள்ள ஒரு அமைதியான இடத்தில் தொந்தரவுகள் ஏதும் இல்லாமல் அமரவும். ஒரு விரிப்பின் மீது அமருவது தான் நல்லது. வயதானவர்கள் நாற்காலியில் கூட அமரலாம். நோயாளிகள் படுத்த நிலையில் (சவாசனம்) கூட பயிற்சி செய்யலாம்.\n\n•அடிப்படை பிராணாயாமம் செய்முறை:-\n\n•1,2,3,4 என எண்ணிய படி மூச்சுக் காற்றை ஆழ்ந்து மெல்ல உள்ளே இழுக்கவும்.\n\n•இப்பொழுது உள்ளே இழுக்கப்பட்ட மூச்சுக்கு காற்றை சுமார் இரண்டு நொடிகளுக்கு அப்படியே உள்ளே வைத்துக் கொள்ளவும்.\n\n•பின்னர் 1,2,3,4 என எண்ணிய படி மூச்சுக் காற்றை ஆழ்ந்து மெல்ல வெளியே விடவும்.\n\n•இப்பொழுது அடுத்த இரண்டு நொடிகளுக்கு மூச்சை உள் இழுக்கவோ, வெளியில் விடவோ கூடாது. ஒரு நிலையான நிலையில் (Static Position) இருக்க வேண்டும். இப்படியாகப் 12 நொடிகள் மூச்சுப் பயிற்சி செய்ய \"one breathing cycle\" complete ஆகிறது. இதே போல ஒரு நாளைக்கு அதிக பட்சம்  20 breathing cycle வரையில் ஆரம்ப நிலையில் இருப்பவர்கள் (மூச்சுப் பயிற்சியை) பழகலாம். இதனை பழகும் சமயத்தில் இறைவனை தியானிக்க கூடுதல் பயன் நிச்சயம் உண்டு. இதுவே முதற்கட்ட அடிப்படை பிராணாயாமம் ஆகும். ஒரு அளவுக்கு நன்கு பழகியவர்கள் 6:3:6:3 என்று மேற்கண்ட சதவீதத்தை அதிகரித்து மூச்சுப் பயிற்சி செய்யலாம்.";
//                pranayamamVO.caution = "இருதய நோயாளிகள், மிகவும் வயதானவர்கள், கர்பிணிப் பெண்கள், அண்மையில் அறுவை சிகிச்சை நடந்தவர்கள், அதீத ஆஸ்துமா நோயாளிகள் என இவர்கள் அனைவரும் மருத்துவரின் ஆலோசனைப் படி செயல்படவும்.";
//                pranayamamVO.benefits = "அடிப்படை பிராணாயாமம் செய்வதால் கிடைக்கும் நன்மைகள்:-\n\n•மூளையை லகுவாக வைக்கிறது. இதனால் தேவை இல்லாத டென்ஷன் குறைகிறது. உணர்வுகள் அனைத்தும் ஒரு கட்டுக்குள் வைக்கப்படுகிறது.\n\n•எந்த ஒரு வேலையையும் மேற்கண்ட மூச்சுப் பயிற்சியை பழகுவதால் கவனமாகச் செய்ய இயலும். மனம் அலைபாயாது.\n\n•ரத்தத்தில் அதிக அளவில் ஆக்சிஜென் கிடைப்பதால் அன்றைய தினம் முழுவதும் கொட்டாவி போன்றவை ஏற்படாமல் சுறுசுறுப்பாக முழு சக்தியுடன் செயல் பட முடிகிறது.\n\n•சுருங்கச் சொன்னால் இந்த பிராணாயாமத்தை தொடர்ந்து நாம் பழகுவதால் ஒரு வித இறை அனுபவத்தை நாம் பெறலாம்.";
//                pranayamamVO.bestPractices = "ஒரு நாளைக்கு அதிக பட்சம்  20 breathing cycle வரையில் ஆரம்ப நிலையில் இருப்பவர்கள் (மூச்சுப் பயிற்சியை) பழகலாம்.";
//                pranayamamVO.prerequisite = "எப்போதுமே பிராணாயாமம் செய்யும் போது வலது கை கட்டை விரலைக் கொண்டு வலது நாசியையும். பின்னர் அதே வலது கை மோதிர விரலைக் கொண்டு இடது நாசியையும் அவ்வப்போது மூடித் திறப்பதே சரியான முறையாகும்.\n\n•பிராணயாமத்தின் ஆரம்ப நிலையில் இருப்பவர்கள் நன்கு பழகுகின்ற வரையில் மூக்குத் துவாரங்களை மூடிப் பழக வேண்டும் என்பது இல்லை. சாதாரணமாக சுவாசிப்பதை போல செய்யலாம். தவறில்லை.    ";
//                pranayamamVO.tips = "காற்றை முழுவதுமாக உள்ளே இழுப்பதற்கு 'பூரகம்' என்று பெயர்.\n\n•உள் வாங்கிய காற்றை வெளியிடாமல் அப்படியே சில நொடிகளை வைத்திருக்கும் நிலையை (அதாவது மூச்சுப் பிடிப்பதை) 'கும்பகம்' என்பர். [இருதய நோயாளிகள், கற்பிணிப் பெண்கள், அண்மையில் ஏதேனும் அறுவை சிகிச்சையை செய்தவர்கள், பிராணாயாமத்தில் ஆரம்ப நிலையில் இருப்பவர்கள் ஆகிய இவர்கள் அனைவருமே அதிக நேரம் மூச்சுப் பிடிக்கக் கூடாது].\n\n•காற்றை வெளியே விடுவதை 'ரேசகம்' என்பர்.\n\n•காற்றை உள்ளே இழுத்தல் : காற்றை உள்ளே வைத்தல் அல்லது தம் பிடித்தல் : காற்றை வெளியே விடுதல் என்ற இந்த மூச்சுப் பெயர்ச்சியின் சதவீதம் 1:4:2 என்ற நிலையில் தான் இருக்கும். நன்கு பயிற்சி பெற்றவர்கள் தேவைப்பட்டால் இந்த விகிதத்தை அதிகரித்துக் கொள்ளலாம்.  ";
//                pranayamamVO.inhaleRatio = 2;
//                pranayamamVO.holdRatio = 1;
//                pranayamamVO.exhaleRatio = 2;
//                pranayamamVO.retainRatio = 1;
//                pranayamamVO.inhaleBeginner = 8;
//                pranayamamVO.inhaleIntermediate = 10;
//                pranayamamVO.inhaleExpert = 12;
//                pranayamamVO.breathingCycle = 20;
//                break;
//            case 2:
//                pranayamamVO.title = "ஆலோம் விலோம் பிராணாயாமம்";
//                pranayamamVO.procedure = "மெதுவாக இடது மூக்குத் துவாரத்தின் வழியாக காற்றை உள்ளே இழுக்கவும். ஆரம்ப நிலையில் இருப்பவர்கள் சுமார் மூன்று மாதங்களுக்கு  காற்றை தம் கட்டி எல்லாம் வைக்க வேண்டாம். சாதாரணமாக சுவாசிப்பது போல சுமார் நான்கு நொடிகள் வலது துவார மூக்கை முடிய படி இடது மூக்கு துவாரம் வழியாக காற்றை உள்ளே இழுக்கவும். பின்னர் தம் காட்டாமல் (அடுத்த நான்கு நொடிகள்) இடது மூக்கின் துவாரத்தை மூடிய படி வலது மூக்கின் துவாரம் வழியாக காற்றை வெளியிடவும். இது ஒரு \"செட்\" அல்லது \"breathing cycle\" ஆகும். (மொத்தம் 8 நொடிகள் வரும்). இப்படியாக முதன் முதலாக செய்யும் சமயத்தில் 5 \"செட்\" அல்லது \"breathing cycle\"என்று ஆரம்பித்துப் போகப் போக 10,15,20 \"செட்\" அல்லது \"breathing cycle\" என்று அதிகரித்துக் கொள்ளவும். இதன் படி மூன்று மாதங்களில் 30 நிமிடத்திற்குள் (எந்த ஒரு அசதி அல்லது சோர்வும் ஏற்படாமல்) 20 \"செட்\" அல்லது 20 \"breathing cycle\" முடிக்கும் வரையில் நீங்கள் கைதேர்ந்த இருக்க வேண்டும். அதன் பிறகு தான் நீங்கள் அடுத்த நிலைக்கு செல்ல வேண்டும். சளி தொந்தரவுகள் இருக்கும் சமயத்தில் மட்டும் இந்த மூச்சுப் பயிற்சியை தவிர்த்தல் நலம்.";
//                pranayamamVO.caution = "இதனை நாடி சுத்தி என்றும் கூறுவார்கள். அடிப்படை பிராணாயாமம் தெரியாமல் இதனை செய்யக்கூடாது.";
//                pranayamamVO.benefits = "மன அழுத்தத்தை போக்க இது உதவுகிறது. கவலைகளை மறக்க ஒரு ஆரோக்கியமான வழி இது.";
//                pranayamamVO.bestPractices = "ஒரு நாளைக்கு சுமார் இருபது நிமிடங்கள் இதனை செய்யலாம். (இதை மட்டுமே செய்வதாக இருந்தால்)";
//                pranayamamVO.prerequisite = "காற்றோட்டம் உள்ள இடத்தில் உங்களுக்குப் பிடித்த ஆசனத்தில் ஒரு விரிப்பின் மீது அமருங்கள். (பத்மாசனத்தில் தான் அமர வேண்டும் என்பது இல்லை). கூன் விழாத படி முதுகை நிமிர்த்துங்கள். உடல் முடியாதவர்கள் படுத்த நிலையில் கூட (சவாசனம்) இதனைப் பழகலாம். அதில் தவறில்லை. சிரமத்தை ஏற்படுத்திக் கொள்ளாமல், அதிக சத்தம் அல்லது இரைச்சல் வராத படி காற்றை உள்ளேயும், வெளியேயும் கீழ் சொன்ன முறையில் இழுக்க வேண்டும்.\n\n•வலது மூக்குத் துவாரத்தை, வலது கை கட்டை விரலை வைத்து மூட அல்லது மெதுவாக அழுத்திப் பிடித்துக் கொள்ள வேண்டும். அதே போல இடது மூக்கு துவாரத்தை மூடச் சொல்லும் சமயத்தில் வலது கை மோதிர விரலைக் கொண்டு மூட அல்லது லகுவாக அழுத்திப் பிடித்துக் கொள்ள வேண்டும். மற்ற விரல்களை முழங்கால் மீது வைத்துக் கொள்ளுங்கள் போதும்.\n\n•அதே போல, வலது கையில் சோர்வை உணரும் பட்சத்தில் இடது கை கட்டை விரல் மற்றும் மோதிர விரலை மேற்கண்டவாறு பயன்படுத்திக் கொள்ளலாம் அதில் தவறு இல்லை. ஆரம்ப நிலையில் இருப்பவர்கள் சுமார் இருபது நிமிடங்களுக்கு இதே போல மூச்சுப் பயற்சி செய்யலாம். அதற்கு மேல் செய்ய வேண்டாம். 20 நிமிடங்கள் தொடர்ந்து செய்ய முடியவில்லை என்றால் கவலை வேண்டாம் சவாசனத்தில் படுத்தும் பின்னர் அமர்ந்தும் இப்படியாக மாறி, மாறி இந்த ஆசனத்தை பழகலாம்.";
//                pranayamamVO.tips = "பிராணாயாமத்தை அதிகாலையில் செய்வது மிகப் பெரிய பயனை அளிக்கும். அதாவது சூரியன் உதிப்பதற்கு ஒன்று அல்லது இரண்டு மணி நேரத்திற்கு முன்னாள் எழுந்து பிராணாயாமத்தை செய்வது உத்தமம்.";
//                pranayamamVO.inhaleRatio = 4;
//                pranayamamVO.holdRatio = 0;
//                pranayamamVO.exhaleRatio = 4;
//                pranayamamVO.retainRatio = 0;
//                pranayamamVO.inhaleBeginner = 4;
//                pranayamamVO.inhaleIntermediate = 8;
//                pranayamamVO.inhaleExpert = 16;
//                pranayamamVO.breathingCycle = 10;
//                break;
//            case 3:
//                pranayamamVO.title = "கபாலபதி பிராணாயாமம் ";
//                pranayamamVO.procedure = "காற்றோட்டம் உள்ள இடத்தில் உங்களுக்குப் பிடித்த ஆசனத்தில் ஒரு விரிப்பின் மீது அமருங்கள். (பத்மாசனத்தில் தான் அமர வேண்டும் என்பது இல்லை). கூன் விழாத படி முதுகை நிமிர்த்துங்கள். உடல் முடியாதவர்கள் படுத்த நிலையில் கூட (சவாசனம்) இதனைப் பழகலாம். அதில் தவறில்லை.\n\n•கபாலபதிப் பிராணாயாமத்தில் \"தம்\" பிடிக்க அவசியம் இல்லை. காற்றை உள்ளே இழுப்பது மற்றும் வெளியில் இடுவது என இவை இரண்டும் மட்டுமே இதில் செய்யப்படும். அதிலும் காற்றை வெளியிடும் சமயத்தில் மூக்கின் வழியே மிகவும் வேகமாக வெளியிட வேண்டும். ஒரு அழுத்தத்துடன் உடனே வெளியிட வேண்டும். காற்றை மூக்கின் வழியாக உள்ளே இழுப்பது மிதமாக நடக்க வேண்டும் (அதில் அவசரம் கூடாது). இப்படியாக மூச்சை உள் இழுப்பது இரண்டு நொடி, மூச்சை வெளியில் விடுவது இரண்டு நொடி என்ற விகிதத்தில் இருத்தல் வேண்டும் (இது ஒரு செட் ஆகும்). போகப் போக இந்த விகிதத்தை அதிகரித்துக் கொள்ளலாம்.";
//                pranayamamVO.caution = "\"கபாலபதிப் பிராணாயாமம்\" என்பது கபாலத்தின் சூட்டை தணிக்கும் பிராணாயாமம் ஆகும். \"கபாலம்\" என்றால் \"மண்டை ஓடு\" \"பதி\" என்றால் \"மிளிர்தல் அல்லது ஒளிரும்\" என்று பொருள் தரும். இதனை ஆரம்ப நிலையில் இருப்பவர்கள் எடுத்த எடுப்பில் செய்யக் கூடாது. மேற்சொன்ன இரண்டு நிலைகளை செய்து நன்கு தேர்ச்சி பெற்ற பிறகு தான் இதனைச் செய்ய வேண்டும்.\n\n•கபாலபதிப் பிராணாயாமத்தை கர்பிணிப் பெண்கள் செய்யவே கூடாது.\n\n•அல்சர் மற்றும் ஹிரண்யா பிரச்சனை உள்ளவர்கள் செய்யக் கூடாது.\n\n•அண்மையில் ஏதேனும் அறுவை சிகிச்சை நடந்து இருந்தால் இந்த மூச்சுப் பயிற்சியை செய்யக் கூடாது.\n\n•சளி தொந்தரவுகள் உள்ளவர்கள் இந்த மேற்கண்ட சுவாசப் பயிற்சியை செய்யக் கூடாது.\n\n•அதே போல, இந்த மூச்சுப் பயிற்சியை செய்யும் சமயத்தில் ஏதேனும் இயற்கைக்கு மாறான சங்கடங்கள் ஏற்பட்டால் உடனடியாக நிறுத்தி விட வேண்டும். மேற்கொண்டு தொடருவது ஆபத்தை தரும்.";
//                pranayamamVO.benefits = "உடலுக்கு அதிக அளவில் பிராண வாயு கிடைக்கிறது.\n\n•ரத்த ஓட்டம் நல்ல முறையில் சீர் அடைகிறது.\n\n•ஞாபகசக்தி மற்றும் கவனிக்கும் ஆற்றல் அதிகரிக்கிறது.";
//                pranayamamVO.bestPractices = "ஒரு நாளைக்கு சுமார் ஐந்து நிமிடங்கள் செய்யலாம்";
//                pranayamamVO.prerequisite = "கபாலபதி பிராணாயாமம் மாணவர்களுக்கு ஏற்ற பிராணாயாமம் ஆகும். இதனை சரியான முறையில் சரியான படிப்  பழகி வர மாணவர்களின் நினைவுத் திறன் அதிகரிக்கும்.";
//                pranayamamVO.tips = "பிராணாயாமத்தை காற்றோட்டம் உள்ள அமைதியான இடத்தில் செய்வது உத்தமம். இயற்கைக்கு மாறான அதிகமாக காற்று வீசும் இடங்களில் பிராணாயாமத்தை செய்ய வேண்டாம். மின்விசிறிக்கு கீழேயோ அல்லது குளிர் சாதனப் பெட்டியின் அருகிலேயோ பிராணாயாமத்தை செய்வதை முற்றிலும் தவிர்க்கவும். மாசுகள் அதிகம் உள்ள இடங்களில் பிராணாயாமத்தை செய்வதை தவிர்க்கவும். பிராணாயாமத்தை செய்வதற்கு முன்னாள் சுமார் மூன்று அல்லது நான்கு மணி நேரங்களுக்கு உணவு உண்பதை தவிர்த்தல் நலம். அதீத தாகம் இருந்தால் சுமார் அரை மணி நேரத்திற்கு முன்னாள் எலுமிச்சை சாறு இல்லை தண்ணீரை பருகலாம். பிராணாயாமம் செய்பவர்கள் அசைவ உணவுகளை அவசியம் தவிர்த்தால் தான் முழு பலனைப் பெற இயலும்.\n\n•ஆடைக் கட்டுப்பாடு - பிராணாயாமம் பழகுபவர்கள் லகுவான ஆடைகளை அணிவது நல்லது. எக்காரணம் கொண்டும் இறுக்கமான ஆடைகளை அணிதல் கூடாது.\n\n•ஆசன முறைகள் - பிராணாயாமம் செய்பவர்கள் பத்மாசனம் அல்லது சுகாசனத்தில் அமர்ந்தபடி மூச்சுப் பயிற்சி செய்யலாம். இதிலும் பத்மாசனத்தை பின்பற்றுவது தான் மிகவும் ஏற்றது. எனினும் இது கட்டாயம் இல்லை.\n\n•வயதானவர்கள் நாற்காலியில் அமர்ந்தபடி கூட மூச்சுப் பயிற்சி செய்யலாம்.\n\n•பிராணாயாமம் செய்யும் சமயத்தில் முதுகு வளைந்து இருக்கக் கூடாது. முதுகை நிமிர்த்தி வைத்தல் அவசியம்.\n\n•இரவு நன்றாக தூங்கி இருந்தால் தான் உற்சாகமாக பிராணாயாமத்தை நம்மால் செய்ய இயலும் என்பதை நினைவில் கொள்ளவும்.\n\n•ஒருவேளை பிராணாயாமத்தை மாலையில் செய்ய விரும்புபவர்கள். சாதாரணமாக ஒரு விரிப்பை விரித்து அதில் நிமிர்ந்தபடி (கை கால்களை தளர்த்திய நிலையில்) சுமார் ஐந்து நிமிடங்கள் படுத்த பிறகு [இதனை சவாசனம் என்பர்] மீண்டும் எழுந்து அமர்ந்து பிராணாயாமம் செய்வது நல்லது.";
//                pranayamamVO.inhaleRatio = 2;
//                pranayamamVO.holdRatio = 0;
//                pranayamamVO.exhaleRatio = 2;
//                pranayamamVO.retainRatio = 0;
//                pranayamamVO.inhaleBeginner = 4;
//                pranayamamVO.inhaleIntermediate = 8;
//                pranayamamVO.inhaleExpert = 16;
//                pranayamamVO.breathingCycle = 10;
//                break;
//            case 4:
//                pranayamamVO.title = "அக்னிசார் பிராணாயாமம் ";
//                pranayamamVO.procedure = "முதலில் சாதாரண சுவாசத்தில் வயிற்றை உள்ளேயும், வெளியேயும் மாறி மாறி தள்ளவும். இப்படியாக ஒரு ரிதம் அல்லது ஒரு வித இலகுவான தன்மை வரும் (பிடிபடும்) வரையில் சில நொடிகள் செய்யவும்.\n\n•பிறகு காற்றை உள் இழுத்து சில நொடிகள் வைத்த பிறகு முதுகை சற்றே வளைந்து கொடுத்து வயிற்றின் அடிப்பகுதியை உள்ளே இழுத்தும், வெளியே விட்டும் சில நொடிகள் இதனை மாறி, மாறி செய்யவும்.\n\n•பிறகு காற்றை முழுவதுமாக வெளியே விடவும்.\n\n•இதுவே அக்னிசார் பிராணாயாமம் ஆகும்.";
//                pranayamamVO.caution = "இருதய நோயாளிகள் இந்தப் பிராணாயாமத்தை செய்யக் கூடாது.\n\n•அறுவை சிகிச்சை ஏதேனும் நடந்திருப்பினும் இந்த மூச்சுப் பயிற்சியை செய்யக் கூடாது.\n\n•இந்த மூச்சுப் பயிற்சியை செய்யும் சமயத்தில் ஏதேனும் அசௌக்கியம் ஏற்பட்டால் உடனே மேற்கொண்டு இதனை தொடர்வதை நிறுத்திக் கொள்ள வேண்டும்.\n\n•பிராணாயாமத்தில் கை தேர்ந்தவர்கள் மட்டுமே இதனை செய்ய வேண்டும்.";
//                pranayamamVO.benefits = "•தொப்பை குறையும்\n\n•மலச்சிக்கல் தீரும்.";
//                pranayamamVO.bestPractices = "ஒரு நாளைக்கு முழுமையாக ஒரே ஒரு முறை செய்தாலே போதும்.\n\n•இத்தனை நொடிகளுக்குள் முடித்து விட வேண்டும் என்றெல்லாம் இதற்கு வரையறை கூற இயலாது. அவரவர் உடல் வாகுவை பொறுத்து செய்யலாம். ஆனால் பிராணாயாமத்தை நன்கு பழகியவர்கள் மட்டுமே இதனை செய்ய வேண்டும்.      ";
//                pranayamamVO.prerequisite = "காற்றோட்டம் உள்ள இடத்தில் நின்ற நிலையில் இதனைப் பழகலாம். தேவை இல்லாத எந்த ஒரு தொந்தரவுகளும் இல்லாமல் பார்த்துக் கொள்ள வேண்டும்.";
//                pranayamamVO.tips = "பிராணாயாமத்தை செய்ய முற்படுவதற்கு முன்னாள் சில எச்சரிக்கைகளையும் கவனத்தில் கொள்ள வேண்டும்.\n\n•ஆஸ்தமா மற்றும் ரத்த கொதிப்பு நோயாளிகள் அதிக நேரம் மூச்சை அடக்குதல் கூடாது.\n\n•மூச்சுப் பிரச்சனை உள்ளவர்கள் பிராணாயாமத்தை தவிர்த்தல் நல்லது.\n\n•ஒரு நல்ல ஆசிரியரின் வழிகாட்டுதலின் படி நீங்கள் பிராணாயாமம் செய்வது மிக நல்லது.\n\n•பிராணாயாமம் பழகுபவர்கள் அசைவ உணவுகள், புகை பிடித்தல், மது அருந்துதல் ஆகிய இவை அனைத்தையும் அவசியம் தவிர்த்தல் நலம். இல்லையேல் எதிர்மறையான விளைவுகள் ஏற்படும்.";
//                pranayamamVO.inhaleRatio = 2;
//                pranayamamVO.holdRatio = 1;
//                pranayamamVO.exhaleRatio = 2;
//                pranayamamVO.retainRatio = 0;
//                pranayamamVO.inhaleBeginner = 6;
//                pranayamamVO.inhaleIntermediate = 8;
//                pranayamamVO.inhaleExpert = 10;
//                pranayamamVO.breathingCycle = 1;
//                break;
//            case 5:
//                pranayamamVO.title = "பஸ்திரிகா பிராணாயாமம் ";
//                pranayamamVO.procedure = "காற்றோட்டம் உள்ள இடத்தில் உங்களுக்குப் பிடித்த ஆசனத்தில் ஒரு விரிப்பின் மீது அமருங்கள். (பத்மாசனத்தில் தான் அமர வேண்டும் என்பது இல்லை). கூன் விழாத படி முதுகை நிமிர்த்துங்கள். இதே போல மேற்கண்டவாறு அமர்ந்த படி அதிவேகமாக சுமார் இருபது முறை காற்றை ஆழ  உள்ளே இழுத்து வெளியிட வேண்டும். இது தான் பஸ்திரிகா பிராணாயாமம் ஆகும். அவ்வாறு காற்றை உள்ளே இழுத்து வெளியிடுவது தொடர்ச்சியாக நடக்க வேண்டும்.";
//                pranayamamVO.caution = "இருதய சம்மந்தமான பிரச்சனைகள் உள்ளவர்கள் இந்தப் பிராணாயாமத்தை தவிர்த்தல் நலம்.\n\n•கற்பிணிப் பெண்களும் இதனை செய்யக்கூடாது\n\n•ஒருவேளை இந்த சுவாசப் பயிற்சியை மேற்கொள்ளும் சமயத்தில் ஏதேனும் அசௌக்கியம் ஏற்பட்டால் உடனடியாக இப்பயிற்சி செய்வதை நிறுத்தி விட வேண்டும்.\n\n•பெரும்பாலும் உஷ்ண காலங்களில் இந்தப் பயிற்சியை செய்வதை தவிர்க்கலாம்.  ";
//                pranayamamVO.benefits = "தொண்டையில் உள்ள கரகரப்பு, அடைப்பு நீங்கும்.\n\n•மூக்கடைப்பு நீங்கும்.\n\n•ஆஸ்தமா குணமாகும்.\n\n•உடலில் அதிக உஷ்ணம் ஏற்படும். இதனால் உடல் எடை குறையும்.\n\n•முடக்கு வாதம் ஏற்படாது.  ";
//                pranayamamVO.bestPractices = "ஒரு நாளைக்கு குறைந்தது ஒரு நிமிடம் செய்தாலே போதும்.";
//                pranayamamVO.prerequisite = "\"பஸ்திரிகா\" என்றால் கங்கு நெருப்பை ஊத உதவும் கருவியின் பெயர் ஆகும். அதாவது இரும்பு அடிக்கிறவர்கள், இரும்பை காய்ச்சல் நெருப்பை வளர்த்து அது அணையாத படி ஊதி நன்கு பற்ற வைப்பார்கள் அல்லவா அதற்கு உதவும் துருத்தி தான் \"பஸ்திரிகா\" என்று பெயர்.";
//                pranayamamVO.tips = "பிராணாயாமம் செய்யும் சமயத்தில் மனதை காலியாக வைத்திருக்க வேண்டும். தேவை இல்லாத கவலைகளால் மனதை நிரப்புதல் கூடாது.\n\n•1:4:2 (மூச்சை உள்ளே இழுத்தல் : மூச்சை உள்ளே வைத்தல் : மூச்சை வெளியிடுதல்) என்ற விகிதத்தில் தான் பிராணாயாமம் செய்தல் வேண்டும். இந்த அடிப்படை மாறாது.\n\n•சுவாசப் பறிச்சியை முதன் முறையாக செய்பவர்கள் அதிக நேரம் மூச்சை அடக்குதல் கூடாது.\n\n•இருதய  பிரச்சனை உள்ளவர்கள், ரத்த கொதிப்பு உள்ளவர்கள், அண்மையில் அறுவை சிகிச்சை ஏதேனும் செய்தவர்கள் போன்றோர் மருத்துவர் ஆலோசனை இல்லாமல் பிராணாயாமம் செய்தல் கூடாது.\n\n•முதன் முதலில் பிராணாயாமம் செய்பவர்களுக்கு தெளிவு இல்லாவிட்டாலும் பயிற்சி செய்ய செய்ய இந்தக் கலை பழகி விடும்.\n\n•ஒருவேளை, பிராணாயாமம் செய்யும் சமயத்தில் ஏதேனும் சங்கடத்தை இயற்கைக்கு மாறாக உணரும் பட்சத்தில் அல்லது எதிர்கொள்ளும் பட்சத்தில் பிராணாயாமம் செய்வதை அப்படியே நிறுத்தி விடுவது நல்லது.\n\n•யோகாசனங்கள் செய்பவர்கள் பிராணாயாமத்தை மிகவும் எளிதாகப் பழகி விடுவார்கள். அதனால் யோகாசனத்தின் அடிப்படை அறிவு பிராணாயாமத்திற்கு மிகவும் முக்கியமானது.";
//                pranayamamVO.inhaleRatio = 2;
//                pranayamamVO.holdRatio = 0;
//                pranayamamVO.exhaleRatio = 2;
//                pranayamamVO.retainRatio = 0;
//                pranayamamVO.inhaleBeginner = 10;
//                pranayamamVO.inhaleIntermediate = 14;
//                pranayamamVO.inhaleExpert = 20;
//                pranayamamVO.breathingCycle = 3;
//                break;
//            case 6:
//                pranayamamVO.title = "சூர்ய நாடிப் பிராணாயாமம் ";
//                pranayamamVO.procedure = "காற்றோட்டம் உள்ள இடத்தில் உங்களுக்குப் பிடித்த ஆசனத்தில் ஒரு விரிப்பின் மீது அமருங்கள். (பத்மாசனத்தில் தான் அமர வேண்டும் என்பது இல்லை). கூன் விழாத படி முதுகை நிமிர்த்துங்கள். இப்பொழுது இடது மூக்கின் நாசியை மோதிர விரலால் மூடிய படி காற்றை வலது நாசி வழியாக உள்ளே இழுக்கவும். [மூச்சை 1:4:2 (மூச்சை உள்ளே இழுத்தல் : மூச்சை உள்ளே வைத்தல் : மூச்சை வெளியிடுதல்) என்ற விகிதத்தில் தான் பிராணாயாமம் செய்தல் வேண்டும்] பின்னர் தம் பிடித்தபடி மேற்கண்ட விகிதப்படி இருந்து விட்டு [வலது நாசியை மூடி இருந்த கட்டை விரலை எடுத்து விட்டு] காற்றை இடது நாசி வழியாக வெளியே விடவும்.  இது ஒரு செட் ஆகும். இப்படியாக ஐந்து செட்களை ஆரம்ப நாட்களில் செய்து போகப் போக பத்து செட்கள் வரை செல்லலாம்.  ஆரம்ப நிலையில் உள்ளவர்கள் 'தம்' பிடிக்க வேண்டாம். நன்கு பழகிய பிறகு 'தம்' பிடியுங்கள்.";
//                pranayamamVO.caution = "ரத்தக் கொதிப்பு உள்ளவர்கள் இந்த மூச்சுப் பயிற்சியை தவிர்த்தல் நலம்.\n\n•வெயில் காலங்களில் இந்த மூச்சுப் பயிற்சியை தவிர்த்தல் நலம்.";
//                pranayamamVO.benefits = "வாயுத் தொல்லை நீங்கும்.\n\n•உடலை வெப்பப் படுத்தி ஊளை சதைகளை குறைக்கும்.\n\n•செரிமானம் நல்ல முறையில் அதிகரிக்கும்.\n\n•முதுமை எளிதில் ஏற்படாது.\n\n•குளிர் பிரதேசங்களில் உள்ளவர்களுக்கு இந்தப் பயிற்சி பெரிதும் உதவும்.";
//                pranayamamVO.bestPractices = "ஒரு நாளைக்கு சுமார் மூன்று நிமிடங்கள் இதனை செய்தாலே போதுமானது.";
//                pranayamamVO.prerequisite = "நமது மூக்கின் இரு நாசித் துவாரங்களில் வலது புறம் சூரிய பாகம் என்றும் இடது புறம் சந்திர பாகம் என்றும் அழைக்கப்படுகிறது. வலது புறத்தில் இருக்கும் நாசித்துவாரத்தின் வழியாக காற்றை உள்வாங்கினால் அது சூரிய நாடிப்   பிராணாயாமம் ஆகும். அதுவே இடது நாசியின் வழியாக காற்றை உள் வாங்கினால் அதனை சந்திர நாடிப்  பிராணாயாமம் என்பர். இதனை அனைவரும் ஞாபகத்தில் வைத்திருக்க வேண்டும்.";
//                pranayamamVO.tips = "சூரிய நாடிப் பிராணாயாமத்தை அதிக குளிர் பிரதேசங்களிலும் அதே போல சந்திர நாடிப் பிராணாயாமத்தை அதிக வெயில் பிரதேசங்களிலும் செய்து வர நோய்கள் நம்மை அண்டாது. பிராணாயாமத்தை முறைப்படி கையாண்டால் பித்தம் விலகி சித்தநிலை கைவசப்படும் என்பது ஆன்றோர்கள் கருத்து.  ";
//                pranayamamVO.inhaleRatio = 2;
//                pranayamamVO.holdRatio = 1;
//                pranayamamVO.exhaleRatio = 2;
//                pranayamamVO.retainRatio = 0;
//                pranayamamVO.inhaleBeginner = 10;
//                pranayamamVO.inhaleIntermediate = 16;
//                pranayamamVO.inhaleExpert = 20;
//                pranayamamVO.breathingCycle = 3;
//                break;
//            case 7:
//                pranayamamVO.title = "சந்திர நாடிப் பிராணாயாமம்";
//                pranayamamVO.procedure = "வலது நாசியை கட்டை விரலைக் கொண்டும். இடது நாசி துவாரத்தை மோதிர விரலைக் கொண்டும் மூட வேண்டும். இதனை எப்போதுமே கவனத்தில் கொள்ள வேண்டும். 1:4:2 என்ற விகிதத்தில் இந்த சுவாச பயிற்சியை செய்ய வேண்டும். இடது நாசி வழியாக காற்றை உள்ளே இழுத்து சிறிது காலம் 'தம்' பிடித்து பின்னர் வலது நாசி வழியாக மூச்சுக் காற்றை வெளியே விட வேண்டும். இதுவே சந்திர நாடிப் பிராணாயாமம் ஆகும். இந்த மூச்சுப் பயிற்சியை குளிர் காலத்தில் செய்யக்கூடாது.";
//                pranayamamVO.caution = "சைனஸ் பிரச்சனை உள்ளவர்கள் மற்றும் சளித் தொந்தரவு கொண்டவர்கள் இதனை கண்டிப்பாக செய்ய வேண்டாம்.";
//                pranayamamVO.benefits = "உடல் உஷ்ணத்தை தணிக்கும்.\n\n•நெஞ்சு எரிச்சல் குணமாகும்.\n\n•சோம்பேறித்தனம் நீங்கும்.";
//                pranayamamVO.bestPractices = "ஒரு நாளைக்கு மூன்று நிமிடங்கள் இந்தப் பிராணாயாமத்தை பழகினாலே போதும்.";
//                pranayamamVO.prerequisite = "சந்திர நாடிப் பிராணாயாமத்தை தினமும் செய்து வர பதற்றம் குறையும். முடிவுகளை எடுக்கும் திறன் அதிகரிக்கும். முன்கோபம் குறையும். அதனால் அதிக மன உளைச்சல் இருப்பவர்கள் இதனை அனுதினமும் செய்து வருவது நல்லது.";
//                pranayamamVO.tips = "பொதுவாகப்  பிராணாயாமத்தை செய்யும் சமயத்தில் வயிறு காலியாக இருத்தல் வேண்டும். இதற்காகவும் தான் பிராணாயாமத்தை காலையில் செய்வது நல்லது என்கிறார்கள். அதிலும் காலைக்கடன்களை முடித்த பிறகு பிராணாயாமத்தை செய்வது மிக உத்தமம்.";
//                pranayamamVO.inhaleRatio = 2;
//                pranayamamVO.holdRatio = 1;
//                pranayamamVO.exhaleRatio = 2;
//                pranayamamVO.retainRatio = 0;
//                pranayamamVO.inhaleBeginner = 10;
//                pranayamamVO.inhaleIntermediate = 16;
//                pranayamamVO.inhaleExpert = 20;
//                pranayamamVO.breathingCycle = 3;
//                break;
//            case 8:
//                pranayamamVO.title = "உஜ்ஜயி பிராணாயாமம் ";
//                pranayamamVO.procedure = "\"ud\" என்றால் \"சத்தம்\" என்று பொருள். இந்த மூச்சுப் பயிற்சியை செய்யும் சமயத்தில் ஏற்படும் சத்தத்தால் இப்படிப் பெயர் பெற்றது. காற்றோட்டம் உள்ள இடத்தில் உங்களுக்குப் பிடித்த ஆசனத்தில் [பத்மாசனம் இல்லை சவாசனம்] ஒரு விரிப்பின் மீது அமருங்கள். (பத்மாசனத்தில் தான் அமர வேண்டும் என்பது இல்லை). கூன் விழாத படி முதுகை நிமிர்த்துங்கள்.வாய் வழியாக கண்ணாடியில் காற்றை நீராவி பட ஊதுவது போல மூச்சை உள்ளேயும், வெளியேயும் விடவும் (அதாவது இங்கு சுவாசம் தொண்டையின் உதவியுடன் நடந்தேறும்). மூச்சை உள்ளே இழுப்பதும், வெளியே விடுவதும் நார்மல் ஆக சீராக இருந்தாலே போதும்.";
//                pranayamamVO.caution = "இருதய நோயாளிகள் இந்தப் பிராணாயாமத்தை செய்யக் கூடாது.\n\n•அறுவை சிகிச்சை ஏதேனும் நடந்திருப்பினும் இந்த மூச்சுப் பயிற்சியை செய்யக் கூடாது.\n\n•இந்த மூச்சுப் பயிற்சியை செய்யும் சமயத்தில் ஏதேனும் அசௌக்கியம் ஏற்பட்டால் உடனே மேற்கொண்டு இதனை தொடர்வதை நிறுத்திக் கொள்ள வேண்டும்.\n\n•பிராணாயாமத்தில் கை தேர்ந்தவர்கள் மட்டுமே இதனை செய்ய வேண்டும்.";
//                pranayamamVO.benefits = "இது ஆஸ்துமா, சளித் தொந்தரவுகள், மூக்கு மற்றும் காது அடைப்புகளை நீக்குகிறது.";
//                pranayamamVO.bestPractices = "ஒரு நாளைக்கு சுமார் இரண்டு நிமிடங்கள் இதனை செய்தாலே போதுமானது தான்.";
//                pranayamamVO.prerequisite = "பிராணயாமத்தை செய்வதால் நமது ஆயுள் காலம் நோயின்றி நீடிக்கிறது. இது எப்படி என்றால் நமது உடலில் இருக்கும் முக்கிய நாடிகளான வாதம், பித்தம், கபம் ஆகிய இவை மூன்றும் சமநிலையை அடைகிறது. பொதுவாக மேற்கண்ட மூன்று நாடிகளும் சம நிலையில் இல்லாத சமயத்தில் மனதின் வியாதிகளின் தொல்லையால் அசௌக்கியத்தை உணருகிறான் என்கிறது ஆயுர்வேதம்.";
//                pranayamamVO.tips = "ஒருவேளை பிராணாயாமத்தை காலையில் செய்ய முடியவில்லை என்றால் மாலையில் செய்யலாம் அதில் தவறில்லை ஆனால் மாலையில் பிராணாயாமம் செய்வது முழு பலன் அளிக்காது.";
//                pranayamamVO.inhaleRatio = 4;
//                pranayamamVO.holdRatio = 0;
//                pranayamamVO.exhaleRatio = 4;
//                pranayamamVO.retainRatio = 0;
//                pranayamamVO.inhaleBeginner = 4;
//                pranayamamVO.inhaleIntermediate = 8;
//                pranayamamVO.inhaleExpert = 14;
//                pranayamamVO.breathingCycle = 3;
//                break;
//            case 9:
//                pranayamamVO.title = "ப்ராமரி பிராணாயாமம் ";
//                pranayamamVO.procedure = "காற்றோட்டம் உள்ள இடத்தில் உங்களுக்குப் பிடித்த ஆசனத்தில் [பத்மாசனம் இல்லை சவாசனம்] ஒரு விரிப்பின் மீது அமருங்கள். (பத்மாசனத்தில் தான் அமர வேண்டும் என்பது இல்லை). கூன் விழாத படி முதுகை நிமிர்த்துங்கள். காதுகள் இரண்டையும் இரு கைகளில் உள்ள கட்டை விரல்களைக் கொண்டு மூடுங்கள். பின்னர் நடு விரல்களைக் கொண்டு கண்களை மூடுங்கள். இரு கைகளில் உள்ள மோதிர விரலை இரு நாசிகளின் துவாரங்களுக்கு அருகே கொண்டு செல்லவும். இப்பொழுது மூக்கினால் காற்றை உறிஞ்சவும். பின்னர் மூக்கை அரை குறையாக மூடி வாயில் \"ஹம்\" சத்தத்துடன் காற்றை வெளியிடவும். இவ்வாறு ஐந்து முறைகள் செய்து பின்னர் கைகளை எடுத்து கண்களை மெல்லத் திறக்கவும். இதுவே பிராம்ரி பிராணாயாமம் ஆகும். ஒரு முறைக்கு நான்கு வினாடிகள் இதனைப் பழகினால் போதுமானது தான்.";
//                pranayamamVO.caution = "இருதய நோயாளிகள், மிகவும் வயதானவர்கள், கற்பிணிப் பெண்கள், அண்மையில் அறுவை சிகிச்சை நடந்தவர்கள், அதீத ஆஸ்துமா நோயாளிகள் என இவர்கள் அனைவரும் மருத்துவரின் ஆலோசனைப் படி செயல்படவும்.  ";
//                pranayamamVO.benefits = "குரல் இனிமையாகும்.\n\n•தொண்டை சம்மந்தமான பிரச்சனைகள் நீங்கும்.\n\n•உடலில் ரத்த ஓட்டத்தை அதிகரிக்கிறது.\n\n•உடலில் உள்ள சுரப்பிகள் அனைத்தும் நன்கு வேலை செய்ய உதவுகிறது.    ";
//                pranayamamVO.bestPractices = "ஒரு நாளைக்கு சுமார் இரண்டு நிமிடங்கள் இதனை செய்தாலே போதுமானது தான்.";
//                pranayamamVO.prerequisite = "பிராணாயாமம் - பிராணன் + யாமம் என்று பிரிக்கப்படுகிறது. பிராணன் என்பது உயிர் சக்தி இதனை காற்றுடன் தொடர்பு படுத்தி அதன் மூலமாக பிரபஞ்ச சக்தியை உள்ளே கிரகிக்கும் கலையே பிராணாயாமம் ஆகும். இதனை ஈசன் பெருமாளுக்கு சொல்ல, பெருமாள் தனது கிருஷ்ணாவதாரத்தில் அர்ஜுனனுக்கு உபதேசம் செய்கிறார். இது பற்றிய விவரங்கள் கீதையில் காணக்கிடைக்கிறது.  ";
//                pranayamamVO.tips = "பிராணயாமம், யோகாசனம், முத்திரைகள் ஆகிய இவை மூன்றையும் ஒருவன் தனது வாழ்நாளில் முறைப்படி கைக்கொண்டால் சித்த நிலையை அடைவான் என்கிறது அதர்வண வேதம்.  ";
//                pranayamamVO.inhaleRatio = 4;
//                pranayamamVO.holdRatio = 0;
//                pranayamamVO.exhaleRatio = 4;
//                pranayamamVO.retainRatio = 0;
//                pranayamamVO.inhaleBeginner = 4;
//                pranayamamVO.inhaleIntermediate = 8;
//                pranayamamVO.inhaleExpert = 16;
//                pranayamamVO.breathingCycle = 6;
//                break;
//            case 10:
//                pranayamamVO.title = "ஷிதலி பிராணாயாமம் ";
//                pranayamamVO.procedure = "காற்றோட்டம் உள்ள இடத்தில் உங்களுக்குப் பிடித்த ஆசனத்தில் [பத்மாசனம் இல்லை சவாசனம்] ஒரு விரிப்பின் மீது அமருங்கள். (பத்மாசனத்தில் தான் அமர வேண்டும் என்பது இல்லை). கூன் விழாத படி முதுகை நிமிர்த்துங்கள். கண்களை மூடி. நாக்கை நீட்டி அதனை ஒரு குழாய் போல செய்து கொள்ளவும். \"ssssssssssss\" என்ற சத்தத்துடன் காற்றை நன்றாக உள்ளே இழுக்கவும். பிறகு உள்ளே இழுக்கப்பட்ட காற்றை மேற்படி சதவீதக் கணக்கில் வைத்துக்கொண்டு பின்னர் மெல்ல மூக்கின் இரண்டு நாசிகளின் வழியே மூச்சை வெளியே விடவும். இதுவே ஷிதலி பிராணாயாமம் ஆகும்.";
//                pranayamamVO.caution = "குறைந்த ரத்த அழுத்தத்தை கொண்டவர்கள் இந்தப் பிராணாயாமத்தை செய்யக் கூடாது.\n\n•இருதய கோளாறுகள் உள்ளவர்கள். ஆஸ்துமா நோயாளிகள் கண்டிப்பாக இதனை செய்யக்கூடாது.\n\n•குளிர்காலங்களில் இதனை செய்யக்கூடாது.";
//                pranayamamVO.benefits = "இது ரத்தத்தை சுத்திகரிக்கிறது.\n\n•உடலை குளிர்ச்சி அடைய வைக்கிறது.\n\n•உயர் ரத்த அழுத்தத்தை குறைக்க உதவுகிறது.\n\n•வயிற்று எரிச்சல் மற்றும் உடலில் உள்ள தேவை இல்லாத நச்சுக்கள் வெளியேற உதவுகிறது.";
//                pranayamamVO.bestPractices = "இதனை ஒரு நாளைக்கு மூன்று முறை செய்தாலே போதும். (இதை மட்டும் செய்வதாக இருந்தால்) ";
//                pranayamamVO.prerequisite = "பகவத் கீதையின் 4.29 ஆம் கவிதையில் பிராணயாமா குறிப்பிடப்பட்டிருக்கிறது.";
//                pranayamamVO.tips = "பிரணாயாயம் எனும் மூச்சுப் பயிற்சி பயில்பவர், எந்த ஒரு பிராணாயாமத்தையும் செய்வதற்கு முன்னாள் சிறிது நேரம் பத்மாசனத்தில் அமர்ந்து, வலது நாசித்துவாரத்தை இடது கை மோதிர விரலால் மூடி, இடது நாசித்துவரத்தின் வழியாக சீராக மூச்சினை உள்ளிழுக்கவேண்டும். இதனை பூரகம் என்பர். அவ்வாறு உள்ளிழுத்த சுவாசக் காற்றினை எவ்வளவு நேரம் நெஞ்சினுள் நிறுத்த முடியுமோ, அவ்வளவு நேரம் நிறுத்த வேண்டும். இதற்கு கும்பகம் என்பர். பின்னர் இடது கை கட்டை விரலால் இடது நாசிதுவாரத்தை மூடிக் கொண்டு, வலது நாசித் துவாரத்தின் வழியாக மெதுவாகும், ஒரே சீராகவும் வெளியிடுதல் வேண்டும். இதற்கு ரோசகம் என்பர். பின்னர் இடது நாசிதுவாரத்தை மூடி வலது நாசி துவாரத்தின் வழியே சீராக மூச்சினை உள்ளிழுத்து, நிலை நிறுத்திய பின்னர், வலது நாசி துவாரத்தின் வழியே சீராக மூச்சினை வெளியிட வேண்டும். இதன் பிறகு மற்ற பிராணாயாமங்களை பழகுதல் நன்று.  ";
//                pranayamamVO.inhaleRatio = 2;
//                pranayamamVO.holdRatio = 1;
//                pranayamamVO.exhaleRatio = 2;
//                pranayamamVO.retainRatio = 0;
//                pranayamamVO.inhaleBeginner = 4;
//                pranayamamVO.inhaleIntermediate = 10;
//                pranayamamVO.inhaleExpert = 12;
//                pranayamamVO.breathingCycle = 3;
//                break;
//            case 11:
//                pranayamamVO.title = "ஷீட்கரி  பிராணாயாமம் ";
//                pranayamamVO.procedure = "காற்றோட்டம் உள்ள இடத்தில் உங்களுக்குப் பிடித்த ஆசனத்தில் [பத்மாசனம் இல்லை சவாசனம்] ஒரு விரிப்பின் மீது அமருங்கள். (பத்மாசனத்தில் தான் அமர வேண்டும் என்பது இல்லை). கூன் விழாத படி முதுகை நிமிர்த்துங்கள். பின்னர் வாயை அகலமாகத் திறந்து பற்கள் மூலமாக காற்றை மேலே ஏற்கனவே கூறிய சதவிகிதத்தின் அடிப்படையில் காற்றை உள்ளே இழுக்கவும். \"ஸ்ஸ்ஸ்ஸ்\" சத்தத்துடன் காற்றை உள்ளே இழுக்க வேண்டும். பின்னர் மூக்கின் இரு துவாரங்கள் வழியே மெல்ல காற்றை வெளியிட வேண்டும். இதுவே ஷித்கரி பிராணாயாமம் ஆகும்.";
//                pranayamamVO.caution = "குறைந்த ரத்த அழுத்தம் உடையவர்கள் இதனை செய்யக்கூடாது.\n\n•இருதய கோளாறுகள் உள்ளவர்கள் இதனை செய்யக்கூடாது.\n\n•ஆஸ்துமா நோயாளிகள் இதனை செய்யக்கூடாது.\n\n•குளிர் காலங்களில் இதனை செய்யக்கூடாது.";
//                pranayamamVO.benefits = "இது உடலை குளிர்ச்சி அடைய வைக்கிறது.\n\n•அகத்தை அழகு படுத்தி அதன் மூலம் முகத்தையும் அழகுபடுத்துகிறது. இதனால் மன்மதனை போன்ற முகத்தோற்றம் கிடைக்கிறது.\n\n•உயர் ரத்த அழுத்தத்தை குறைக்கிறது.\n\n•உடலில் உள்ள நச்சுக்களை வெளியேற்றுகிறது.\n\n•அஜீரணக் கோளாறுகளை நீக்குகிறது.";
//                pranayamamVO.bestPractices = "இதனை ஒரு நாளைக்கு மூன்று முறை செய்தாலே போதும். (இதை மட்டும் செய்வதாக இருந்தால்) ";
//                pranayamamVO.prerequisite = "பிராணயாமா உத்திகள் (ப்ராமரி பிராணாயாமம்,ஷிதலி பிராணாயாமம், ஷீட்கரி  பிராணாயாமம், அக்னிசார் பிராணாயாமம்) கவனத்துடன் பயிற்சி செய்யப்படவேண்டும் என்றும் முன்னேற்றமடைந்த பிராணயாமா உத்திகள் ஒரு ஆசிரியரின் வழிகாட்டுதலுடனே பயிற்சி செய்யப்படவேண்டும் என்றும் பல யோகா ஆசிரியர்கள் பரிந்துரைக்கிறார்கள். இந்த எச்சரிக்கைகள் பாரம்பரியமிக்க இந்து இலக்கியங்களிலும் கூட சொல்லப்பட்டிருக்கிறது.";
//                pranayamamVO.tips = "பிராணாயாமத்தை முறையாக செய்து வந்தால் ஏராளமான நன்மைகள் ஏற்படும். உடல் ஆரோக்கியமாக இருக்கும். உடல் வளமையடையும். ஊளைச்சதை கரைந்து விடும். தேவைக்கு அதிகமான கொழுப்புச் சத்துக் குறையும். கண்கள் பிரகாசமடையும். வயிற்றுக்கோளாறு, ஜீரணக் கோளாறு ஆகியவை மறைந்துவிடும். உடல் உறுப்புகள் திறம்பட வேலை செய்யும். சிந்திக்கும் திறன் பெருகும்.";
//                pranayamamVO.inhaleRatio = 2;
//                pranayamamVO.holdRatio = 1;
//                pranayamamVO.exhaleRatio = 2;
//                pranayamamVO.retainRatio = 0;
//                pranayamamVO.inhaleBeginner = 4;
//                pranayamamVO.inhaleIntermediate = 10;
//                pranayamamVO.inhaleExpert = 12;
//                pranayamamVO.breathingCycle = 3;
//                break;
//        }
//        return pranayamamVO;
//    }
}
